{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 1300,
        "text": " OK, well, we love to talk up Chris's hair. And rightfully so. I'm here. It's coiffed. It's lovely. I want to get a little closer to it. But I'm sad to say I think I've discovered one hair-based competition I don't think you'd win."
      },
      {
        "start": 1300,
        "stop": 1500,
        "text": " I don't know, Wes. Don't count the hair out. What do you got?"
      },
      {
        "start": 1500,
        "stop": 2000,
        "text": " All right, well, maybe you want to throw down in the USA Mullet Championship."
      },
      {
        "start": 2000,
        "stop": 2200,
        "text": " I'll do it. For the show."
      },
      {
        "start": 2200,
        "stop": 2400,
        "text": " [MUSIC PLAYING]"
      },
      {
        "start": 2400,
        "stop": 2600,
        "text": " [MUSIC PLAYING]"
      },
      {
        "start": 2600,
        "stop": 2800,
        "text": " [MUSIC PLAYING]"
      },
      {
        "start": 2800,
        "stop": 3000,
        "text": " [MUSIC PLAYING]"
      },
      {
        "start": 3000,
        "stop": 3200,
        "text": " [MUSIC PLAYING]"
      },
      {
        "start": 3200,
        "stop": 3400,
        "text": " [MUSIC PLAYING]"
      },
      {
        "start": 3400,
        "stop": 3800,
        "text": " Hello, friends, and welcome back to your weekly Linux talk show. My name is Chris."
      },
      {
        "start": 3800,
        "stop": 3900,
        "text": " My name is Wes."
      },
      {
        "start": 3900,
        "stop": 4000,
        "text": " My name is Brent."
      },
      {
        "start": 4000,
        "stop": 4100,
        "text": " My name is Abix."
      },
      {
        "start": 4100,
        "stop": 5400,
        "text": " Hello, gentlemen. Well, we have a really fun show today. We took on a challenge. Could a demanding Linux user, someone who demands excellence, live with a reasonably low-cost Linux box?"
      },
      {
        "start": 5400,
        "stop": 6000,
        "text": " We take a look at a couple of surprising budget Linux PCs I bet you've never even heard of, and we'll see how they hold out."
      },
      {
        "start": 6000,
        "stop": 6900,
        "text": " Plus, we've been challenged to put Linux Mint to the test. Is the freshest Mint the best Linux for a low-end PC?"
      },
      {
        "start": 6900,
        "stop": 7600,
        "text": " We'll give that a shot and tell you our opinions as well. Then we'll round out the show with some great boosts, some picks, and a lot more."
      },
      {
        "start": 7600,
        "stop": 8200,
        "text": " So before we go any further, you know it's our duty. We got to say time-appropriate greetings to our virtual lug."
      },
      {
        "start": 8200,
        "stop": 8300,
        "text": " Hello, Mumble Room."
      },
      {
        "start": 8300,
        "stop": 8500,
        "text": " Hello, Chris, Matt, Brent."
      },
      {
        "start": 8500,
        "stop": 8600,
        "text": " Hello."
      },
      {
        "start": 8600,
        "stop": 8800,
        "text": " They did so many names today."
      },
      {
        "start": 8800,
        "stop": 9000,
        "text": " A very strong Mumble Room. Wow."
      },
      {
        "start": 9000,
        "stop": 9700,
        "text": " So great. Hello, everybody, and hello all of you up there in the quiet listening as well. Very nice to have you along for the show today."
      },
      {
        "start": 9700,
        "stop": 10500,
        "text": " I also want to say good morning over to our friends over at TailScale. TailScale is a mesh VPN protected by WireGuard."
      },
      {
        "start": 10500,
        "stop": 10900,
        "text": " We love it, and it's going to change your networking game. It's going to blow your mind."
      },
      {
        "start": 10900,
        "stop": 11400,
        "text": " Go see what WireGuard is capable of. Oh, and say good morning, too. Go over there. I don't care what time of day it is."
      },
      {
        "start": 11400,
        "stop": 11900,
        "text": " Say good morning from Linux Unplugged at tailscale.com. Go try it up to 20 devices free."
      },
      {
        "start": 11900,
        "stop": 12100,
        "text": " You can wish them good night, too."
      },
      {
        "start": 12100,
        "stop": 12700,
        "text": " I suppose. I just like the idea of it's always morning at TailScale, you know? It's always a good morning over at TailScale."
      },
      {
        "start": 12700,
        "stop": 13200,
        "text": " Okay, so we got to start the show off with the meetups. You know, we've been talking about meetups. We've been talking about meetups."
      },
      {
        "start": 13200,
        "stop": 13700,
        "text": " And I know I've listened to podcasts where I'm like, well, that meetup doesn't apply to me. I wish they didn't talk about it all the time."
      },
      {
        "start": 13700,
        "stop": 14000,
        "text": " But here's the thing, everybody. Here's the thing."
      },
      {
        "start": 14000,
        "stop": 14400,
        "text": " These meetups are a bigger deal than I think you appreciate until you can attend them."
      },
      {
        "start": 14400,
        "stop": 15200,
        "text": " And that's kind of why we continue to talk about them is because once you go to a meetup, you experience a kind of connection that I think is,"
      },
      {
        "start": 15200,
        "stop": 15700,
        "text": " I don't know, it's almost like built into us that we need that kind of social connection with our tribe."
      },
      {
        "start": 15700,
        "stop": 16300,
        "text": " And so it can be re-energizing. It can be profound in a lot of ways."
      },
      {
        "start": 16300,
        "stop": 16800,
        "text": " And so we just had a couple of them wrap up. And that's one of the reasons Alex is here today."
      },
      {
        "start": 16800,
        "stop": 17300,
        "text": " How you feeling, Alex? Good morning. I know you just woke up a little bit before the show. You just got back home."
      },
      {
        "start": 17300,
        "stop": 17600,
        "text": " How was the meetup and everything? How was your flight and all that stuff?"
      },
      {
        "start": 17600,
        "stop": 18000,
        "text": " Well, I'm not going to lie, Chris. You probably hear it in my voice. I'm a little tired right now."
      },
      {
        "start": 18000,
        "stop": 18400,
        "text": " Yeah, I can hear it. You got a little bit of that frog."
      },
      {
        "start": 18400,
        "stop": 19100,
        "text": " Flight was fine. You know, 18-month-old toddler on a nine-hour fart tube flight. What could go wrong?"
      },
      {
        "start": 19100,
        "stop": 19900,
        "text": " We only had one meltdown that was, I don't know. Like, if anybody that's listening is a parent"
      },
      {
        "start": 19900,
        "stop": 20500,
        "text": " and has been in that situation where your kid is just hyperventilating from the crying on the plane,"
      },
      {
        "start": 20500,
        "stop": 21200,
        "text": " you just feel helpless in that moment. Like, you want the child to be okay. You want all the people to not be there."
      },
      {
        "start": 21200,
        "stop": 21600,
        "text": " It's just, yeah, that was a fun moment. But the meetup made it all worthwhile."
      },
      {
        "start": 21600,
        "stop": 22400,
        "text": " And we got a clip from the meetup from our buddy Joe Resington to just give us a quick flavor of the event."
      },
      {
        "start": 22400,
        "stop": 22900,
        "text": " Hello and welcome, everyone, to Late Night Self-hosted After Dark in the Park."
      },
      {
        "start": 22900,
        "stop": 23700,
        "text": " That's so great. You can hear the whole thing in Late Night Linux 190, which is going to come out on August 15th."
      },
      {
        "start": 23700,
        "stop": 24400,
        "text": " But I think it's pretty great that Joe joined. And so you've got the Late Night Linux crew there. You've got the JB crew there."
      },
      {
        "start": 24400,
        "stop": 24700,
        "text": " It's a big conspiracy to make us as jealous as possible."
      },
      {
        "start": 24700,
        "stop": 25300,
        "text": " Yeah, I was watching some, I was looking from afar, watching some of the pictures come in thinking, man, I wish I could have been there."
      },
      {
        "start": 25300,
        "stop": 26100,
        "text": " It was a beautiful evening. So to set the scene, we're in this Jubilee Park and Gardens just underneath the London Eye,"
      },
      {
        "start": 26100,
        "stop": 26700,
        "text": " down by the River Thames on the South Bank. And there's just, you know, groups of people peppered around on the grass,"
      },
      {
        "start": 26700,
        "stop": 27200,
        "text": " you know, having a little picnic and stuff. You know, mid-twenties in the temperature, a little bit of sunshine."
      },
      {
        "start": 27200,
        "stop": 27700,
        "text": " It was just the perfect evening to be outside with a group of friends."
      },
      {
        "start": 27700,
        "stop": 28100,
        "text": " And a pretty good crowd, too. It looks like you got, what, nearly 100 folks there?"
      },
      {
        "start": 28100,
        "stop": 28300,
        "text": " So almost as many people that signed up or more?"
      },
      {
        "start": 28300,
        "stop": 29300,
        "text": " Well, I took with me 75 stickers. 150 stickers, sorry. And I had two packs and I came back with one unsealed pack."
      },
      {
        "start": 29300,
        "stop": 30100,
        "text": " So by my count, there were 74 people, plus a random lady that decided to come and sit behind Joe and I whilst we were recording."
      },
      {
        "start": 30100,
        "stop": 31000,
        "text": " There was this moment where we were in the middle of this show about 20 minutes in and this just random lady comes and sits like, you know, a foot behind me."
      },
      {
        "start": 31000,
        "stop": 31600,
        "text": " And I'm like, oh, this is going to go south. What is, because I could see the cider in her hand."
      },
      {
        "start": 31600,
        "stop": 32200,
        "text": " I was like, hmm, is she drunk? Is she going to cause problems? And, you know, she didn't. She sat there the whole time."
      },
      {
        "start": 32200,
        "stop": 32700,
        "text": " And then after we finished, I was, you know, I shouted out to anybody, has anybody not got a sticker?"
      },
      {
        "start": 32700,
        "stop": 33300,
        "text": " Because I was very insistent that everybody got a sticker because it was basically my counter for attendance."
      },
      {
        "start": 33300,
        "stop": 33400,
        "text": " Good idea, Alex."
      },
      {
        "start": 33400,
        "stop": 33900,
        "text": " And she went, yeah, I'll take a sticker. I'm like, sorry, who are you? And she went, do you need to know?"
      },
      {
        "start": 33900,
        "stop": 34300,
        "text": " I was like, hmm, no, I don't actually."
      },
      {
        "start": 34300,
        "stop": 34900,
        "text": " Man, this location is just so beautiful. It's got the Ferris wheel. Of course, you can see the rivers right there."
      },
      {
        "start": 34900,
        "stop": 35300,
        "text": " A huge crowd, it looks like, actually. Look at that crowd."
      },
      {
        "start": 35300,
        "stop": 36200,
        "text": " Yeah. So the thing about the South Bank, down by the Thames there, is you get a lot of street performers and they gather crowds of two, three hundred people at a time."
      },
      {
        "start": 36200,
        "stop": 36600,
        "text": " And the shows last ten minutes. And then at the end, you give them a couple of quid to say thank you."
      },
      {
        "start": 36600,
        "stop": 37300,
        "text": " And so it's just this really nice family relaxed vibe down by the river, which is exactly what I was going for with the location."
      },
      {
        "start": 37300,
        "stop": 38300,
        "text": " So it worked out great. And the fact that we had 75 or so people show up as well, I was very, very pleased."
      },
      {
        "start": 38300,
        "stop": 39100,
        "text": " And we had people from all over. We had some, I think the furthest by myself that people came was the Czech Republic."
      },
      {
        "start": 39100,
        "stop": 39600,
        "text": " We had two or three Norwegians there. There was a couple of Dutch people there. I know Bytes in the Mumble Room today."
      },
      {
        "start": 39600,
        "stop": 39900,
        "text": " I met Bytes at the meetup as well. That was nice."
      },
      {
        "start": 39900,
        "stop": 40100,
        "text": " I spent some money to be there for one day."
      },
      {
        "start": 40100,
        "stop": 40400,
        "text": " Did you? Was it kind of expensive to get there?"
      },
      {
        "start": 40400,
        "stop": 41000,
        "text": " Yeah. Even taking the train is enormously expensive. I found one of the cheaper flights."
      },
      {
        "start": 41000,
        "stop": 41800,
        "text": " But then I made a little mistake by taking the train back to the airport and paying 40 pounds for a one-way trip."
      },
      {
        "start": 41800,
        "stop": 42800,
        "text": " And some other little mistakes that made the trip a bit more expensive than I would like. But it's not, it can't be beaten by something else."
      },
      {
        "start": 42800,
        "stop": 43200,
        "text": " Lessons learned for next year. Right? So that way if Wes and I make it out there next year."
      },
      {
        "start": 43200,
        "stop": 43400,
        "text": " You can be our tour guide."
      },
      {
        "start": 43400,
        "stop": 44400,
        "text": " Yeah. But you get what I'm saying too, right, Alex? You get that kind of, that charge by being around people that want to talk about the same stuff, are excited about the same stuff, follow the shows. It's really fun."
      },
      {
        "start": 44400,
        "stop": 45100,
        "text": " It's very surreal meeting a group of complete strangers that know a lot about you and you know nothing about them."
      },
      {
        "start": 45100,
        "stop": 46000,
        "text": " Because this medium is a very one-way, for the most part, a very one-way medium, you know? Very weird. People are like, \"Oh, how's your mother-in-law's internet work?\""
      },
      {
        "start": 46000,
        "stop": 46500,
        "text": " And I'm like, \"Oh yeah, we talked about that in self-hosted, didn't we? That's how you know that.\""
      },
      {
        "start": 46500,
        "stop": 46800,
        "text": " Yeah, you do get a few things like that for sure."
      },
      {
        "start": 46800,
        "stop": 47000,
        "text": " They might know more than we know about ourselves at times."
      },
      {
        "start": 47000,
        "stop": 47800,
        "text": " And then you want to know how you know that Alex is truly a party animal is that Brent managed to talk him into going to another meetup when he got back to Raleigh."
      },
      {
        "start": 47800,
        "stop": 47900,
        "text": " What?"
      },
      {
        "start": 47900,
        "stop": 48300,
        "text": " Yeah, they got back at about 2pm here local time in Raleigh."
      },
      {
        "start": 48300,
        "stop": 48800,
        "text": " And since I'm, you know, to give a little context, I was house-sitting while Alex was away."
      },
      {
        "start": 48800,
        "stop": 49500,
        "text": " So, but I organized a little sneaky little micro meetup here in Raleigh, thanks to our matrix room. It was amazing!"
      },
      {
        "start": 49500,
        "stop": 50600,
        "text": " Hi, this is Brent from Raleigh. I found an Alex. Apparently he's doing two days, two continents, and two JB meetups. Hi, Alex."
      },
      {
        "start": 50600,
        "stop": 50900,
        "text": " And I even have some stickers left for this one. That is planning."
      },
      {
        "start": 50900,
        "stop": 51200,
        "text": " It's true, they've been re-imported for this purpose."
      },
      {
        "start": 51200,
        "stop": 51300,
        "text": " Absolutely."
      },
      {
        "start": 51300,
        "stop": 51600,
        "text": " And I found a few people. Hi!"
      },
      {
        "start": 51600,
        "stop": 51700,
        "text": " Hello!"
      },
      {
        "start": 51700,
        "stop": 51800,
        "text": " Hello, Alex and Blub!"
      },
      {
        "start": 51800,
        "stop": 51900,
        "text": " I'm Raleigh."
      },
      {
        "start": 51900,
        "stop": 52300,
        "text": " We've got, what, how many are we? Six? Six of us? And we're having a great time."
      },
      {
        "start": 52300,
        "stop": 52500,
        "text": " A Raleigh rabble."
      },
      {
        "start": 52500,
        "stop": 52700,
        "text": " A Raleigh Raleigh."
      },
      {
        "start": 52700,
        "stop": 53100,
        "text": " Sounds like you're really enjoying yourselves."
      },
      {
        "start": 53100,
        "stop": 53700,
        "text": " Yeah, we had a great time. I think it was probably a very different energy than the London meetup, right, Alex?"
      },
      {
        "start": 53700,
        "stop": 54700,
        "text": " Well, I think I was awake for like hour 16 when we sat down. Or 18. By the time we left, I was a little bit drunk with tiredness, wasn't I?"
      },
      {
        "start": 54700,
        "stop": 54900,
        "text": " Not even from the beer I'd had."
      },
      {
        "start": 54900,
        "stop": 55500,
        "text": " Yeah, easily. But you made it. It was a great time. We probably laughed more than anything. We had some good food."
      },
      {
        "start": 55500,
        "stop": 56700,
        "text": " And it was a nice low-key thing. And I hope, the whole idea with these sort of regional-based matrix rooms is that some of these meetups can happen on a regular basis."
      },
      {
        "start": 56700,
        "stop": 57400,
        "text": " And maybe even without JB folks. So we hope that I think we can facilitate that for listeners."
      },
      {
        "start": 57400,
        "stop": 58200,
        "text": " Right, that does seem to be happening. That we have a listener that emailed into office hours that wants to start organizing meetups on their own with just other JB listeners. I love it."
      },
      {
        "start": 58200,
        "stop": 59200,
        "text": " I think we'll cover it a bit more in Self Hosted as well, no doubt, talking about the meetup. But for anybody that's listening to this show that was in London, or in Raleigh last night, huge thanks for showing up."
      },
      {
        "start": 59200,
        "stop": 60600,
        "text": " I got a huge amount of energy from you all to continue doing this for a lot longer. It's weird sitting in your own room just talking into a microphone. It feels a little bit disconnected from reality sometimes."
      },
      {
        "start": 60600,
        "stop": 61600,
        "text": " And to actually connect in meet space with real human meatbags that have been listening. It's hard to describe really, but thank you all for coming. It means a lot."
      },
      {
        "start": 61600,
        "stop": 62100,
        "text": " Yeah, I'm really looking forward to more meetups too, because you want to keep it rolling."
      },
      {
        "start": 62100,
        "stop": 62900,
        "text": " I kind of loved it too. I was a little distracted, but I could see the various channels in Matrix just exploding with little pics. It made me feel like I was almost there in a way."
      },
      {
        "start": 62900,
        "stop": 63700,
        "text": " Yeah, it was nice to watch the London meetup and then the Raleigh group later. And like, you know, it happens often at these events, some gifts were given as well."
      },
      {
        "start": 63700,
        "stop": 64500,
        "text": " My name is Phillip and I brought some retired raspberry pies that have been collecting dust and I thought maybe you could put them to good use."
      },
      {
        "start": 64500,
        "stop": 65500,
        "text": " That is super generous. Now when you say \"retired,\" what exactly do you mean? And how old are they and what have they been used for?"
      },
      {
        "start": 65500,
        "stop": 66700,
        "text": " They are several years old. Actually, I can't remember how old they are. One is a Raspberry Pi 3, which is quite a bit older, and one is a Raspberry Pi 4."
      },
      {
        "start": 66700,
        "stop": 67000,
        "text": " They started out as a home assistant."
      },
      {
        "start": 67000,
        "stop": 67100,
        "text": " Of course."
      },
      {
        "start": 67100,
        "stop": 68700,
        "text": " And then I kind of moved on from home assistant to home kit and had grand designs to do other projects with them and never got around to it."
      },
      {
        "start": 68700,
        "stop": 69300,
        "text": " That sounds familiar. Well, thank you for bringing gifts. We didn't ask for gifts, but this is super amazing. Thank you."
      },
      {
        "start": 69300,
        "stop": 69400,
        "text": " You're very welcome."
      },
      {
        "start": 69400,
        "stop": 70600,
        "text": " That is so great, you know. And everybody's got a Raspberry Pi these days they're not using, so instead of feeling guilty about it, you could gift to Brantley who has been a Raspberry Pi short, you know?"
      },
      {
        "start": 70600,
        "stop": 70800,
        "text": " Not anymore. Thanks to my wonderful listeners."
      },
      {
        "start": 70800,
        "stop": 71000,
        "text": " Now you're Raspberry Pi rich."
      },
      {
        "start": 71000,
        "stop": 72200,
        "text": " You know, Phillip did also reveal a little later, which I unfortunately didn't get on audio, but he did reveal that his upgrade that sort of replaced these Raspberry Pis is now running Umbral and he's really loving it."
      },
      {
        "start": 72200,
        "stop": 73500,
        "text": " That is great. Boy, he's right in sync, isn't he? Although he went from home assistant to home kit, and in my humble opinion, usually you want to go from home kit to home assistant, but no judgment."
      },
      {
        "start": 73500,
        "stop": 73700,
        "text": " Oh, no home automation shame on this show. Come on."
      },
      {
        "start": 73700,
        "stop": 73800,
        "text": " No, no judgment."
      },
      {
        "start": 73800,
        "stop": 74100,
        "text": " Now Alex, we got a little gift from London as well, didn't we?"
      },
      {
        "start": 74100,
        "stop": 75100,
        "text": " We did. Listener Thor, who came in from Norway, has gifted the network one of these remarkable e-ink tablets. Remarkable is the brand name."
      },
      {
        "start": 75100,
        "stop": 76000,
        "text": " Of the thing. It's this iPad sized e-ink tablet display annotation device, note taking device."
      },
      {
        "start": 76000,
        "stop": 76600,
        "text": " And so we're going to let Brant put it through its paces over the next week or two before he comes to see you, Chris."
      },
      {
        "start": 76600,
        "stop": 76800,
        "text": " That's fun. Now is it a touch screen as well?"
      },
      {
        "start": 76800,
        "stop": 76900,
        "text": " Yes."
      },
      {
        "start": 76900,
        "stop": 78500,
        "text": " You know, I've explored it for about 38 seconds so far, so the journey begins now and I think I'll put it through its paces. It'll see a few airplanes and cars and hopefully trains as well, so we'll see how it does. Thank you, by the way."
      },
      {
        "start": 78500,
        "stop": 79100,
        "text": " I can't help but think that the best job for that would be a low power home assistant dashboard that's displaying you info."
      },
      {
        "start": 79100,
        "stop": 79200,
        "text": " Yeah, buddy."
      },
      {
        "start": 79200,
        "stop": 79400,
        "text": " You turned everything into a dashboard."
      },
      {
        "start": 79400,
        "stop": 79500,
        "text": " That's true."
      },
      {
        "start": 79500,
        "stop": 80200,
        "text": " I would say please send in your ideas. I would love to find about, you know, 20 different ways to use this thing, so send them in."
      },
      {
        "start": 80200,
        "stop": 80300,
        "text": " What OS do we know?"
      },
      {
        "start": 80300,
        "stop": 80600,
        "text": " Currently it says out of battery. Is that an OS?"
      },
      {
        "start": 80600,
        "stop": 81000,
        "text": " I'm wondering if it's a Linux. If anybody knows, send it in the show."
      },
      {
        "start": 81000,
        "stop": 81200,
        "text": " Are you suggesting the poor battery life is a Linux thing?"
      },
      {
        "start": 81200,
        "stop": 81600,
        "text": " No, it must be Android then. Hey-o."
      },
      {
        "start": 81600,
        "stop": 82700,
        "text": " All right, so the next round of meetups is nigh. We have a whole swath of West Coast meetups, so go to meetup.com/jupiterbroadcasting."
      },
      {
        "start": 82700,
        "stop": 83300,
        "text": " Wes, you caught this in the news recently, but it looks like NASA's going all in on the Linux copters."
      },
      {
        "start": 83300,
        "stop": 84200,
        "text": " The future plans, I guess, for Mars exploration are going to include a set of two helicopters for, like, the next rover."
      },
      {
        "start": 84200,
        "stop": 84300,
        "text": " Yeah."
      },
      {
        "start": 84300,
        "stop": 84400,
        "text": " It's going to come with two of them."
      },
      {
        "start": 84400,
        "stop": 85000,
        "text": " I'm also thinking of having them pick up samples for additional, like, missions to return those samples to Earth, so how about that?"
      },
      {
        "start": 85000,
        "stop": 85200,
        "text": " Yeah, so that's amazing."
      },
      {
        "start": 85200,
        "stop": 86300,
        "text": " Ingenuity has not only, I think, exceeded expectations, but it's clearly set the path forward for future space exploration with Linux copters."
      },
      {
        "start": 86300,
        "stop": 86400,
        "text": " That's just so awesome."
      },
      {
        "start": 86400,
        "stop": 87000,
        "text": " When we get down to JPL, I hope to get a chance to talk to Tim about this specifically and just kind of get his take on this."
      },
      {
        "start": 87000,
        "stop": 87700,
        "text": " You know, if this wasn't kind of the long goal, maybe they didn't want to outwardly say it, but I got to imagine they were kind of hoping if this all worked out, this is where things were going."
      },
      {
        "start": 87700,
        "stop": 88200,
        "text": " I wonder if we can get any tips to, like, make our own Linux copter. You know, they're not going anywhere. I kind of want one now."
      },
      {
        "start": 88200,
        "stop": 88800,
        "text": " You could ask Tim yourself, dear listener, just get your name in the hat, go to linuxunplugged.com/jpl."
      },
      {
        "start": 88800,
        "stop": 89700,
        "text": " We have 15 slots available to our audience to take a personalized tour of JPL, and we'll be pulling names from that hat as the event gets closer."
      },
      {
        "start": 89700,
        "stop": 90300,
        "text": " So that's linuxunplugged.com/jpl, and that's just a simple next cloud form that we have that you can fill out."
      },
      {
        "start": 90300,
        "stop": 91100,
        "text": " And then we also have our West Coast crew matrix room where we are organizing with locals along the West Coast and figuring out where people are at."
      },
      {
        "start": 91100,
        "stop": 91400,
        "text": " We'd love to have you join us there as well. That's in our matrix colony."
      },
      {
        "start": 91400,
        "stop": 92400,
        "text": " And details for all the meetups, the individual meetups we're stopping at from Oregon down to Southern California at meetup.com/JupyterBroadcasting."
      },
      {
        "start": 92400,
        "stop": 93300,
        "text": " All right. I think that's everything with that. The meetups take a big part of the show during the summer, but they're super important to us, so we want to dedicate some time to that."
      },
      {
        "start": 93300,
        "stop": 93600,
        "text": " You know what? There's not always a lot else going on."
      },
      {
        "start": 93600,
        "stop": 94600,
        "text": " That's true. It is the summer. A lot of developers, especially the ones outside the US, they do this crazy thing called vacation, and I think some of them are even taking, like, six weeks off at a time."
      },
      {
        "start": 94600,
        "stop": 95200,
        "text": " I don't know. They must not get paid for it, I'm sure. And they probably have all their medical coverage suspended because, you know, it's tied to their job, I'm sure."
      },
      {
        "start": 95200,
        "stop": 95300,
        "text": " Of course, of course, yeah."
      },
      {
        "start": 95300,
        "stop": 95800,
        "text": " Because otherwise that wouldn't make any sense. It would be completely unfair, and that's not how we would do it in the States, right guys?"
      },
      {
        "start": 95800,
        "stop": 96200,
        "text": " But it's cool. So development slows down a little bit sometimes."
      },
      {
        "start": 96200,
        "stop": 96400,
        "text": " You all right over there?"
      },
      {
        "start": 96400,
        "stop": 96700,
        "text": " Yeah, I'm good. I'm good."
      },
      {
        "start": 96700,
        "stop": 97000,
        "text": " Extra patriotic today."
      },
      {
        "start": 97000,
        "stop": 97300,
        "text": " Yeah. That's just one thing that, you know, whatever."
      },
      {
        "start": 97300,
        "stop": 98300,
        "text": " Let's talk about saving money, because some of us, you know, we don't need to be blowing money right now on expensive computers that can do the job perfectly fine."
      },
      {
        "start": 98300,
        "stop": 98700,
        "text": " This is great, too, for friends and family, people that just want a go-to Linux machine."
      },
      {
        "start": 98700,
        "stop": 99300,
        "text": " And, you know, here's one tip that Remember to Remember tweeted at me that I think is really the key one."
      },
      {
        "start": 99300,
        "stop": 99700,
        "text": " It's just got to remember to shop with Linux in mind when you're looking for this stuff."
      },
      {
        "start": 99700,
        "stop": 100100,
        "text": " Just like you would if you're going to buy something for the Mac. You got to shop with the Mac in mind."
      },
      {
        "start": 100100,
        "stop": 100800,
        "text": " It's a little less of a problem on Windows, but let's be honest, you got to do it on Windows, too, because you could end up with something that's really crap drivers, and that just makes your whole system suck."
      },
      {
        "start": 100800,
        "stop": 101000,
        "text": " So you really got to kind of shop careful on Windows, too."
      },
      {
        "start": 101000,
        "stop": 101300,
        "text": " You got to pick which third-party weird driver applications you want running on your box."
      },
      {
        "start": 101300,
        "stop": 101700,
        "text": " Right. Which auto-updater that starts every time your Windows box boots, which one do you want."
      },
      {
        "start": 101700,
        "stop": 102400,
        "text": " So, you know, to say it's a compromise to have to kind of shop with Linux in mind and compatibility in mind, I just disagree."
      },
      {
        "start": 102400,
        "stop": 102700,
        "text": " I think that's just the state of computing, but I just wanted to put that up front."
      },
      {
        "start": 102700,
        "stop": 103100,
        "text": " Everything we're going to talk about today, you just kind of want to shop with Linux compatibility in mind."
      },
      {
        "start": 103100,
        "stop": 103800,
        "text": " And today I want to talk about four cheap Linux PCs, and I use that term generously."
      },
      {
        "start": 103800,
        "stop": 104100,
        "text": " I don't mean cheap as in quality. I just mean cheap as in price."
      },
      {
        "start": 104100,
        "stop": 104600,
        "text": " And I want to tell you about four I found. And then if you guys have any suggestions, I definitely want to hear those."
      },
      {
        "start": 104600,
        "stop": 105200,
        "text": " First, starting with not one that I have tried personally, but I heard about this from Adam Curry and it just seems like a crazy good deal."
      },
      {
        "start": 105200,
        "stop": 106500,
        "text": " Right now, brand new from Amazon, 160 US greenbacks for a B-Link Mini S PC with an 11th Gen Intel N5095 processor, 8 gigs of RAM and 128 gigabyte SSD."
      },
      {
        "start": 106500,
        "stop": 107000,
        "text": " I think it ships with Windows 11, but you could put Linux on there. It's 160 bucks new."
      },
      {
        "start": 107000,
        "stop": 107300,
        "text": " And they even have like a $10 off coupon right now. It's crazy."
      },
      {
        "start": 107300,
        "stop": 107900,
        "text": " So 150 bucks for a brand new 11th Gen Intel PC to run Linux."
      },
      {
        "start": 107900,
        "stop": 108300,
        "text": " That's kind of like just from start right there. But maybe you want to go even cheaper."
      },
      {
        "start": 108300,
        "stop": 108700,
        "text": " Maybe you're really on a budget. Maybe it's for, you know, maybe it's for your kids, maybe it's for yourself."
      },
      {
        "start": 108700,
        "stop": 109000,
        "text": " And you just don't want to spend a lot of money on this kind of stuff right now."
      },
      {
        "start": 109000,
        "stop": 109400,
        "text": " I want to tell you about a machine that I got since the last episode."
      },
      {
        "start": 109400,
        "stop": 110100,
        "text": " It is the Acer Switch One Intel Adam Z8300 1.4 gigahertz laptop."
      },
      {
        "start": 110100,
        "stop": 111000,
        "text": " And it's one of these that you can flip the screen around and run Linux as a tablet if you have the right distro."
      },
      {
        "start": 111000,
        "stop": 111500,
        "text": " So some people are into that, you know, convertible style. I have it here with me in the studio right now."
      },
      {
        "start": 111500,
        "stop": 112100,
        "text": " It's about the size of an 11 inch, you know, or so iPad with the keyboard."
      },
      {
        "start": 112100,
        "stop": 112500,
        "text": " It reminds me back of the days of like the netbook era, you know, kind of that size."
      },
      {
        "start": 112500,
        "stop": 112800,
        "text": " Yeah. And then of course you can flip the screen around and you do those kinds of shenanigans."
      },
      {
        "start": 112800,
        "stop": 113100,
        "text": " Although I don't know if I actually would ever try that. Here's the problem."
      },
      {
        "start": 113100,
        "stop": 113600,
        "text": " I haven't tried this machine personally because I got it off eBay and the bastard didn't include the power down."
      },
      {
        "start": 113600,
        "stop": 113900,
        "text": " Oh no. Didn't even. I forget. And of course it's some random barrel one. Right."
      },
      {
        "start": 113900,
        "stop": 114500,
        "text": " So I'm just mentioning this because forty five dollars. Oh my goodness."
      },
      {
        "start": 114500,
        "stop": 115000,
        "text": " Forty five dollars. Yes. It's an atom. Forty five dollars. That's like you're in pie prices."
      },
      {
        "start": 115000,
        "stop": 115500,
        "text": " And you can have basically a tablet PC with a keyboard and Linux can run just fine on there. Right."
      },
      {
        "start": 115500,
        "stop": 116100,
        "text": " Christmas. What's the age of this thing? Well, the Intel Atom X5 is pretty old."
      },
      {
        "start": 116100,
        "stop": 116500,
        "text": " I mean, it's not it's not a brand new machine. I think it's like a 2015 model."
      },
      {
        "start": 116500,
        "stop": 116800,
        "text": " Again, you're not going to get the latest and greatest for under a hundred bucks."
      },
      {
        "start": 116800,
        "stop": 117200,
        "text": " But you know, to have something under a hundred bucks that you could put Linux on."
      },
      {
        "start": 117200,
        "stop": 117700,
        "text": " It's nice to have that option. I think this is the episode where you're putting on like the used car salesman vibe."
      },
      {
        "start": 117700,
        "stop": 118300,
        "text": " You know, let me put you in an Intel Atom. This is a previously loved laptop with a special undercoating."
      },
      {
        "start": 118300,
        "stop": 118800,
        "text": " You're right. It is very tablet like in that like a bunch of the ports and stuff seem to be in on the screen side."
      },
      {
        "start": 118800,
        "stop": 119200,
        "text": " And then the keyboard is, you know, really just kind of like a keyboard that's attached. Right."
      },
      {
        "start": 119200,
        "stop": 119800,
        "text": " And it's got a front and back camera on the screen. Oh, perfect for selfies."
      },
      {
        "start": 119800,
        "stop": 120200,
        "text": " So that's an interesting one. But now I want to tell you about a really practical one."
      },
      {
        "start": 120200,
        "stop": 120600,
        "text": " This is just another hot Chris pick here. This is one that I personally own."
      },
      {
        "start": 120600,
        "stop": 121600,
        "text": " I actually bought this machine to run as to test it as potentially a replacement for Jupes's home server to replace my Raspberry Pi for."
      },
      {
        "start": 121600,
        "stop": 122900,
        "text": " But in the end, I decided the I/O was too limiting. And so this is the idea pad three 14 IML five hundred twenty gigabyte SSD Intel Pentium gold two point four gigahertz."
      },
      {
        "start": 122900,
        "stop": 123600,
        "text": " This one came with four gigs of RAM, but the bottom pops right off and you can upgrade basically all the components."
      },
      {
        "start": 123600,
        "stop": 124100,
        "text": " But it's very it's very serviceable in that regard. The RAM and the hard drive are accessible in the idea pad three."
      },
      {
        "start": 124100,
        "stop": 124700,
        "text": " And it's actually a pretty good little laptop. It's got a decent size to it. It's got a decent trackpad."
      },
      {
        "start": 124700,
        "stop": 125200,
        "text": " It's got a good keyboard for this price range. Doesn't look bad. I mean, it doesn't stand out, but that's kind of what you want in a laptop."
      },
      {
        "start": 125200,
        "stop": 125700,
        "text": " It's just a simple ThinkPad. It's of the kind of older ThinkPad styling because it's a little bit older."
      },
      {
        "start": 125700,
        "stop": 126200,
        "text": " And it has the Intel Gold CPU, which means it has quick sync, which is one of the reasons I bought it."
      },
      {
        "start": 126200,
        "stop": 126800,
        "text": " But that might be useful to you. Check that out there, Wes. So that one's a little heavier. This one goes for two hundred and sixty dollars."
      },
      {
        "start": 126800,
        "stop": 127300,
        "text": " It's not bad, though, and it's well weighted. It does not feel off kilter or off access when I'm holding it here, which I like."
      },
      {
        "start": 127300,
        "stop": 127800,
        "text": " Yeah, it is. It is got it's got a lot of the pros of a well-designed Lenovo."
      },
      {
        "start": 127800,
        "stop": 128500,
        "text": " It's a little old, but I still think that I still think that Intel Pentium Gold CPU is actually a pretty good little chip."
      },
      {
        "start": 128500,
        "stop": 129200,
        "text": " So I think overall, that's like out of all of the list, that's going to be my most practical recommendation right here."
      },
      {
        "start": 129200,
        "stop": 129800,
        "text": " Now, Chris, I see you have a dongle dangling off that thing. Is there a specific purpose for that that you're using it for?"
      },
      {
        "start": 129800,
        "stop": 130100,
        "text": " Yeah, you could have taken these off before you handed it to me."
      },
      {
        "start": 130100,
        "stop": 130700,
        "text": " Well, it doesn't have Ethernet built in, so that is an Ethernet dongle just because I like to have it wired sometimes."
      },
      {
        "start": 130700,
        "stop": 131200,
        "text": " And that's not too uncommon at this price point, is to not get Ethernet in there."
      },
      {
        "start": 131200,
        "stop": 131400,
        "text": " Or at the higher price points, too."
      },
      {
        "start": 131400,
        "stop": 131600,
        "text": " Yeah, unfortunately you're right about that."
      },
      {
        "start": 131600,
        "stop": 132100,
        "text": " This next one I'm about to talk about doesn't have Ethernet, but it's not because they're being cheap."
      },
      {
        "start": 132100,
        "stop": 132400,
        "text": " It's because it literally wouldn't fit on the hardware."
      },
      {
        "start": 132400,
        "stop": 132800,
        "text": " This one's a lot of fun, guys. This is something really special."
      },
      {
        "start": 132800,
        "stop": 133300,
        "text": " I don't even know how I didn't know about this. It's called the Acer Mini PC."
      },
      {
        "start": 133300,
        "stop": 133800,
        "text": " And it was sold in a cloud professor kit. It's a whole kit that comes..."
      },
      {
        "start": 133800,
        "stop": 134200,
        "text": " You can't just say cloud professor kit like that and assume we know what that means."
      },
      {
        "start": 134200,
        "stop": 134500,
        "text": " Try it. Open it up here, Wes. I brought it into the studio."
      },
      {
        "start": 134500,
        "stop": 134800,
        "text": " This is the cloud professor kit, and maybe you can describe what's in there."
      },
      {
        "start": 134800,
        "stop": 135000,
        "text": " Take a look while I talk about this device."
      },
      {
        "start": 135000,
        "stop": 135800,
        "text": " So this device is smaller than a Chromecast in overall size, or about the size of a Chromecast."
      },
      {
        "start": 135800,
        "stop": 136500,
        "text": " It has a 1.4 gigahertz CPU, 2 gigabytes of RAM, 16 gigabytes of hard drive space."
      },
      {
        "start": 136500,
        "stop": 137000,
        "text": " It has an HDMI out. They managed to put USB-A on the thing."
      },
      {
        "start": 137000,
        "stop": 137600,
        "text": " And they have what seems to be a microSD type slot and a mini USB slot, probably for power."
      },
      {
        "start": 137600,
        "stop": 138000,
        "text": " The thing fits literally in the palm of my hand."
      },
      {
        "start": 138000,
        "stop": 138600,
        "text": " It is absolutely tiny, and it comes pre-installed with Linux on it."
      },
      {
        "start": 138600,
        "stop": 139100,
        "text": " Okay, so it looks like this thing is targeted. Is this a PC to use while you're making an Arduino?"
      },
      {
        "start": 139100,
        "stop": 139200,
        "text": " Yeah, it's for training."
      },
      {
        "start": 139200,
        "stop": 139400,
        "text": " Embedded? Oh, okay."
      },
      {
        "start": 139400,
        "stop": 139800,
        "text": " Yeah, so this kit actually comes with an Arduino in the box, too, so you can connect it."
      },
      {
        "start": 139800,
        "stop": 140200,
        "text": " Yeah, it's got a nice little seed shield here, too."
      },
      {
        "start": 140200,
        "stop": 140600,
        "text": " So you get a whole kit with a book. You get the kit."
      },
      {
        "start": 140600,
        "stop": 140900,
        "text": " Temperature sensor, light sensor. You can make some fun projects with this."
      },
      {
        "start": 140900,
        "stop": 141600,
        "text": " Yes, and it is 38 US dollars. 38 US dollars."
      },
      {
        "start": 141600,
        "stop": 142000,
        "text": " Now, I think you also get to call yourself a cloud professor after you've bought this, right?"
      },
      {
        "start": 142000,
        "stop": 142100,
        "text": " Right."
      },
      {
        "start": 142100,
        "stop": 142200,
        "text": " So that's also a big bad thing."
      },
      {
        "start": 142200,
        "stop": 142400,
        "text": " Well, it's on the thing, so it says a--"
      },
      {
        "start": 142400,
        "stop": 142500,
        "text": " It also comes with a badge."
      },
      {
        "start": 142500,
        "stop": 142600,
        "text": " Right."
      },
      {
        "start": 142600,
        "stop": 143200,
        "text": " Yeah, and so it's an Atom. It's a fifth-gen Atom CPU, so it's an x86 CPU."
      },
      {
        "start": 143200,
        "stop": 143700,
        "text": " It's smaller than a Raspberry Pi in terms of overall width, but it's about the length of a Raspberry Pi board."
      },
      {
        "start": 143700,
        "stop": 144100,
        "text": " And you can just slap that on the back of one of these studio monitors. It's obviously fanless."
      },
      {
        "start": 144100,
        "stop": 144600,
        "text": " Yeah, and with the HDMI out, you can hook it up to anything that takes HDMI. It's totally silent."
      },
      {
        "start": 144600,
        "stop": 145400,
        "text": " This has me rethinking the Raspberry Pi for a lot of things, and that's what I want to use this for, is what I might use a Pi for, but I want x86 compatibility."
      },
      {
        "start": 145400,
        "stop": 145800,
        "text": " Whoa, okay. So you kind of undersold this whole segment. Interesting, yeah."
      },
      {
        "start": 145800,
        "stop": 146200,
        "text": " But really, it's a Titanic shift in how you're deploying things."
      },
      {
        "start": 146200,
        "stop": 146800,
        "text": " Well, we'll see. I mean, they're cheaper and more available than a Raspberry Pi. That's just the reality of it right now."
      },
      {
        "start": 146800,
        "stop": 147100,
        "text": " Hopefully more successful than the Titanic, though, Wes."
      },
      {
        "start": 147100,
        "stop": 147700,
        "text": " Oh, we'll see about that. I mean, that's probably why they're going for 30 bucks or 40 bucks on eBay, right?"
      },
      {
        "start": 147700,
        "stop": 149000,
        "text": " I mean, I do think it's interesting, though, anytime you mention the Pi and the fact that you have, you know, you have, what, five or six, and we had Josh on Self Hosted a few weeks ago who has 47 or something crazy."
      },
      {
        "start": 149000,
        "stop": 150100,
        "text": " Like, the first place that my mind goes to has always been, just get a single x86 box and replace all of them, and you'll save power, you'll save money. These days, definitely save money."
      },
      {
        "start": 150100,
        "stop": 150400,
        "text": " So it's interesting to see you finally go down this path."
      },
      {
        "start": 150400,
        "stop": 151300,
        "text": " Yeah, that's how I actually got the IdeaPad, is I was thinking, well, one x86 box, a little more powerful, it has QuickSync on there, so it'd be great for Jellyfin or Plex."
      },
      {
        "start": 151300,
        "stop": 152100,
        "text": " And then I just wasn't really happy with the overall availability, and I thought, well, if I'm really going to go to the extreme, something like a Raspberry Pi that's x86 would be the way to go."
      },
      {
        "start": 152100,
        "stop": 153100,
        "text": " And this thing, as far as I can tell, runs off of a micro-USB for power, so the power consumption's going to be nothing, right? How cool is that? What do you think, Wes? You're holding it right now."
      },
      {
        "start": 153100,
        "stop": 154600,
        "text": " Yeah, I mean, it's nice. It's a good little form factor. I like that there's a full-size USB 3 on here, right? So it seems kind of, sure, could it have a few more plugins, you're going to need dongles maybe, but what it is for the price, yeah, seems worth a shot."
      },
      {
        "start": 154600,
        "stop": 155700,
        "text": " Yeah, so it's the Acer Mini PC with an Atom CPU, or you could just search for the Cloud Professor. It is what it is, guys, that's just what they call it."
      },
      {
        "start": 155700,
        "stop": 156400,
        "text": " I mean, I think you can find them on eBay without the whole kit as well, but I kind of wanted the kit. I mean, why not get the Arduino?"
      },
      {
        "start": 156400,
        "stop": 156900,
        "text": " You may be able to sell the Arduino for $38 and get your money back."
      },
      {
        "start": 156900,
        "stop": 157300,
        "text": " Well, I don't know, I think I want to give it away. I think I want to give the whole kit away after I play with it for a little bit."
      },
      {
        "start": 157300,
        "stop": 157400,
        "text": " That's a nice idea."
      },
      {
        "start": 157400,
        "stop": 158000,
        "text": " Yeah, so I'll keep it all together so that way we can just package the box back up and ship it out to a listener in the future."
      },
      {
        "start": 158000,
        "stop": 158700,
        "text": " So I'll put links to all of the eBay listings to these in the show notes if you want to try it out."
      },
      {
        "start": 158700,
        "stop": 159600,
        "text": " Do any of you guys have like a really just quick go-to budget Linux PC? We've got some recommendations that came in from the audience that we're going to get to as well, but we'll get to those in a bit."
      },
      {
        "start": 159600,
        "stop": 161000,
        "text": " I do. It's the HP 290 slim. It's one of these old thin client boxes. I think it's 8th gen Intel CPUs. They used to be available for under $100. I think it's closer to $150 now."
      },
      {
        "start": 161000,
        "stop": 161800,
        "text": " But typically these things come with the Celeron G4900, which has very capable Quick Sync performance."
      },
      {
        "start": 161800,
        "stop": 162200,
        "text": " It's been running my Blue Iris box now for a couple of years. It just does the job."
      },
      {
        "start": 162200,
        "stop": 163300,
        "text": " It comes with a 500 gigabyte spinner, I think, from most eBay sellers. I upgraded that to a SATA or an M.2 SATA or an NVMe SSD. I can't remember which."
      },
      {
        "start": 163300,
        "stop": 164200,
        "text": " So for under $200, I've got a very capable box. I know it's running Windows. I know you asked for a Linux box, but it would run Linux just fine."
      },
      {
        "start": 164200,
        "stop": 165400,
        "text": " That's a great recommendation. We got a suggestion too for Adele Wyse thin client from an anonymous listener, the 5070 thin client, and they said that it actually works pretty well for them."
      },
      {
        "start": 165400,
        "stop": 166400,
        "text": " $120 shipped. They added a 512 gigabyte M.2 and two 8 gig sticks of RAM. The whole thing off of Amazon is like $105 after they added the upgrades."
      },
      {
        "start": 166400,
        "stop": 167200,
        "text": " And then you buy the thin client itself for $120, you put it all together, you're under $300, and they say you've got a great Linux learning machine."
      },
      {
        "start": 167200,
        "stop": 167700,
        "text": " So it's the Wyse 5070 thin client. So two thin client recommendations."
      },
      {
        "start": 167700,
        "stop": 168700,
        "text": " I have been kind of decently surprised at some of those lower end, you know, the atoms in the Celeron line even these days. Like, if you don't need to do much, you're not doing serious crunching, it works."
      },
      {
        "start": 168700,
        "stop": 170100,
        "text": " The thing is about the Celeron that's in the HP boxer recommended, with Quick Sync, all of the hard processing is going through a hardware chip, you know, so all the threads are doing is just keeping the OS going really."
      },
      {
        "start": 170100,
        "stop": 171000,
        "text": " Yeah. I mean, it works for the iPad. Why not here, right? You just got to have the right software hardware combo. And that's where looking for something Quick Sync can make that."
      },
      {
        "start": 171000,
        "stop": 171300,
        "text": " We got a recommendation from Colin, I believe. Was it Brent?"
      },
      {
        "start": 171300,
        "stop": 172800,
        "text": " We actually got this recommendation twice. So I think it's probably a good one. Colin and Antal also suggested this one. It's a Minis Forum Desk Mini UM350 Ryzen mini PC."
      },
      {
        "start": 172800,
        "stop": 173100,
        "text": " And this one ships with Manjaro pre-installed on it, it looks like."
      },
      {
        "start": 173100,
        "stop": 174700,
        "text": " Yeah, it's maybe a little higher budget. It's at the $299. It's currently on sale for $299, but directly it's brand new. And so I think you can buy it directly from Minis Forum and a whole bunch of other places, eBay, you can get it on Amazon as well."
      },
      {
        "start": 174700,
        "stop": 176200,
        "text": " And I saw it, I didn't click into it, but I also saw a link at Walmart, so I don't know what that's about. But it seems like Minis Forum, which is new to me, has an interesting catalog of small and not too expensive machines that are worth checking out."
      },
      {
        "start": 176200,
        "stop": 177800,
        "text": " I love this tip. This looks like it'd be a great podcasting machine for doing recordings and whatnot there. What I love about Linux is that you can actually build a really awesome budget machine and not feel bad about it."
      },
      {
        "start": 177800,
        "stop": 180100,
        "text": " There's something about the Linux community where it can be an awesome cool guy thing to do to go down low end and make it work with the lowest end PC, where it always seems like in Windows, especially when you get to the gaming culture, it's always skews towards the biggest graphics card, the fastest CPU, the fastest machine, all of the lights, all the RGB lighting you can possibly stuff in there."
      },
      {
        "start": 180100,
        "stop": 181800,
        "text": " Liquid cooling just to the absolute maximum extreme. And that's only accessible to such a small amount of people. But in the Linux community, we also will celebrate the really low end and try to make that work and try to find these cool little budget machines that can get a crap ton of work done for you at a great price."
      },
      {
        "start": 181800,
        "stop": 183200,
        "text": " I love that it's the same Linux too. Because couldn't you just imagine on some of these lower end machines, other vendors are going to ship a more limited operating system, but we get the same full Linux."
      },
      {
        "start": 183200,
        "stop": 183300,
        "text": " That's a great point."
      },
      {
        "start": 183300,
        "stop": 184300,
        "text": " I think what I find really amazing and something that I guess I have lived this lifestyle for the last many years with my low end hardware that I somehow make productive."
      },
      {
        "start": 184300,
        "stop": 184500,
        "text": " We've got our low end expert Brent in the house."
      },
      {
        "start": 184500,
        "stop": 184600,
        "text": " Our low end correspondence."
      },
      {
        "start": 184600,
        "stop": 184800,
        "text": " Just checking in here."
      },
      {
        "start": 184800,
        "stop": 186400,
        "text": " What I have really loved and that was true since the beginning of my Linux journey was that you can throw Linux on some of this lower end hardware and it performs in a way that other operating systems, at least other popular operating systems just can't even match."
      },
      {
        "start": 186400,
        "stop": 187600,
        "text": " Can't even come close. If you are choosing something like, I don't know, Joe's XFCE favorite or lesser process intensive desktop environments."
      },
      {
        "start": 187600,
        "stop": 187900,
        "text": " CPU challenged machines."
      },
      {
        "start": 187900,
        "stop": 188700,
        "text": " Right? I think it's kind of amazing that you can run that on really what fits in the palm of your hand."
      },
      {
        "start": 188700,
        "stop": 189500,
        "text": " You know, that's I think one of Linux's major strengths is it can do that and it can be, you know, the top 100 supercomputers as well."
      },
      {
        "start": 189500,
        "stop": 190000,
        "text": " I agree. So the question becomes which distribution is the right?"
      },
      {
        "start": 190000,
        "stop": 190600,
        "text": " You got a lot of choice, but only one can be king."
      },
      {
        "start": 190600,
        "stop": 191100,
        "text": " Linode dot com slash unplugged. Go there to get one hundred dollars and sixty day credit on a new account."
      },
      {
        "start": 191100,
        "stop": 191300,
        "text": " And it's a great way to show your support for the show."
      },
      {
        "start": 191300,
        "stop": 191600,
        "text": " Linode is definitely the Linux geeks cloud."
      },
      {
        "start": 191600,
        "stop": 192700,
        "text": " They've got 11 data centers around the world and they've been hard at work at building something awesome for nearly 19 years because they saw the trajectory of Linux almost 20 years ago."
      },
      {
        "start": 192700,
        "stop": 193100,
        "text": " I can relate to that. And it's that passion that they've built this business on top of."
      },
      {
        "start": 193100,
        "stop": 194100,
        "text": " And if you like to build these systems up from the ground yourself or have the option to deploy one of their many one click stacks, Linode has excellent options for you."
      },
      {
        "start": 194100,
        "stop": 194500,
        "text": " And the thing I can say confidently is the performance is incredible."
      },
      {
        "start": 194500,
        "stop": 194900,
        "text": " I just wouldn't put all of our JB audience facing stuff on Linode if it wasn't the case."
      },
      {
        "start": 194900,
        "stop": 195900,
        "text": " But it's not just me saying that. Stablepoint listed Linode as the fastest growing cloud provider and the best fit for low latency based use cases."
      },
      {
        "start": 195900,
        "stop": 196400,
        "text": " Thanks to Linode's high performing NVMe storage. But you know this."
      },
      {
        "start": 196400,
        "stop": 197400,
        "text": " It's not just the storage that makes it low latency. It's the fact that they are their own ISP, that they've hyper optimized their data centers and they know how to build these things efficiently."
      },
      {
        "start": 197400,
        "stop": 198000,
        "text": " And they're always cramming in the latest and greatest hardware, just smoothly and elegantly upgrading your systems as you go."
      },
      {
        "start": 198000,
        "stop": 198500,
        "text": " And they have a bunch of great backend features. S3 compatible object storage is one of my absolute favorite."
      },
      {
        "start": 198500,
        "stop": 199200,
        "text": " Cloud firewalls, DDoS protection, VLAN support, Kubernetes support, including now the Ansible and Terraform 2."
      },
      {
        "start": 199200,
        "stop": 199600,
        "text": " I mean, Kubernetes is like the go to. But let's be real. Let's be real."
      },
      {
        "start": 199600,
        "stop": 200000,
        "text": " I know a ton of people out there using Ansible to manage their Linode systems."
      },
      {
        "start": 200000,
        "stop": 200200,
        "text": " I mean, maybe they're doing the whole stack. I don't know."
      },
      {
        "start": 200200,
        "stop": 200700,
        "text": " But I hear from the audience all the time they're deploying stuff on Linode using Ansible."
      },
      {
        "start": 200700,
        "stop": 201400,
        "text": " And it makes sense. Pricing is 30 to 50 percent cheaper than other major cloud providers out there that want to lock you into their esoteric hyperscaler platform."
      },
      {
        "start": 201400,
        "stop": 202000,
        "text": " They've got the best support in the business. Nobody can touch it because nobody's built their business model like Linode has."
      },
      {
        "start": 202000,
        "stop": 202500,
        "text": " So if you run into any trouble getting set up, Linode comes with amazing 24/7 customer support phone ticket."
      },
      {
        "start": 202500,
        "stop": 202800,
        "text": " They'll answer the phone and a human is going to help you."
      },
      {
        "start": 202800,
        "stop": 203100,
        "text": " Linode is dedicated to offering the best in virtualized cloud computing."
      },
      {
        "start": 203100,
        "stop": 203400,
        "text": " If it runs on Linux, it'll run on Linode."
      },
      {
        "start": 203400,
        "stop": 203900,
        "text": " So go try it today. Learn for yourself. Take advantage of that $100 offer and support the show."
      },
      {
        "start": 203900,
        "stop": 204600,
        "text": " You can do it all by going to linode.com/unplugged. That's linode.com/unplugged."
      },
      {
        "start": 204600,
        "stop": 205600,
        "text": " It's that time of year again. We've got ourselves a new Linux Mint LTS. 21, Vanessa."
      },
      {
        "start": 205600,
        "stop": 206100,
        "text": " And you know, with impeccable timing, we also got a relevant bit of feedback."
      },
      {
        "start": 206100,
        "stop": 206600,
        "text": " A boost from Tim Apple. 2,222 sets."
      },
      {
        "start": 206600,
        "stop": 207200,
        "text": " New Mint is out. It rarely gets love from any of the Linux podcasts."
      },
      {
        "start": 207200,
        "stop": 207700,
        "text": " It'd be great to get you guys to live with it for a week. Or maybe just make Wes do it."
      },
      {
        "start": 207700,
        "stop": 207900,
        "text": " That's my favorite part of the email. Or the boost."
      },
      {
        "start": 207900,
        "stop": 208200,
        "text": " Ouch! Dang it. I mean, I love you Tim Apple, but throwing me right under that bus."
      },
      {
        "start": 208200,
        "stop": 208600,
        "text": " Yeah, I think, you know, he wants to hear your thoughts."
      },
      {
        "start": 208600,
        "stop": 209100,
        "text": " So could Mint be on a minimum viable machine? Is it the right distribution for that?"
      },
      {
        "start": 209100,
        "stop": 209700,
        "text": " There's a lot of choices. And I think for the purposes of these types of machines that we're going to be talking about today,"
      },
      {
        "start": 209700,
        "stop": 210100,
        "text": " we should just stick with the cinnamon flavor. I don't, you know, because there's a lot of ways you can go,"
      },
      {
        "start": 210100,
        "stop": 210400,
        "text": " but let's just talk about Mint cinnamon. Are you boys okay with that? Agreed?"
      },
      {
        "start": 210400,
        "stop": 210500,
        "text": " Let's do it."
      },
      {
        "start": 210500,
        "stop": 211500,
        "text": " So Linux Mint 21 is notable because it's been re-based onto Ubuntu 2204, and it will be supported until 2027."
      },
      {
        "start": 211500,
        "stop": 211800,
        "text": " So if you invest now, you get some use out of it."
      },
      {
        "start": 211800,
        "stop": 212200,
        "text": " Yeah. And so this, I think, if you're a Mint user today, might be worth listening to as well."
      },
      {
        "start": 212200,
        "stop": 212700,
        "text": " But it also means if you're going to buy a machine, you want it to last a few years, which is one of the requirements we set."
      },
      {
        "start": 212700,
        "stop": 213300,
        "text": " This install will be good until 2027, which is about the lifetime we expect from some of these budget machines."
      },
      {
        "start": 213300,
        "stop": 214100,
        "text": " And so there is a lot of small improvements, but it's nothing super major to end users, but to the development team,"
      },
      {
        "start": 214100,
        "stop": 214800,
        "text": " I think some big stuff went into this. It is really the release where Muffin, which is the compositor and window manager for Cinnamon,"
      },
      {
        "start": 214800,
        "stop": 216000,
        "text": " saw a lot of work. Muffin was originally based on GNOME's Mutter 3.2 release, GNOME 3.2, which is like forever ago."
      },
      {
        "start": 216000,
        "stop": 216500,
        "text": " Yeah, it's been forked for like 11 years now. That's a long time to maintain something like that."
      },
      {
        "start": 216500,
        "stop": 217200,
        "text": " Yes. And they completely re-based it around the GNOME 3.36 code base now."
      },
      {
        "start": 217200,
        "stop": 218300,
        "text": " So Muffin has been totally re-juvenized and completely re-based, and as a result, I think you feel the performance throughout Mint,"
      },
      {
        "start": 218300,
        "stop": 219000,
        "text": " and there's a lot of nice little visual tweaks and improvements that are also taking advantage of that newer code base."
      },
      {
        "start": 219000,
        "stop": 219700,
        "text": " Linux Mint 21 also features improved Bluetooth handling. They replaced the Blueberry subsystem with Blue Man."
      },
      {
        "start": 219700,
        "stop": 220300,
        "text": " Their own Xapps have seen a lot of improvements throughout this. Printing and scanning have gotten improvements."
      },
      {
        "start": 220300,
        "stop": 220800,
        "text": " And then there's just some general artwork and theming improvements because of the advantages they got by updating Muffin."
      },
      {
        "start": 220800,
        "stop": 221800,
        "text": " So there's a lot in this one. And I decided to try to get an idea, try to get my head around how much horsepower does a fully up-to-date,"
      },
      {
        "start": 221800,
        "stop": 222600,
        "text": " lived in it for a little bit, Mint install actually take. And I went through a process of loading up on a couple of different systems"
      },
      {
        "start": 222600,
        "stop": 223100,
        "text": " and trying to get baseline ideas of how much resources I should expect."
      },
      {
        "start": 223100,
        "stop": 223600,
        "text": " I feel like this is kind of perfect timing too because you've been tweaking yourself a real nice GNOME setup, right?"
      },
      {
        "start": 223600,
        "stop": 223900,
        "text": " And kind of just on the other side of the fence now, checking out how Cinnamon's been doing."
      },
      {
        "start": 223900,
        "stop": 224300,
        "text": " Yeah, I've been really deep down the Nix OS as my desktop using GNOME."
      },
      {
        "start": 224300,
        "stop": 225200,
        "text": " And so this was a bit of a shift going from Nix OS to Mint. I mean, talk about two totally different approaches to Linux."
      },
      {
        "start": 225200,
        "stop": 225400,
        "text": " Right. Dramatically, right?"
      },
      {
        "start": 225400,
        "stop": 226300,
        "text": " Because Nix OS is essentially a rolling OS, totally super fresh. And you just mentioned how Mint went 12 years without really updating the backend compositor to their desktop, right?"
      },
      {
        "start": 226300,
        "stop": 227100,
        "text": " So it's a real different approach, but different strokes. There's some people who just really like the Ubuntu base and they want a really solid workstation that lasts for years."
      },
      {
        "start": 227100,
        "stop": 228000,
        "text": " And you see stuff like with their improvements to the thumbnail support, where they, because they've kind of been, you know, just incrementally improving, there's some areas like that where it can be really nice."
      },
      {
        "start": 228000,
        "stop": 229600,
        "text": " Yeah, it's polished. And it's interesting to me how you get this true sense of a classic Linux desktop. For those of us who remember, there are elements of the Cinnamon desktop that strike this balance between GNOME and Plasma."
      },
      {
        "start": 229600,
        "stop": 230100,
        "text": " And it brings in stuff that was in GNOME 2, which we used to call GNOME."
      },
      {
        "start": 230100,
        "stop": 231000,
        "text": " It has applets that you can just like right click and you can add a system monitor to the tray. You know, these things that are just sort of used to come built into GNOME 2."
      },
      {
        "start": 231000,
        "stop": 231500,
        "text": " But then like Plasma, it'll also let you download new ones and install them."
      },
      {
        "start": 231500,
        "stop": 232000,
        "text": " The UI is a little rough. It could be better. You know, it'd be nice to have click and drag and stuff like that, but it's fine."
      },
      {
        "start": 232000,
        "stop": 233200,
        "text": " It really has like the feel of classic Linux, like even the options, the ones that it makes like a drawer where you can you can stack more icons in your tray and old notes apps that are forked from apps I used to love back in the day."
      },
      {
        "start": 233200,
        "stop": 233500,
        "text": " I don't know. Maybe this is only going to make sense to certain people."
      },
      {
        "start": 233500,
        "stop": 234100,
        "text": " But if you're a kid of the 90s, it's like when you get an old car of the 90s, it was a car in transition."
      },
      {
        "start": 234100,
        "stop": 234800,
        "text": " Right. Maybe you've updated the stereo. So it's got like a newer stereo, but it's got the old components of a 90s dash."
      },
      {
        "start": 234800,
        "stop": 235500,
        "text": " But it's got some new modules in it that like can play MP3s that didn't even exist when the car was built. You know what I'm talking about?"
      },
      {
        "start": 235500,
        "stop": 235900,
        "text": " Yeah. That's what the Mint experience is to me. And it's not necessarily bad. It's kind of a nostalgic feeling."
      },
      {
        "start": 235900,
        "stop": 236400,
        "text": " There's a sort of comfort to it in that like I know how to operate that desktop already. You know, I'm familiar with the paradigm."
      },
      {
        "start": 236400,
        "stop": 236800,
        "text": " And to be honest with you, there's just things about it that are simpler in a lot of ways."
      },
      {
        "start": 236800,
        "stop": 238000,
        "text": " And with this last couple of versions of Mint, they've been doing a decent enough job of integrating flat hub and flat packs. Well, not flat hub, but flat packs into Mint."
      },
      {
        "start": 238000,
        "stop": 238500,
        "text": " And they are now with software flat hub and they feel pretty much right at home on the Mint desktop."
      },
      {
        "start": 238500,
        "stop": 239500,
        "text": " It's very much a fully loaded Linux. So I thought, oh, it's going to be too bloated for these low end PCs because it comes with like streaming TV app, the entire LibreOffice by default."
      },
      {
        "start": 239500,
        "stop": 240500,
        "text": " You know, those things that I just don't do anymore. But when I put it to the test and I'm talking to like loading it up, got it all up to date, got logged into my Firefox, you know, got my stuff the way I like it."
      },
      {
        "start": 240500,
        "stop": 240700,
        "text": " Like trying to do some work, get some stuff done."
      },
      {
        "start": 240700,
        "stop": 241600,
        "text": " Yeah. After about four hours of average use, now this is without Electron apps, 1.6 gigabytes of RAM being used. Just 1.6 gigs of RAM."
      },
      {
        "start": 241600,
        "stop": 241700,
        "text": " That's impressive."
      },
      {
        "start": 241700,
        "stop": 241800,
        "text": " Right."
      },
      {
        "start": 241800,
        "stop": 241900,
        "text": " Not bad at all."
      },
      {
        "start": 241900,
        "stop": 242600,
        "text": " My lowest end machine had two gigs of RAM and the average is four gigs or above at everything I looked at. A lot of them have eight gigs and 16 gigs."
      },
      {
        "start": 242600,
        "stop": 242900,
        "text": " So using one point six gigs of RAM, that's you're going to get by with that."
      },
      {
        "start": 242900,
        "stop": 243500,
        "text": " You're gonna be fine. 13 gigabytes of disk space used every machine I looked at had at least 16 gigs."
      },
      {
        "start": 243500,
        "stop": 243700,
        "text": " A lot of them had one hundred twenty eight or more. Right."
      },
      {
        "start": 243700,
        "stop": 243900,
        "text": " So six. I'm sorry."
      },
      {
        "start": 243900,
        "stop": 244300,
        "text": " So 13 gigabytes of disk space and that includes the kitchen sink."
      },
      {
        "start": 244300,
        "stop": 244500,
        "text": " It's pretty impressive."
      },
      {
        "start": 244500,
        "stop": 245000,
        "text": " And Cinnamon's performance, it holds up. It really holds up."
      },
      {
        "start": 245000,
        "stop": 245500,
        "text": " I actually think Mint may be one of the top contenders for a low end PC after doing my testing."
      },
      {
        "start": 245500,
        "stop": 245900,
        "text": " I didn't really know how it would turn out, but I was actually very impressed."
      },
      {
        "start": 245900,
        "stop": 246300,
        "text": " I think I'd like to compare it to other desktops like pop comes to mind."
      },
      {
        "start": 246300,
        "stop": 246500,
        "text": " I'd like to see how pop compares."
      },
      {
        "start": 246500,
        "stop": 247300,
        "text": " I did play around with a really minimal configured plasma desktop, but maybe it's just my usage."
      },
      {
        "start": 247300,
        "stop": 247900,
        "text": " I didn't get it that low on on RAM and disk. It ended up being more RAM and more disk with the plasma desktop version."
      },
      {
        "start": 247900,
        "stop": 248100,
        "text": " So I just I was curious."
      },
      {
        "start": 248100,
        "stop": 248400,
        "text": " I've kind of found Cinnamon decent when I'm just casually playing some steam games and stuff."
      },
      {
        "start": 248400,
        "stop": 249400,
        "text": " I feel like I end up fighting with it less than I do with some other sort of setups, you know, where it doesn't understand my full screen window or wants to steal focus back or just won't hide itself at the right time."
      },
      {
        "start": 249400,
        "stop": 250100,
        "text": " They've done a good job now, too, for years, but even more so now of integrating TimeShift, the snapshot management tool."
      },
      {
        "start": 250100,
        "stop": 250400,
        "text": " And they've taken it over now as the primary developers of TimeShift."
      },
      {
        "start": 250400,
        "stop": 250900,
        "text": " And because I like to be a jerk, I decided to install Mint with butter FS."
      },
      {
        "start": 250900,
        "stop": 251700,
        "text": " I did the manual partitioning option and then and then did the butter FS option just because they thought like, well, let's see what happens when I do this."
      },
      {
        "start": 251700,
        "stop": 252000,
        "text": " Actually, it didn't boot properly on my Dev one that I tested."
      },
      {
        "start": 252000,
        "stop": 252800,
        "text": " I don't know if that was why, but then if I if I use the dev one, you know, built in BIOS boot menu and manually selected the UEFI file, it would be fine."
      },
      {
        "start": 252800,
        "stop": 253000,
        "text": " Might have just been a dev one thing. Don't know."
      },
      {
        "start": 253000,
        "stop": 253900,
        "text": " So I decided, let's try it. And when I loaded up TimeShift, like you'd expect, but it was really good to see TimeShift goes, hey, you've got butter FS."
      },
      {
        "start": 253900,
        "stop": 254200,
        "text": " Would you like me to go with butter FS mode instead of our sync mode?"
      },
      {
        "start": 254200,
        "stop": 254600,
        "text": " And so it just starts working with butter FS snapshots right then and there."
      },
      {
        "start": 254600,
        "stop": 254700,
        "text": " Isn't that nice? It is."
      },
      {
        "start": 254700,
        "stop": 255400,
        "text": " And then they've built in this back end process monitor to let you know kind of like when things are happening in the back end, like a TimeShift backup."
      },
      {
        "start": 255400,
        "stop": 256000,
        "text": " So you get kind of like this really subtle notification thing, just hey, there's some back end stuff happening here."
      },
      {
        "start": 256000,
        "stop": 256200,
        "text": " She might be running a little slow."
      },
      {
        "start": 256200,
        "stop": 256800,
        "text": " Makes me feel kind of comfortable. I know I've had mint machines in the past deployed it like friends and families and that kind of thing."
      },
      {
        "start": 256800,
        "stop": 257300,
        "text": " And, you know, I don't need it to be super rock solid necessarily, but like just this extra layer of protection."
      },
      {
        "start": 257300,
        "stop": 257800,
        "text": " Peace of mind. Doesn't it feel like and you guys tell me if you disagree, but doesn't it feel like."
      },
      {
        "start": 257800,
        "stop": 258400,
        "text": " If your back's up against the wall and you've got to recommend a Linux distro to somebody who's on a little bit lower end hardware."
      },
      {
        "start": 258400,
        "stop": 258800,
        "text": " And you just want it to be one of those set it and forget it things because you can't help them later."
      },
      {
        "start": 258800,
        "stop": 259500,
        "text": " Mints feels like a pretty safe one to recommend. Like it feels like you'd give that to a person that maybe isn't super technical."
      },
      {
        "start": 259500,
        "stop": 260200,
        "text": " It seems like with some of the X apps with like having like a thought of like, hey, you should probably do some backups or have some tools for that."
      },
      {
        "start": 260200,
        "stop": 260700,
        "text": " Like they're thinking of a more day to day user than what I'm typically designing for or designing for myself."
      },
      {
        "start": 260700,
        "stop": 261400,
        "text": " But they've also managed to include some of the retro stuff that I as a long time hardcore Linux user love."
      },
      {
        "start": 261400,
        "stop": 261900,
        "text": " You know, like they've got like some of the stuff that made old Linux desktops the best, like screensavers."
      },
      {
        "start": 261900,
        "stop": 262000,
        "text": " You're talking about X size?"
      },
      {
        "start": 262000,
        "stop": 262600,
        "text": " Yeah, X size is in there. They've got X screensavers in there. They're not even for better for worse, right?"
      },
      {
        "start": 262600,
        "stop": 263200,
        "text": " They're not even dicking around with Wayland. Right. It's just it's it's just they're honest about what they are."
      },
      {
        "start": 263200,
        "stop": 264000,
        "text": " They are tried and true Linux and they've taken ideas that have worked in the past and they've kept them integrated into their desktop instead of getting rid of them."
      },
      {
        "start": 264000,
        "stop": 264600,
        "text": " And as a team, they've just opted to take on more and more work, more and more responsibility."
      },
      {
        "start": 264600,
        "stop": 265000,
        "text": " And a couple of years ago, I thought, well, this is only going to last for so long. They're going to burn out."
      },
      {
        "start": 265000,
        "stop": 265200,
        "text": " But here we two, three years later, they're still doing it."
      },
      {
        "start": 265200,
        "stop": 265700,
        "text": " It's like you almost had some there. It's like, you know, you kind of get out of like the Linux hipster scene a bit with Mint."
      },
      {
        "start": 265700,
        "stop": 266200,
        "text": " You know, they're not necessarily deploying the coolest thing or, you know, kind of going to shame you about not yet having switched to Pipewire."
      },
      {
        "start": 266200,
        "stop": 266500,
        "text": " But but you get you get a nice Linux experience still."
      },
      {
        "start": 266500,
        "stop": 267100,
        "text": " Yeah. You get a machine you turn on and it works. And tomorrow when you turn it on, it's going to work."
      },
      {
        "start": 267100,
        "stop": 267900,
        "text": " And if it doesn't, you got time shift. That's appealing. Right. It's kind of in a way they're going about a different way of solving what Nix is solving for me."
      },
      {
        "start": 267900,
        "stop": 268400,
        "text": " OK, well, you know, as you vary, you put on various hats and you nebulously think about what happens to a future studio."
      },
      {
        "start": 268400,
        "stop": 268600,
        "text": " What about Cinnamon in the studio?"
      },
      {
        "start": 268600,
        "stop": 269000,
        "text": " Yeah, I don't know. I don't know. I don't know."
      },
      {
        "start": 269000,
        "stop": 269100,
        "text": " What's your hesitation?"
      },
      {
        "start": 269100,
        "stop": 269800,
        "text": " I like Cinnamon. I just like modern Plasma and modern GNOME more, especially my current implementations."
      },
      {
        "start": 269800,
        "stop": 270300,
        "text": " My current implementation that I've set up, both my Plasma and my GNOME setups are so freaking great."
      },
      {
        "start": 270300,
        "stop": 270700,
        "text": " I've never been happier with desktop Linux ever."
      },
      {
        "start": 270700,
        "stop": 271300,
        "text": " It's so for me, it's not that it's not great. It's just that it's not really my style."
      },
      {
        "start": 271300,
        "stop": 271900,
        "text": " You seem to be having a little, you know, renaissance with the desktop Linux. Seems like you're kind of back in a mode of it."
      },
      {
        "start": 271900,
        "stop": 272300,
        "text": " I will spend a little time and tweak this and make it something I want to sit in."
      },
      {
        "start": 272300,
        "stop": 272500,
        "text": " Yeah, I'm tweaking again. I'm going through a tweaking phase."
      },
      {
        "start": 272500,
        "stop": 273300,
        "text": " And I love it because there's a real unquantifiable thing that I have struggled for years to describe on this show."
      },
      {
        "start": 273300,
        "stop": 274200,
        "text": " And I'm right in the middle of it right now. And it drives me crazy that as a professional communicator, I cannot communicate what this is."
      },
      {
        "start": 274200,
        "stop": 275000,
        "text": " But I've just this weekend because I was going through the mint stuff and I was testing different hardware and I wanted to compare Plasma, Cinnamon and GNOME."
      },
      {
        "start": 275000,
        "stop": 275600,
        "text": " So this weekend I deployed Nix OS with Plasma on the DevOne."
      },
      {
        "start": 275600,
        "stop": 276800,
        "text": " And it was good. But modern Linux, there's something that GNOME Shell is doing where it feels like it's all one OS."
      },
      {
        "start": 276800,
        "stop": 277500,
        "text": " And Plasma feels like a desktop window system on top of my Linux box."
      },
      {
        "start": 277500,
        "stop": 278000,
        "text": " Like I can feel like there's the Plasma layer and then there's the Linux layer, which is good."
      },
      {
        "start": 278000,
        "stop": 278300,
        "text": " In fact, I could even see why people prefer that in some cases, right?"
      },
      {
        "start": 278300,
        "stop": 278400,
        "text": " Yeah."
      },
      {
        "start": 278400,
        "stop": 279600,
        "text": " But when I'm using GNOME on modern Linux with the latest like system, latest kernel, latest Wayland, latest GNOME Stack, latest GTK, everything's totally like current."
      },
      {
        "start": 279600,
        "stop": 280100,
        "text": " It feels like one cohesive OS like Mac OS does or even FreeBSD does to a degree."
      },
      {
        "start": 280100,
        "stop": 280400,
        "text": " But of course, FreeBSD doesn't once you get into the window manager."
      },
      {
        "start": 280400,
        "stop": 281400,
        "text": " But it's all just one smooth, slick experience that it just feels like everything's communicating in a good way."
      },
      {
        "start": 281400,
        "stop": 281700,
        "text": " And I just can't describe it better than that. But do you kind of get what I'm saying?"
      },
      {
        "start": 281700,
        "stop": 282000,
        "text": " And so I just don't get that with anything but GNOME Shell right now."
      },
      {
        "start": 282000,
        "stop": 283100,
        "text": " No, that's fair. I mean, I think you have a particular sensitivity to some of the, you know, just how your desktop, the interactivity that you're presented with when you're sitting at your computer trying to get work done."
      },
      {
        "start": 283100,
        "stop": 283500,
        "text": " I wonder if that's, would you say the same in like in the studio environment or something else?"
      },
      {
        "start": 283500,
        "stop": 283700,
        "text": " Like, I think it doesn't matter as much there."
      },
      {
        "start": 283700,
        "stop": 284000,
        "text": " Yeah. I think maybe you're talking about like your primary workstation."
      },
      {
        "start": 284000,
        "stop": 284200,
        "text": " Yeah. Yeah."
      },
      {
        "start": 284200,
        "stop": 285200,
        "text": " So Cinnamon just didn't give me that feeling. And I don't know. I don't have a great way to describe it, but I just don't get that kind of connection like I do where it feels like and faster, like with GNOME Shell, it feels like I'm closer to the metal."
      },
      {
        "start": 285200,
        "stop": 285700,
        "text": " I don't know why. Maybe because everything is running in Wayland and it's just super smooth right now."
      },
      {
        "start": 285700,
        "stop": 286300,
        "text": " But that's just my thing. And it wouldn't stop me from using it on a on a budget machine."
      },
      {
        "start": 286300,
        "stop": 286600,
        "text": " I think I think Cinnamon would do great on there."
      },
      {
        "start": 286600,
        "stop": 286800,
        "text": " I'm curious. Brantley, I know you had a chance to kind of take a look at."
      },
      {
        "start": 286800,
        "stop": 287600,
        "text": " I think you had a few thoughts. What was your takeaway from the latest Mint and where you think it kind of fits in?"
      },
      {
        "start": 287600,
        "stop": 288200,
        "text": " Well, I have quite a bit of history with Mint, actually, that I thought would be related to this these topics."
      },
      {
        "start": 288200,
        "stop": 288700,
        "text": " And I I think that's important to mention just before I get to my experience, my current experience."
      },
      {
        "start": 288700,
        "stop": 290400,
        "text": " So you mentioned low end hardware. I put Linux Mint on a piece of machinery, I'll call it for a friend who had an old laptop that was a four by three screen and was a 32 bit."
      },
      {
        "start": 290400,
        "stop": 291000,
        "text": " A machine that. I couldn't buy a hard drive for to upgrade."
      },
      {
        "start": 291000,
        "stop": 291900,
        "text": " So this thing took an IDE hard drive that old, but my friend was still using it and loved the thing and said, hey, is there any way you can like it was running Windows."
      },
      {
        "start": 291900,
        "stop": 292800,
        "text": " I don't know which version, but it was extremely slow. So she said, hey, is there any way you can kind of throw that fancy Linux thing you use on here and make it maybe last another year or two?"
      },
      {
        "start": 292800,
        "stop": 293200,
        "text": " And the hard drive was starting to present some issues."
      },
      {
        "start": 293200,
        "stop": 294100,
        "text": " So I ended up somehow she was OK with this, but we strapped like duct taped literally an external hard drive to the lid of this thing."
      },
      {
        "start": 294100,
        "stop": 295100,
        "text": " But it was an SSD, right? OK, it was USB like probably one, but it still ran better than Windows was from the failing IDE hard drive that was in there."
      },
      {
        "start": 295100,
        "stop": 295800,
        "text": " This was probably Linux Mint. I think last time I updated on that machine is Linux Mint 19 at the time."
      },
      {
        "start": 295800,
        "stop": 296800,
        "text": " And it just ran forever and it ran great and she's not technical, but she just loved the thing so much that when she bought a new machines that she said, no, no, get rid of this Windows thing."
      },
      {
        "start": 296800,
        "stop": 297400,
        "text": " I want Linux Mint on there again. And I suggested other things. She's like, nope, I love that thing."
      },
      {
        "start": 297400,
        "stop": 298100,
        "text": " So there's there's something to that like stability and it doesn't change very often."
      },
      {
        "start": 298100,
        "stop": 298600,
        "text": " But when it does is just to like tweak a few little things to make them more stable even."
      },
      {
        "start": 298600,
        "stop": 299300,
        "text": " No. And so I think there's something really nice to that. And for years, I thought about the same time I ran Linux Mint on my ThinkPad X220."
      },
      {
        "start": 299300,
        "stop": 299800,
        "text": " And last episode, I recommended that as the low end piece of hardware that I thought was was worth looking at."
      },
      {
        "start": 299800,
        "stop": 300300,
        "text": " And back then it ran beautifully. I don't see why it wouldn't run just as beautifully now."
      },
      {
        "start": 300300,
        "stop": 300800,
        "text": " You have or have not ran Mint on that box? On the X220, I have ran Mint."
      },
      {
        "start": 300800,
        "stop": 301500,
        "text": " It was the second choice that I put on there. The first choice was XFCE, which I ran, I think for a year."
      },
      {
        "start": 301500,
        "stop": 302000,
        "text": " Oh, I let's call it an upgrade upgraded to Mint."
      },
      {
        "start": 302000,
        "stop": 302700,
        "text": " And I loved it for I think about two years. I just love that thing. It was a bit more problematic back then."
      },
      {
        "start": 302700,
        "stop": 303800,
        "text": " Wes, you and I were talking about how there used to be a I think it was a right click menu or something for Mint back then that would re-re-initialize Cinnamon."
      },
      {
        "start": 303800,
        "stop": 304200,
        "text": " Oh, sure. Right. You could just restart that. Restart that real quick."
      },
      {
        "start": 304200,
        "stop": 304500,
        "text": " Cinnamon was let's call it fresh back then."
      },
      {
        "start": 304500,
        "stop": 305100,
        "text": " Good news. Good news, gentlemen. You can actually still find that applet. If you go add applets, you can still find it and add it back."
      },
      {
        "start": 305100,
        "stop": 305400,
        "text": " It just isn't default. Yeah, it's still there."
      },
      {
        "start": 305400,
        "stop": 305900,
        "text": " I like that as like a nervous take. You know, you type LS in the terminal and you just hit refresh."
      },
      {
        "start": 305900,
        "stop": 306600,
        "text": " Well, you know, now in the Wayland world, looking back and thinking, wow, I could just restart the desktop and all my applications aren't affected and my whole desktop remains."
      },
      {
        "start": 306600,
        "stop": 307300,
        "text": " That's actually a pretty nice feature. This X thing is neat. It's got some cool stuff in it."
      },
      {
        "start": 307300,
        "stop": 308000,
        "text": " So I would say that's like my background with Linux Mint, sort of a love relationship that's slowly faded."
      },
      {
        "start": 308000,
        "stop": 308600,
        "text": " And then I moved on to other other things. So it wasn't Mint. It was you. And you just had outgrown it."
      },
      {
        "start": 308600,
        "stop": 309500,
        "text": " It's not you. It's me. Yeah. And I don't mean to make it sound like, you know, if you're using Mint, you're not a pro user, because I think the point the point we're trying to hit here is it's it's it's apps."
      },
      {
        "start": 309500,
        "stop": 310000,
        "text": " Absolutely. A totally usable workstation. And it probably scales very well on high end hardware as well. I would imagine."
      },
      {
        "start": 310000,
        "stop": 310700,
        "text": " And what's really impressive about Mint for me is two things that come to mind right away is one, the users that use it really love it."
      },
      {
        "start": 310700,
        "stop": 311200,
        "text": " And you see that in forums, you see that on Reddit, you see that all over the place. Some people really love it."
      },
      {
        "start": 311200,
        "stop": 312200,
        "text": " And I can see why. And I used to be one. The other thing I notice is that the Linux Mint project gets a lot of donations, like a surprising amount of donations."
      },
      {
        "start": 312200,
        "stop": 312900,
        "text": " If you if you browse to their website, they they kindly list them all, I think on a monthly monthly sort of routine."
      },
      {
        "start": 312900,
        "stop": 313800,
        "text": " And it's very impressive how many donations they get on a monthly basis. And I think that's a testament to how much they matter for some people."
      },
      {
        "start": 313800,
        "stop": 314800,
        "text": " I like this woodcarver over in our matrix room. Linux Mint is super boring. That's why it's been my daily driver for the last five years."
      },
      {
        "start": 314800,
        "stop": 315100,
        "text": " Absolutely rock solid. See what I mean?"
      },
      {
        "start": 315100,
        "stop": 315500,
        "text": " Yeah. I don't know, Alex, have you looked at it before? Have you tried Linux Mint before?"
      },
      {
        "start": 315500,
        "stop": 316600,
        "text": " Yeah, I did. It's been a long time. And I think I agree generally with your assessments here that Linux Mint really is the appliance of desktop Linux."
      },
      {
        "start": 316600,
        "stop": 317300,
        "text": " You can just set it up and forget it and just expect it to continue working for a long time."
      },
      {
        "start": 317300,
        "stop": 317600,
        "text": " And that's really an accolade in this day and age."
      },
      {
        "start": 317600,
        "stop": 318300,
        "text": " I think one of the reasons I like recommending it to for a budget Linux machine is not just because it's only for low end hardware,"
      },
      {
        "start": 318300,
        "stop": 318800,
        "text": " but because you can recommend it to somebody and it's a full fledged Ubuntu based Linux."
      },
      {
        "start": 318800,
        "stop": 319400,
        "text": " It is not a watered down, like tiny distro that has some esoteric, crazy little tiny desktop."
      },
      {
        "start": 319400,
        "stop": 319900,
        "text": " It is like a proven track record team behind this desktop environment who has been producing."
      },
      {
        "start": 319900,
        "stop": 320400,
        "text": " And like Brent touched on, clearly as a community that is supporting it, that sees a lot of value."
      },
      {
        "start": 320400,
        "stop": 320900,
        "text": " And so they're contributing value back to the Mint project and it seems to be working for them."
      },
      {
        "start": 320900,
        "stop": 321400,
        "text": " OK, maybe this is an awkward question, but where does Ubuntu Mate or something like that fit into this picture?"
      },
      {
        "start": 321400,
        "stop": 321700,
        "text": " Right, right. Mate, I think, is the other question."
      },
      {
        "start": 321700,
        "stop": 322300,
        "text": " I also could see the argument for an XFCE desktop if it's maybe set up kind of more like in a Windows style."
      },
      {
        "start": 322300,
        "stop": 322600,
        "text": " I don't know. That's a good question."
      },
      {
        "start": 322600,
        "stop": 322900,
        "text": " I think they both fill a very similar space, don't they?"
      },
      {
        "start": 322900,
        "stop": 323700,
        "text": " And much like the old Steve Jobs adage, one doesn't have to lose for the other one to win."
      },
      {
        "start": 323700,
        "stop": 324200,
        "text": " You know, they can both coexist. They feel different niches maybe, but I agree."
      },
      {
        "start": 324200,
        "stop": 324800,
        "text": " Chris, you asked about my experience with modern Mint, and I think it's much like yours."
      },
      {
        "start": 324800,
        "stop": 325600,
        "text": " Comparing to the Mint of, you know, yesteryear that I was used to, I just thought it looked super familiar."
      },
      {
        "start": 325600,
        "stop": 326100,
        "text": " I jumped in there and I felt right at home in a nostalgic kind of way."
      },
      {
        "start": 326100,
        "stop": 326600,
        "text": " And it was really easy to understand where everything still was because it hadn't really changed."
      },
      {
        "start": 326600,
        "stop": 327400,
        "text": " I mean, there were some neat options that you mentioned with styling that was presented in the welcome screen that I really appreciated."
      },
      {
        "start": 327400,
        "stop": 328200,
        "text": " Like, highlight color that you could choose, like little things that I think are nice touches but not too involved."
      },
      {
        "start": 328200,
        "stop": 328600,
        "text": " You know, you don't have to get in there and really know what you're doing."
      },
      {
        "start": 328600,
        "stop": 329200,
        "text": " So that felt like a really nice experience, and I thought it just felt super polished. I was really impressed."
      },
      {
        "start": 329200,
        "stop": 329600,
        "text": " See, that's saying something. I'm curious because, I mean, you're our head of QA."
      },
      {
        "start": 329600,
        "stop": 329900,
        "text": " I mean, have you managed to break it in any odd ways yet?"
      },
      {
        "start": 329900,
        "stop": 330700,
        "text": " I did try to install encryption through the installer because I feel like I've caught a few distributions."
      },
      {
        "start": 330700,
        "stop": 331400,
        "text": " Not maybe test that enough, shall we say. That presents some weird edge cases."
      },
      {
        "start": 331400,
        "stop": 332200,
        "text": " But I haven't found any bugs yet. And I will try a little harder, but I thought that was something."
      },
      {
        "start": 332200,
        "stop": 332500,
        "text": " You didn't find any bugs. I don't believe it."
      },
      {
        "start": 332500,
        "stop": 332600,
        "text": " I can't either."
      },
      {
        "start": 332600,
        "stop": 332900,
        "text": " I was out late drinking last night, so there's that."
      },
      {
        "start": 332900,
        "stop": 333000,
        "text": " Could be. Could be that."
      },
      {
        "start": 333000,
        "stop": 333700,
        "text": " But, yeah, I thought it was really polished, and I was really impressed, and I was surprised that that was my take."
      },
      {
        "start": 333700,
        "stop": 333800,
        "text": " So there you go."
      },
      {
        "start": 334000,
        "stop": 334700,
        "text": " bitwarden.com/linux. Go there to get started with a free trial for yourself, a team, or an enterprise."
      },
      {
        "start": 334700,
        "stop": 334900,
        "text": " That's bitwarden.com/linux."
      },
      {
        "start": 334900,
        "stop": 335700,
        "text": " Bitwarden, quite simply, is the easiest and the best way for you or a business to store, share, and sync your sensitive data."
      },
      {
        "start": 335700,
        "stop": 336100,
        "text": " And Bitwarden is fully customizable. You can use it with your enterprise policies. You can install it on your machine."
      },
      {
        "start": 336100,
        "stop": 336500,
        "text": " They've got a flat pack available. It's, of course, available for mobile operating systems."
      },
      {
        "start": 336500,
        "stop": 337400,
        "text": " And the beauty is Bitwarden is open source, so you can trust it, and it is already trusted by millions of individuals and teams and organizations in their community."
      },
      {
        "start": 337400,
        "stop": 337700,
        "text": " It's what Wes and I use to manage our passwords."
      },
      {
        "start": 337700,
        "stop": 338400,
        "text": " It's how we also manage our two-factor codes and other sensitive data, like recovery keys for certain applications and whatnot."
      },
      {
        "start": 338400,
        "stop": 339000,
        "text": " It's awesome if you're a matrix user and you want to get a recovery key in there. Just save it right in there with your login information."
      },
      {
        "start": 339000,
        "stop": 339500,
        "text": " And Bitwarden has slick account switching supports. You can jump between a work account."
      },
      {
        "start": 339500,
        "stop": 339800,
        "text": " You can jump between your personal account or maybe the free software project you're working on."
      },
      {
        "start": 339800,
        "stop": 340300,
        "text": " And things over Bitwarden are always improving. In fact, rolling out this week is SCIM support."
      },
      {
        "start": 340300,
        "stop": 340900,
        "text": " Yeah, that's, I call it SCIM. Maybe it's pronounced S-C-I-M, but you enterprise folks, you know what a big deal this is."
      },
      {
        "start": 340900,
        "stop": 341500,
        "text": " And it's becoming available this week for Bitwarden to make it easier than ever to provision and manage users."
      },
      {
        "start": 341500,
        "stop": 341900,
        "text": " Bitwarden just made your life so much simpler in the enterprise."
      },
      {
        "start": 341900,
        "stop": 342400,
        "text": " And for all of us out there, that new username generator continues to be a real winner."
      },
      {
        "start": 342400,
        "stop": 342900,
        "text": " Why not have a unique username and a unique password for every site and service that you sign up for?"
      },
      {
        "start": 342900,
        "stop": 343400,
        "text": " Maybe you already know about how important it is to have a great password manager."
      },
      {
        "start": 343400,
        "stop": 344000,
        "text": " But does everyone in your family, to your friends, is your business, your place of work, are they covered here?"
      },
      {
        "start": 344000,
        "stop": 344700,
        "text": " Are they using the right tool for the job? Maybe this is an opportunity to try it out for yourself or your business and support the show."
      },
      {
        "start": 344700,
        "stop": 345100,
        "text": " You can do all of that by going to bitwarden.com/linux."
      },
      {
        "start": 345100,
        "stop": 345500,
        "text": " Go check out the brand new features rolling out to Bitwarden this week."
      },
      {
        "start": 345500,
        "stop": 345800,
        "text": " Bitwarden.com/linux."
      },
      {
        "start": 345800,
        "stop": 346600,
        "text": " As always, we got some amazing boosts and feedback into our email. Thank you everyone for that."
      },
      {
        "start": 346600,
        "stop": 347100,
        "text": " Chris and I did touch on, I think, what was a little bit of a delicate topic."
      },
      {
        "start": 347100,
        "stop": 347900,
        "text": " So if you feel maybe a little rubbed the wrong way by the boosts, well, we hate crypto too it turns out."
      },
      {
        "start": 347900,
        "stop": 348200,
        "text": " And we discussed that a little bit more in Office Hours 9."
      },
      {
        "start": 348200,
        "stop": 348600,
        "text": " And we just want you to know that you're still with us."
      },
      {
        "start": 348600,
        "stop": 349300,
        "text": " We hear you. Yeah. And we have a rationale. And we explain it. Office hours.hair/9."
      },
      {
        "start": 349300,
        "stop": 349900,
        "text": " Well hey, speaking of boosts, noob Steve boosted in with 2,222 sets."
      },
      {
        "start": 349900,
        "stop": 350300,
        "text": " I'm a duck. D-U-K, duck. Loaded with talent."
      },
      {
        "start": 350300,
        "stop": 350700,
        "text": " Couldn't boost Coder without boosting LUP. Aww, thanks noob Steve."
      },
      {
        "start": 350700,
        "stop": 351100,
        "text": " Wish I could get to one of those meetups, but #GasForBrent."
      },
      {
        "start": 351100,
        "stop": 351400,
        "text": " Gas for Brent. That is great Steve."
      },
      {
        "start": 351400,
        "stop": 352300,
        "text": " And I'm happy to report we're starting to actually get some details down in terms of dates on when Brent's gonna make it here before the road trip and all that kind of stuff."
      },
      {
        "start": 352300,
        "stop": 353000,
        "text": " So it is happening. And your boosts are gonna put gas in that tank. So we really, really appreciate that."
      },
      {
        "start": 353000,
        "stop": 353200,
        "text": " You can't have him. He's mine."
      },
      {
        "start": 353200,
        "stop": 353400,
        "text": " Yeah, and are you gonna keep him forever? I understand."
      },
      {
        "start": 353400,
        "stop": 353600,
        "text": " Ah, that's why you got that brand."
      },
      {
        "start": 353600,
        "stop": 354000,
        "text": " We're gonna have to mount a Brent rescue operation, Wes."
      },
      {
        "start": 354000,
        "stop": 354500,
        "text": " We'll break into the middle of the night. \"Come on Brent, you're coming with us!\""
      },
      {
        "start": 354500,
        "stop": 354700,
        "text": " And coordinate it all on Matrix."
      },
      {
        "start": 354700,
        "stop": 355000,
        "text": " Right, right, right. There you go."
      },
      {
        "start": 355000,
        "stop": 355500,
        "text": " Oh, oh gosh. It's a double duck day from Parrish Potato."
      },
      {
        "start": 355500,
        "stop": 355900,
        "text": " But honest and truly, I am Robin Hood."
      },
      {
        "start": 355900,
        "stop": 356800,
        "text": " Honestly, if you find a used laptop with at least 8 gigs of RAM, you'd be able to do a decent amount of quote \"regular computer stuff.\""
      },
      {
        "start": 356800,
        "stop": 357400,
        "text": " I've been playing Skyrim on a laptop I bought for $200 at work, between calls, and it works just fine."
      },
      {
        "start": 357400,
        "stop": 357900,
        "text": " Hey, that's great. I mean Skyrim's not the most modern game, but if that's the one you want to play, that's all that matters."
      },
      {
        "start": 357900,
        "stop": 358000,
        "text": " Exactly."
      },
      {
        "start": 358000,
        "stop": 358500,
        "text": " The Golden Dragon boosts in with 1024 says."
      },
      {
        "start": 358500,
        "stop": 358700,
        "text": " B-O-O-S-T!"
      },
      {
        "start": 358700,
        "stop": 358900,
        "text": " Coming hot with the boost!"
      },
      {
        "start": 358900,
        "stop": 359100,
        "text": " Coming in hot with the boost!"
      },
      {
        "start": 359100,
        "stop": 359900,
        "text": " Back in the day, when Wi-Fi didn't work, I used Kibuntu and had to go right back to Windows. Ouch, yeah."
      },
      {
        "start": 359900,
        "stop": 360300,
        "text": " Then I tried again here in the last three years, and it's been a dream."
      },
      {
        "start": 360300,
        "stop": 361100,
        "text": " Sometimes Linux is hard to love, but that tough love forces you to learn new skills, and you appreciate computing that much more."
      },
      {
        "start": 361100,
        "stop": 361400,
        "text": " You do learn more. There is something to that, and..."
      },
      {
        "start": 361400,
        "stop": 361900,
        "text": " Sometimes it's an angry learning. You're like, \"This is not what I want it to be learning right now,\" but you still learn."
      },
      {
        "start": 361900,
        "stop": 362300,
        "text": " You know, here's my thought. You want to know what I think? Here's what I think, Wes. You want to know what I think? Here's what I think."
      },
      {
        "start": 362300,
        "stop": 362500,
        "text": " I think I'm going to find out either way."
      },
      {
        "start": 362500,
        "stop": 363000,
        "text": " Alright, Wes. I'll tell you what I think. I think it's not necessarily a bad thing that it's the hard way to learn."
      },
      {
        "start": 363000,
        "stop": 363400,
        "text": " I think you need that. You know? It's good to have that option. There's easy ways to."
      },
      {
        "start": 363400,
        "stop": 363600,
        "text": " You can't always take the easy path."
      },
      {
        "start": 363600,
        "stop": 363700,
        "text": " That's right. It's good."
      },
      {
        "start": 363700,
        "stop": 364300,
        "text": " McMack boosts in with, oh, oh hey, double 1024. It's 2048, sats."
      },
      {
        "start": 364300,
        "stop": 364800,
        "text": " Would love to get your guys' take on Manage IQ. That's manageiq.org."
      },
      {
        "start": 364800,
        "stop": 365600,
        "text": " As I'm looking for an open source single management pane for my local compute management, as well as my cloud formation templates for both my home lab,"
      },
      {
        "start": 365600,
        "stop": 366200,
        "text": " which is micro-k8s on a three-node Raspberry Pi 4 cluster, and then he blames you for that, Chris."
      },
      {
        "start": 366200,
        "stop": 366800,
        "text": " I am aware of Terraform, however, I've been hesitant to jump into that world."
      },
      {
        "start": 366800,
        "stop": 367100,
        "text": " Thoughts? Suggestions? Thanks for all the content."
      },
      {
        "start": 367100,
        "stop": 367900,
        "text": " So it's manageiq.org for this site, and this, okay, so this does have one kind of thing that appeals to me right off the bat,"
      },
      {
        "start": 367900,
        "stop": 368800,
        "text": " and that is you kind of use one tool and you're spinning images for your box at home, you're spinning Docker containers, you're spinning public cloud images."
      },
      {
        "start": 368800,
        "stop": 369300,
        "text": " I see a lot of different platforms on here, VMware, Ansible Tower, Foreman, of course, Kubernetes."
      },
      {
        "start": 369300,
        "stop": 369400,
        "text": " Yeah, yeah."
      },
      {
        "start": 369400,
        "stop": 369700,
        "text": " I've never tried this, though. I wonder if our dear Mr. Alex has those."
      },
      {
        "start": 369700,
        "stop": 370000,
        "text": " Yeah, I thought that was my first thought, too, is I wonder what Alex thinks of this."
      },
      {
        "start": 370000,
        "stop": 371500,
        "text": " So ManageIQ is the upstream version of a Red Hat project called CloudForms, and I was sent on a training course to learn CloudForms as a consultant four or five years ago now."
      },
      {
        "start": 371500,
        "stop": 372600,
        "text": " And I spent the entire week with my head in my hands. I know who pays my wages, and I should probably choose my words carefully, but I think it's terrible."
      },
      {
        "start": 372600,
        "stop": 373600,
        "text": " I hate it, because for me, I like infrastructure as code, and CloudForms was everything the other direction."
      },
      {
        "start": 373600,
        "stop": 373900,
        "text": " Everything in the interface was click, click, click."
      },
      {
        "start": 373900,
        "stop": 374700,
        "text": " You know, if you like GUIs, ManageIQ is for you, but for me, it's just not the right tool for the job."
      },
      {
        "start": 374700,
        "stop": 375200,
        "text": " And you mentioned Terraform in your question, and I just think you've got the answer there already."
      },
      {
        "start": 375200,
        "stop": 376100,
        "text": " Like, the infrastructure as code tooling is there, it's mature. If you combine it with some of the continuous integration tools that are now available as well,"
      },
      {
        "start": 376100,
        "stop": 377100,
        "text": " you can do a lot of the clever stuff that ManageIQ purports to be able to do yourself and not be tied into a specific development cycle of a product."
      },
      {
        "start": 377100,
        "stop": 377900,
        "text": " That is great insight, Alex. You know, I have to channel the Nix nerds matrix room right now just for a moment, and..."
      },
      {
        "start": 377900,
        "stop": 378000,
        "text": " I didn't see that coming at all."
      },
      {
        "start": 378000,
        "stop": 378600,
        "text": " They would say, \"Check out Nix OS generators. One config, multiple output formats.\""
      },
      {
        "start": 378600,
        "stop": 379100,
        "text": " Boys, I installed this last night. It is so frickin' cool."
      },
      {
        "start": 379100,
        "stop": 379600,
        "text": " So you install it super easy on Nix, and then you have this Nix OS generator command,"
      },
      {
        "start": 379600,
        "stop": 380100,
        "text": " and then you tell it what image, based on your config, on that local box that you want."
      },
      {
        "start": 380100,
        "stop": 380400,
        "text": " You want an Amazon EC2 image? All right, tell it that."
      },
      {
        "start": 380400,
        "stop": 380800,
        "text": " You want a Docker image? Okay. Hyper-V? Sure, no problem."
      },
      {
        "start": 380800,
        "stop": 381300,
        "text": " You want just a regular ISO image? You can have that too. Kexec? Yep, it's got Kexec."
      },
      {
        "start": 381300,
        "stop": 381600,
        "text": " It'll output all of that different stuff and more."
      },
      {
        "start": 381600,
        "stop": 382200,
        "text": " Proxmox, OpenStack, just a raw file, VMware file, VirtualBox file, Vagrant file."
      },
      {
        "start": 382200,
        "stop": 382900,
        "text": " I mean, it does everything, and what's so cool about it, you just go about setting up your config like you would anyways,"
      },
      {
        "start": 382900,
        "stop": 383300,
        "text": " and once you get the box just the way you like it, you run this, it outputs your image,"
      },
      {
        "start": 383300,
        "stop": 383700,
        "text": " and you can tell it for which public cloud you want or what format you want, and it's done."
      },
      {
        "start": 383700,
        "stop": 383800,
        "text": " It's easy."
      },
      {
        "start": 383800,
        "stop": 384100,
        "text": " You sneaky over there and generated a whole bunch of images, my dog."
      },
      {
        "start": 384100,
        "stop": 384500,
        "text": " Well, I was trying to come up with a way to test, and I thought, I really like this base,"
      },
      {
        "start": 384500,
        "stop": 384900,
        "text": " and then I can add Gnome or I can add Plasma, and so that's just what I did,"
      },
      {
        "start": 384900,
        "stop": 385400,
        "text": " is I created a small little base that I could then just add the different desktop environment on to do my testing,"
      },
      {
        "start": 385400,
        "stop": 385600,
        "text": " so it was kind of as close to the same machine as possible."
      },
      {
        "start": 385600,
        "stop": 386000,
        "text": " Plus, you could generate your own nice little sort of like live Nix environment,"
      },
      {
        "start": 386000,
        "stop": 386400,
        "text": " but with your setup there, you know, just keep it on your little vent toy."
      },
      {
        "start": 386400,
        "stop": 386700,
        "text": " I hadn't even thought of that, or a VM image even where I could--"
      },
      {
        "start": 386700,
        "stop": 386800,
        "text": " Sure."
      },
      {
        "start": 386800,
        "stop": 387000,
        "text": " Oh, that's so cool, Wes. Great idea."
      },
      {
        "start": 387000,
        "stop": 387500,
        "text": " You know, if you stay tuned till next week, Chris is going to reveal that he's got his own Nix-based distribution"
      },
      {
        "start": 387500,
        "stop": 387800,
        "text": " that you can download in any format you'd like."
      },
      {
        "start": 387800,
        "stop": 388000,
        "text": " No, no, no, no, it's going to be Jupyter OS."
      },
      {
        "start": 388000,
        "stop": 388300,
        "text": " We're going to come full circle from the start of the network."
      },
      {
        "start": 388300,
        "stop": 389100,
        "text": " We actually started, the podcast network originally was actually a Linux-based OS initiative called Jupyter."
      },
      {
        "start": 389100,
        "stop": 389200,
        "text": " I did not know this."
      },
      {
        "start": 389200,
        "stop": 389600,
        "text": " And it was, you know, don't call it a distro. It was a Linux operating system."
      },
      {
        "start": 389600,
        "stop": 390000,
        "text": " We were very-- Brian and I were really very insistent about that."
      },
      {
        "start": 390000,
        "stop": 390300,
        "text": " Can you just like cat/dev/Linux action show?"
      },
      {
        "start": 390300,
        "stop": 390500,
        "text": " Yeah, well, no, not yet, but we would have built that in."
      },
      {
        "start": 390500,
        "stop": 391000,
        "text": " I mean, come on, we would have definitely had our show automatically subscribed on the desktop, let's be honest."
      },
      {
        "start": 391000,
        "stop": 391700,
        "text": " Well, that's what happened is we started podcasting, and we realized, man, we're way better at podcasting than we are building a desktop."
      },
      {
        "start": 391700,
        "stop": 392400,
        "text": " And so we stopped, and thankfully the elementary OS guys continued on, and so you got Jupyter OS and all that kind of stuff,"
      },
      {
        "start": 392400,
        "stop": 392600,
        "text": " which was inspired from some of that work that we did early on."
      },
      {
        "start": 392600,
        "stop": 392900,
        "text": " I'm just inspired, I'm not saying-- just inspired."
      },
      {
        "start": 392900,
        "stop": 393100,
        "text": " And yeah, we did the podcast thing, so it all worked out."
      },
      {
        "start": 393100,
        "stop": 393400,
        "text": " So it would be full circle now for me to start publishing my own OS."
      },
      {
        "start": 393400,
        "stop": 393600,
        "text": " That would be kind of perfect."
      },
      {
        "start": 393600,
        "stop": 393900,
        "text": " You just need to do JB coin next, and then you're all set."
      },
      {
        "start": 393900,
        "stop": 394100,
        "text": " Oh, shush."
      },
      {
        "start": 394100,
        "stop": 394300,
        "text": " How else are you going to donate to get your ISOs?"
      },
      {
        "start": 394300,
        "stop": 394700,
        "text": " Well, you know I'm a big crypto guy. I love crypto, so yeah."
      },
      {
        "start": 394700,
        "stop": 394900,
        "text": " Just want to call you Crypto Chris?"
      },
      {
        "start": 394900,
        "stop": 395500,
        "text": " Again, Office Hours 9, we addressed this quite in depth, I think."
      },
      {
        "start": 395500,
        "stop": 395900,
        "text": " Gene Bean boosted in again. 1,000 sats."
      },
      {
        "start": 395900,
        "stop": 396400,
        "text": " Package formats matter because it's a pain in the butt to deal with all the variety,"
      },
      {
        "start": 396400,
        "stop": 396700,
        "text": " because you can't just pick one or two, even when using GUIs."
      },
      {
        "start": 396700,
        "stop": 396900,
        "text": " I think Pop has an example."
      },
      {
        "start": 396900,
        "stop": 397400,
        "text": " You can't install snaps or things from Homebrew via the package pop shop."
      },
      {
        "start": 397400,
        "stop": 397900,
        "text": " Yet I want stuff from both so that everything is installed from somewhere that checks for updates."
      },
      {
        "start": 397900,
        "stop": 398400,
        "text": " Sadly, Homebrew requires manual updating unless you drop to Cron."
      },
      {
        "start": 398400,
        "stop": 398800,
        "text": " So this is in response to a topic I kind of just lamented last week,"
      },
      {
        "start": 398800,
        "stop": 399700,
        "text": " which was why are package management and tooling and applications still such a big deal?"
      },
      {
        "start": 399700,
        "stop": 400000,
        "text": " I mean, I realize stuff never dies in the Linux community. We still debate systemd as well."
      },
      {
        "start": 400000,
        "stop": 400900,
        "text": " But today, as we record, the number one post on R/Linux with 725 upvotes, 282 comments, is"
      },
      {
        "start": 400900,
        "stop": 401200,
        "text": " \"canonical should ditch snap, embrace flatpak, and improve apt.\""
      },
      {
        "start": 401200,
        "stop": 401500,
        "text": " And then, of course, you can probably imagine how that discussion devolves."
      },
      {
        "start": 401500,
        "stop": 401600,
        "text": " Nuanced?"
      },
      {
        "start": 401600,
        "stop": 402100,
        "text": " It is. Yeah, nuanced and informed, yes. You nailed it, Wes."
      },
      {
        "start": 402100,
        "stop": 402400,
        "text": " Good job."
      },
      {
        "start": 402400,
        "stop": 402700,
        "text": " It's so annoying! Like, why won't it die?"
      },
      {
        "start": 402700,
        "stop": 403200,
        "text": " It's funny, too, because at meetups, just hanging out with people I know that use Linux,"
      },
      {
        "start": 403200,
        "stop": 403400,
        "text": " it does not organically come up hardly at all."
      },
      {
        "start": 403400,
        "stop": 403700,
        "text": " No, you don't fight over packaging. It's totally an internet fight thing."
      },
      {
        "start": 403700,
        "stop": 404300,
        "text": " But Gene Bean is right in the sense that I think it does come up because it clearly is something that matters to people."
      },
      {
        "start": 404300,
        "stop": 404600,
        "text": " Gene Bean also wrote in, for a double boost,"
      },
      {
        "start": 404600,
        "stop": 405000,
        "text": " 7,000 sats."
      },
      {
        "start": 405000,
        "stop": 405400,
        "text": " Oh, I combined it because he had a double send in there."
      },
      {
        "start": 405400,
        "stop": 405600,
        "text": " But that's a great--that's near ball or boost."
      },
      {
        "start": 405600,
        "stop": 405900,
        "text": " That's close. Not quite, though, right?"
      },
      {
        "start": 405900,
        "stop": 406000,
        "text": " Close."
      },
      {
        "start": 406000,
        "stop": 406200,
        "text": " They write, again,"
      },
      {
        "start": 406200,
        "stop": 406900,
        "text": " \"The XPS change you talked about sounds like how Lenovo does things where you can order many laptops with Ubuntu pre-installed."
      },
      {
        "start": 406900,
        "stop": 407500,
        "text": " Dell also offers multiple-latitude laptops with Ubuntu pre-installed, at least if you go through a rep."
      },
      {
        "start": 407500,
        "stop": 408300,
        "text": " I've just taken advantage of this at work for some special-use laptops with built-in Intel broadband modems that work out of the box."
      },
      {
        "start": 408300,
        "stop": 408600,
        "text": " Buying with compatibility is different in Linux."
      },
      {
        "start": 408600,
        "stop": 409100,
        "text": " You can't read a box or Amazon description to know if it works with Distro X."
      },
      {
        "start": 409100,
        "stop": 409500,
        "text": " You can know that for a Mac or Windows system.\""
      },
      {
        "start": 409500,
        "stop": 409900,
        "text": " That's a fair point. You do have a little bit easier time there. I can't argue that."
      },
      {
        "start": 409900,
        "stop": 410300,
        "text": " I do have good news, though, just looking at the dell.com/linux page,"
      },
      {
        "start": 410300,
        "stop": 410600,
        "text": " it does look like they've added the new XPS."
      },
      {
        "start": 410600,
        "stop": 411100,
        "text": " At least I think--it's hard to tell with the XPS these days because I think they make both models available at the same time,"
      },
      {
        "start": 411100,
        "stop": 411600,
        "text": " the previous one and the current one, but they have one labeled the new XPS 13+,"
      },
      {
        "start": 411600,
        "stop": 411900,
        "text": " and it comes with a 12th-gen Intel processor."
      },
      {
        "start": 411900,
        "stop": 412100,
        "text": " And I think this is it."
      },
      {
        "start": 412100,
        "stop": 412600,
        "text": " And they just have three options, Windows 11 Home, Pro, or Ubuntu LTS."
      },
      {
        "start": 412600,
        "stop": 413100,
        "text": " So I think maybe they were just updating the site, and we had people sound the alarm bells, but I think it's OK."
      },
      {
        "start": 413100,
        "stop": 413500,
        "text": " Next up we have Gene Bean with a triple boost."
      },
      {
        "start": 413500,
        "stop": 413900,
        "text": " [music]"
      },
      {
        "start": 413900,
        "stop": 414300,
        "text": " 2,674 sats."
      },
      {
        "start": 414300,
        "stop": 414600,
        "text": " I think that might just be double-eats sats, right, Chris?"
      },
      {
        "start": 414600,
        "stop": 414800,
        "text": " Double-eat!"
      },
      {
        "start": 414800,
        "stop": 415300,
        "text": " They write, \"I love RClone for getting stuff out of other cloud services and into NextCloud."
      },
      {
        "start": 415300,
        "stop": 416000,
        "text": " With local disks, aka not object storage, behind NextCloud, all the timestamps from Dropbox and other places are preserved.\""
      },
      {
        "start": 416000,
        "stop": 416400,
        "text": " I kind of love the idea that maybe you're not a huge fan of the NextCloud syncing client,"
      },
      {
        "start": 416400,
        "stop": 416900,
        "text": " but use something great like RClone and you can still get benefits of the NextCloud experience,"
      },
      {
        "start": 416900,
        "stop": 417100,
        "text": " but just kind of take that part into yourself."
      },
      {
        "start": 417100,
        "stop": 417600,
        "text": " Yeah, I'm also going to give a plug for my pick last week that lets you do local encryption before you upload it to the cloud."
      },
      {
        "start": 417600,
        "stop": 417800,
        "text": " You might check that out too."
      },
      {
        "start": 417800,
        "stop": 418400,
        "text": " Yeah, Alex, for a bit of context here, since you were probably flying or doing some meetups or something in a different continent at the time,"
      },
      {
        "start": 418400,
        "stop": 419000,
        "text": " I was mentioning how you turned me onto RClone, and it's changed my life in a little tiny way, so thank you for that."
      },
      {
        "start": 419000,
        "stop": 419200,
        "text": " You're very welcome."
      },
      {
        "start": 419200,
        "stop": 419600,
        "text": " Next we have a great booster, Gene Bean, for Quad Boost!"
      },
      {
        "start": 419600,
        "stop": 420200,
        "text": " [music]"
      },
      {
        "start": 420200,
        "stop": 420800,
        "text": " Not only did Gene Bean become the number one supporter for this episode with the amount of boosting that he did,"
      },
      {
        "start": 420800,
        "stop": 421200,
        "text": " but I think, you know what, boys, that's technically a baller boost too."
      },
      {
        "start": 421200,
        "stop": 421600,
        "text": " [music]"
      },
      {
        "start": 421600,
        "stop": 422200,
        "text": " Gene Bean writes, \"I got a little excited sending Boost this episode,\" which is, I think, clearly true."
      },
      {
        "start": 422200,
        "stop": 423000,
        "text": " \"To make myself feel better about sending so many questions and comments, here's an extra bit of leetness for Brent's gas tank.\""
      },
      {
        "start": 423000,
        "stop": 423300,
        "text": " Thank you, Gene Bean. Thank you for your support on this episode."
      },
      {
        "start": 423300,
        "stop": 423700,
        "text": " That is, you are definitely our top supporter this week."
      },
      {
        "start": 423700,
        "stop": 424400,
        "text": " And also thank you everybody who participated in boosting for Brent to get him down to the studio for some projects that we have."
      },
      {
        "start": 424400,
        "stop": 424900,
        "text": " If we can ever save him from Alex's house, continued to boost in, we appreciate your support there."
      },
      {
        "start": 424900,
        "stop": 425600,
        "text": " Also, we recently were sending some splits to the OpenSats project, which has been contributed to free software projects."
      },
      {
        "start": 425600,
        "stop": 425900,
        "text": " That money has now been contributed, several hundred dollars there."
      },
      {
        "start": 425900,
        "stop": 426100,
        "text": " So thank you everybody, congratulations."
      },
      {
        "start": 426100,
        "stop": 426700,
        "text": " And then also, one of the things that's fantastic about these sats that you boost in is we don't sell them."
      },
      {
        "start": 426700,
        "stop": 427600,
        "text": " We kind of consider them maybe as a long-term investment, so it's a way for you to give us something at a small amount of value today that will continue to work for the network."
      },
      {
        "start": 427600,
        "stop": 428000,
        "text": " But instead of just sitting there not doing anything, we actually put them to work."
      },
      {
        "start": 428000,
        "stop": 428700,
        "text": " They help us open up bigger channels, and they help me get Brent's note up and going with multiple channels."
      },
      {
        "start": 428700,
        "stop": 429400,
        "text": " And just recently, which is a big milestone for me, I was able to open a direct channel to the Fountain FM node,"
      },
      {
        "start": 429400,
        "stop": 429800,
        "text": " which is just a lot more efficient in terms of routing and whatnot."
      },
      {
        "start": 429800,
        "stop": 430400,
        "text": " So the boosts also are being put to work today to help us participate in that peer-to-peer network even more."
      },
      {
        "start": 430400,
        "stop": 431100,
        "text": " And it's just kind of a great way that we can actually do something with those sats instead of just letting them sit there, which is also fine."
      },
      {
        "start": 431100,
        "stop": 431300,
        "text": " But, you know, we don't got stuff."
      },
      {
        "start": 431300,
        "stop": 432100,
        "text": " All right, we have a boost in from Prozac, a 1999 boost for Brent's gas fund."
      },
      {
        "start": 432100,
        "stop": 432500,
        "text": " And he says, \"Keep independent media alive. Go podcasting.\""
      },
      {
        "start": 432500,
        "stop": 433200,
        "text": " Great. I think that should be my bumper sticker. And it feels like maybe I might need a bigger gas tank pretty soon."
      },
      {
        "start": 433200,
        "stop": 433400,
        "text": " Well, you've got to drive back too, Brent."
      },
      {
        "start": 433400,
        "stop": 433600,
        "text": " Oh, right."
      },
      {
        "start": 433600,
        "stop": 433800,
        "text": " Shh, don't remind him."
      },
      {
        "start": 433800,
        "stop": 434000,
        "text": " So listen, we're doing something just as this is a new segment."
      },
      {
        "start": 434000,
        "stop": 434600,
        "text": " And again, we talked about this more in Office Hours, but we're going to start tightening the segment up just a little bit to kind of keep the show moving."
      },
      {
        "start": 434600,
        "stop": 435200,
        "text": " So we will be implementing a 1000 minimum sat to get your boost read on the show."
      },
      {
        "start": 435200,
        "stop": 435900,
        "text": " But we do read 100 percent of every boost that come in, every single one of them, which I actually can't make that claim for email just because the volume difference."
      },
      {
        "start": 435900,
        "stop": 436100,
        "text": " But we do want to keep things moving."
      },
      {
        "start": 436100,
        "stop": 436400,
        "text": " So we will have a one K and above limit for boost to be read on the show."
      },
      {
        "start": 436400,
        "stop": 436800,
        "text": " But every now and then, since we read all of them, we'll pull some forward."
      },
      {
        "start": 436800,
        "stop": 437200,
        "text": " Crypto Kyle this week had one of those. He boosted with 500 sat."
      },
      {
        "start": 437200,
        "stop": 437600,
        "text": " So just about half under the minimum. But I wanted to read it anyways."
      },
      {
        "start": 437600,
        "stop": 438100,
        "text": " He said, I picked up a Lenovo P50 for just under four hundred dollars USD."
      },
      {
        "start": 438100,
        "stop": 438900,
        "text": " Super powerful with a built in M2000 MGPU, a Xeon processor, actually pretty great power and performance."
      },
      {
        "start": 438900,
        "stop": 439300,
        "text": " And it runs Nix OS great with ZFS en route with KTE Plasma."
      },
      {
        "start": 439300,
        "stop": 439800,
        "text": " That seems like a nice choice for something like a workstation alternative. You don't need to be super portable necessarily."
      },
      {
        "start": 439800,
        "stop": 440000,
        "text": " But do you want to move it around? Those are nice machines."
      },
      {
        "start": 440000,
        "stop": 440600,
        "text": " You got to figure Wes, with that Xeon CPU in there too, you could probably do some virtualization loads."
      },
      {
        "start": 440600,
        "stop": 440900,
        "text": " I mean, I bet that thing works. I mean, I wouldn't bet it's the best battery life."
      },
      {
        "start": 440900,
        "stop": 441200,
        "text": " But if that's not your goal, I think that's fine."
      },
      {
        "start": 441200,
        "stop": 442300,
        "text": " And then we got a bunch of thank you boosts, 210 sats, 600 sats, 50 sats, 10 sats, 600 sats from ibuki, restacastoversta, birdgy, user 64-1 and a-tharties."
      },
      {
        "start": 442300,
        "stop": 442600,
        "text": " You didn't get any of those right. But I love it anyways."
      },
      {
        "start": 442600,
        "stop": 443200,
        "text": " No, I did not. I did not. I absolutely did not. Thank you everyone also who streams in the sats in the background. We appreciate you."
      },
      {
        "start": 443200,
        "stop": 443800,
        "text": " I just had, you know, I'm trying to keep it tight. Trying to keep on moving."
      },
      {
        "start": 443800,
        "stop": 444300,
        "text": " I'm doing my best, living my best podcast life, but we really appreciate everybody that came in."
      },
      {
        "start": 444300,
        "stop": 444700,
        "text": " And those of you who also just stream them in the background, thank you very much."
      },
      {
        "start": 444700,
        "stop": 445400,
        "text": " Go get a new podcast app, newpodcastapps.com. We love Fountain, Castomatic and Podverse are our favorites."
      },
      {
        "start": 445400,
        "stop": 445800,
        "text": " And then the nerds like to boost in with Boost CLI. I don't know if we got any Boost CLI."
      },
      {
        "start": 445800,
        "stop": 446200,
        "text": " I don't know if we did this week. But then you've got to change your podcast client."
      },
      {
        "start": 446200,
        "stop": 446900,
        "text": " Also Breeze, B-R-E-E-Z dot technology. And one day everyone's going to have this stuff figured out and I won't have to sit here."
      },
      {
        "start": 446900,
        "stop": 447400,
        "text": " And I won't be the only one talking about this. I do want to mention this is going to be on the longer side."
      },
      {
        "start": 447400,
        "stop": 448100,
        "text": " But just to wrap this up, when we started talking about boost on this show, there were 4000 podcasts on the Lightning Network."
      },
      {
        "start": 448100,
        "stop": 448800,
        "text": " Now we are quickly approaching 8000. We've nearly doubled. Not saying we did it,"
      },
      {
        "start": 448800,
        "stop": 449300,
        "text": " but the amount of podcasts have nearly doubled on the Lightning Network since we started talking about it here on the show."
      },
      {
        "start": 449300,
        "stop": 449700,
        "text": " It's growing like crazy. So why not grab a new app and try it out?"
      },
      {
        "start": 449700,
        "stop": 450100,
        "text": " Okay, I'm pretty proud of this pick this week, guys."
      },
      {
        "start": 450100,
        "stop": 450500,
        "text": " You ever just need yourself a little FTP? It's pretty hard to come by these days."
      },
      {
        "start": 450500,
        "stop": 450700,
        "text": " I try not to admit it, but yeah."
      },
      {
        "start": 450700,
        "stop": 451100,
        "text": " The old file transfer protocol. It got the job done, Wes. It got the job done."
      },
      {
        "start": 451100,
        "stop": 451700,
        "text": " But, you know, run an FTP. That's for your dad. Well, me actually back in the day."
      },
      {
        "start": 451700,
        "stop": 452200,
        "text": " But now you can do it quickly on your desktop with user mode FTP."
      },
      {
        "start": 452200,
        "stop": 452700,
        "text": " And it's just a simple, clean, graphical app that you load up."
      },
      {
        "start": 452700,
        "stop": 453100,
        "text": " You set things like the username, the password, the directory you want to share,"
      },
      {
        "start": 453100,
        "stop": 453600,
        "text": " and which particular protocol, FTP, FTPS, or SFTP, that you want to use."
      },
      {
        "start": 453600,
        "stop": 454200,
        "text": " Then you click start and you got yourself a little temporary FTP server on your box"
      },
      {
        "start": 454200,
        "stop": 454700,
        "text": " that you can connect to to transfer apps, files, data, whatever, super easy and quick."
      },
      {
        "start": 454700,
        "stop": 455200,
        "text": " This feels like a weird full circle thing where this is almost like an Android app that would do this, you know,"
      },
      {
        "start": 455200,
        "stop": 455500,
        "text": " on your phone, just a quick little FTP server, but now it's a desktop Linux."
      },
      {
        "start": 455500,
        "stop": 456100,
        "text": " Yeah, I think there are definitely apps like this for Android, but this is for your desktop."
      },
      {
        "start": 456100,
        "stop": 456800,
        "text": " And this, for me, strikes the perfect balance because I don't really need an FTP server anymore ever."
      },
      {
        "start": 456800,
        "stop": 457100,
        "text": " And when I do, I don't really want to set one up. But this is so easy, why not?"
      },
      {
        "start": 457200,
        "stop": 457700,
        "text": " For the folks who maybe are concerned, they do have FTPS and SFTP."
      },
      {
        "start": 457700,
        "stop": 457900,
        "text": " We'll have a link in the show notes."
      },
      {
        "start": 457900,
        "stop": 458400,
        "text": " I think I might just have a bonus pick that I found late last night. You want to hear this one?"
      },
      {
        "start": 458400,
        "stop": 458600,
        "text": " Ray and honest."
      },
      {
        "start": 458600,
        "stop": 458800,
        "text": " Nothing good ever happens after midnight, dude."
      },
      {
        "start": 458800,
        "stop": 459200,
        "text": " Well, it depends. It's always after midnight somewhere, right, Alex?"
      },
      {
        "start": 459200,
        "stop": 459300,
        "text": " Yes."
      },
      {
        "start": 459300,
        "stop": 459500,
        "text": " What time is it? What day is it?"
      },
      {
        "start": 459500,
        "stop": 459800,
        "text": " Right now, especially, right?"
      },
      {
        "start": 459800,
        "stop": 460300,
        "text": " As some or most of you may know, our new website is coming along really well."
      },
      {
        "start": 460300,
        "stop": 460700,
        "text": " We would love to get some testing there, so if you can go to jupyterbroadcasting.net"
      },
      {
        "start": 460700,
        "stop": 461000,
        "text": " and try to break it or think of some new features, that would be awesome."
      },
      {
        "start": 461000,
        "stop": 461300,
        "text": " And there's a little GitHub link there."
      },
      {
        "start": 461300,
        "stop": 461500,
        "text": " And that brings me to this new app that I found."
      },
      {
        "start": 461500,
        "stop": 462100,
        "text": " I was noticing, because we have so many great people who are contributing to the new website,"
      },
      {
        "start": 462100,
        "stop": 462400,
        "text": " it wasn't enough for me to sit down multiple times a day at the computer"
      },
      {
        "start": 462400,
        "stop": 462900,
        "text": " and get all the notifications of commits and issues and discussions and things like that,"
      },
      {
        "start": 462900,
        "stop": 463100,
        "text": " so I needed a mobile app."
      },
      {
        "start": 463100,
        "stop": 463500,
        "text": " But as some of you may know, I leaned very heavily on Eftroid,"
      },
      {
        "start": 463500,
        "stop": 464100,
        "text": " and I wanted to see if there were any open source ways to interact with GitHub."
      },
      {
        "start": 464100,
        "stop": 464500,
        "text": " And I found an amazing one that I think is worth trying."
      },
      {
        "start": 464500,
        "stop": 465000,
        "text": " It's called--and Wes, I'll see if you've maybe used this before--it's called Octodroid."
      },
      {
        "start": 465000,
        "stop": 465600,
        "text": " The way I chose it was that it's extremely active on its own GitHub page,"
      },
      {
        "start": 465600,
        "stop": 465900,
        "text": " and it seems like it's got some amazing features."
      },
      {
        "start": 465900,
        "stop": 466500,
        "text": " So I'm brand new to it, but it has been working fabulously for me, at least in the last 12 hours."
      },
      {
        "start": 466500,
        "stop": 466800,
        "text": " So I think people should check it out."
      },
      {
        "start": 466800,
        "stop": 467100,
        "text": " Hey, it looks handy. I don't know that I need more notifications in my life,"
      },
      {
        "start": 467100,
        "stop": 467600,
        "text": " but if I did--this seems nice. I love when it's on Eftroid as well."
      },
      {
        "start": 467600,
        "stop": 467900,
        "text": " It's just easy to get, and it's open source. Why not?"
      },
      {
        "start": 467900,
        "stop": 468100,
        "text": " I'll put a link to that in the notes as well."
      },
      {
        "start": 468100,
        "stop": 468700,
        "text": " All them notes over at LinuxUnplugged.com/470."
      },
      {
        "start": 468700,
        "stop": 469300,
        "text": " Hello. Hello. Remember how we were just planning episode 400,"
      },
      {
        "start": 469300,
        "stop": 469500,
        "text": " and that seemed like a lot of work?"
      },
      {
        "start": 469500,
        "stop": 469700,
        "text": " Should we start fermenting something?"
      },
      {
        "start": 469700,
        "stop": 470100,
        "text": " Yeah, we better. Yeah, we better start brewing now, is what I'm saying."
      },
      {
        "start": 470100,
        "stop": 470300,
        "text": " Let's worry about it after the road trip."
      },
      {
        "start": 470300,
        "stop": 470700,
        "text": " Road trip first, then we'll worry about episode 500, I think. We got a little time."
      },
      {
        "start": 470700,
        "stop": 470800,
        "text": " Deal."
      },
      {
        "start": 470800,
        "stop": 471200,
        "text": " We'll go to LinuxUnplugged.com/JPL to get your name in that hat"
      },
      {
        "start": 471200,
        "stop": 471700,
        "text": " so you can come hang out with us. Of course, we'll also meet down there near the JPL area"
      },
      {
        "start": 471700,
        "stop": 472100,
        "text": " if you can't make it to JPL, and we've got road stops, several of them,"
      },
      {
        "start": 472100,
        "stop": 472300,
        "text": " like four or five of them along the way."
      },
      {
        "start": 472300,
        "stop": 472600,
        "text": " I'm always kind of putting my feelers out there and hearing where you're all at."
      },
      {
        "start": 472600,
        "stop": 473100,
        "text": " Today was kind of a sweet day, I have to say, because within 24 hours,"
      },
      {
        "start": 473100,
        "stop": 473600,
        "text": " I heard from two long-timers that have been listening since the very start of Linux Action Show."
      },
      {
        "start": 473600,
        "stop": 473900,
        "text": " And one of them I'm going to get to meet on the West Coast tour,"
      },
      {
        "start": 473900,
        "stop": 474300,
        "text": " but one of them lives in the Midwest, but it was neat to get to connect on Matrix last night."
      },
      {
        "start": 474300,
        "stop": 474400,
        "text": " That's lovely."
      },
      {
        "start": 474400,
        "stop": 474700,
        "text": " And talk to them. So, oh man, you guys have really got me jonesing for the meetup,"
      },
      {
        "start": 474700,
        "stop": 474900,
        "text": " so I'm looking forward to that."
      },
      {
        "start": 474900,
        "stop": 475100,
        "text": " Meetup.com/JUPITERbroadcasting for all that."
      },
      {
        "start": 475100,
        "stop": 475400,
        "text": " You can also just connect with us every single Sunday."
      },
      {
        "start": 475400,
        "stop": 476000,
        "text": " We do the show live on Sundays at noon Pacific, 3 p.m. Eastern, over at JUPITER.TUBE,"
      },
      {
        "start": 476000,
        "stop": 476300,
        "text": " and we have an open Mumble Room. You can join our virtual log, hang out with us."
      },
      {
        "start": 476300,
        "stop": 476700,
        "text": " We like to chat during the show, during the pre- and post-show."
      },
      {
        "start": 476700,
        "stop": 477000,
        "text": " It's a great way to kind of get kind of a taste of the meetup experience,"
      },
      {
        "start": 477000,
        "stop": 477200,
        "text": " but from the comfort of your own home."
      },
      {
        "start": 477200,
        "stop": 477700,
        "text": " So join us. We have it in your time at jupiterbroadcasting.com/calendar."
      },
      {
        "start": 477700,
        "stop": 477800,
        "text": " But of course, I know y'all can't make it."
      },
      {
        "start": 477800,
        "stop": 478200,
        "text": " See you next week. Same bad time, same bad station."
      },
      {
        "start": 478200,
        "stop": 478500,
        "text": " So of course we do have LinuxUnplugged.com/subscribe."
      },
      {
        "start": 478500,
        "stop": 478700,
        "text": " That way you can get the episode every single week."
      },
      {
        "start": 478700,
        "stop": 479000,
        "text": " When it comes out, like it do, we never miss a week."
      },
      {
        "start": 479000,
        "stop": 479300,
        "text": " And of course, go grab Linux Action News."
      },
      {
        "start": 479300,
        "stop": 479800,
        "text": " Loaded with deets, you didn't hear tons of things going on in the world of Linux and open source."
      },
      {
        "start": 479800,
        "stop": 480000,
        "text": " We cover it every single week."
      },
      {
        "start": 480000,
        "stop": 480200,
        "text": " LinuxActionNews.com"
      },
      {
        "start": 480200,
        "stop": 480500,
        "text": " As for us, well that just about wraps it up."
      },
      {
        "start": 480500,
        "stop": 480800,
        "text": " You can find all of our resources over at LinuxUnplugged.com"
      },
      {
        "start": 480800,
        "stop": 481000,
        "text": " and go check out that new test website."
      },
      {
        "start": 481000,
        "stop": 481200,
        "text": " Let us know what you think."
      },
      {
        "start": 481200,
        "stop": 481400,
        "text": " jupiterbroadcasting.net"
      },
      {
        "start": 481400,
        "stop": 481700,
        "text": " Thank you to our members who helped make this show possible."
      },
      {
        "start": 481700,
        "stop": 482000,
        "text": " Visit us at LinuxUnpluggedCore.com and we'll see you right back here next week."
      },
      {
        "start": 482100,
        "stop": 482400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 482400,
        "stop": 482800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 482800,
        "stop": 483200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 483200,
        "stop": 483600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 483600,
        "stop": 484000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 484000,
        "stop": 484400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 484400,
        "stop": 484800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 484800,
        "stop": 485200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 485200,
        "stop": 485600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 485600,
        "stop": 486000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 486200,
        "stop": 486600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 486600,
        "stop": 487000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 487000,
        "stop": 487400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 487400,
        "stop": 487800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 487800,
        "stop": 488200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 488200,
        "stop": 488600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 488600,
        "stop": 489000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 489000,
        "stop": 489400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 489400,
        "stop": 489800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 489800,
        "stop": 490200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 490200,
        "stop": 490600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 490600,
        "stop": 491000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 491000,
        "stop": 491400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 491400,
        "stop": 491800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 491800,
        "stop": 492200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 492200,
        "stop": 492600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 492600,
        "stop": 493000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 493000,
        "stop": 493400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 493400,
        "stop": 493800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 493800,
        "stop": 494200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 494200,
        "stop": 494600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 494600,
        "stop": 495000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 495000,
        "stop": 495400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 495400,
        "stop": 495800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 495800,
        "stop": 496200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 496200,
        "stop": 496600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 496600,
        "stop": 497000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 497000,
        "stop": 497400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 497400,
        "stop": 497800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 497800,
        "stop": 498200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 498200,
        "stop": 498600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 498600,
        "stop": 499000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 499000,
        "stop": 499400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 499400,
        "stop": 499800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 499800,
        "stop": 500200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 500200,
        "stop": 500600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 500600,
        "stop": 501000,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 501000,
        "stop": 501400,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 501400,
        "stop": 501800,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 501800,
        "stop": 502200,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 502200,
        "stop": 502600,
        "text": " LinuxUnplugged.com"
      },
      {
        "start": 502600,
        "stop": 503000,
        "text": " It was a good one."
      }
    ],
    "processing_time": {
      "secs": 3423,
      "nanos": 962038653
    }
  },
  "metadata": {
    "title": "LINUX Unplugged 470: Let's Call It an Upgrade",
    "pictures": [],
    "duration": {
      "secs": 5009,
      "nanos": 238000000
    },
    "unique_id": "http://linuxunplugged.com/470"
  },
  "episode": {
    "title": "Let's Call It an Upgrade | LINUX Unplugged 470",
    "description": "We present a buffet of budget Linux boxes. From $40 to $400 you'll be surprised by what we found. Then we attempt to find the perfect distro for them. Special Guest: Alex Kretzschmar.",
    "content": "<p><p>We present a buffet of budget Linux boxes. From $40 to $400 you&#39;ll be surprised by what we found. Then we attempt to find the perfect distro for them.</p><p>Special Guest: Alex Kretzschmar.</p><p>Sponsored By:</p><ul><li><a href=\"https://bitwarden.com/linux\" rel=\"nofollow\">Bitwarden</a>: <a href=\"https://bitwarden.com/linux\" rel=\"nofollow\">Bitwarden is the easiest way for businesses and individuals to store, share, and sync sensitive data.</a></li><li><a href=\"https://linode.com/unplugged\" rel=\"nofollow\">Linode Cloud Hosting</a>: <a href=\"https://linode.com/unplugged\" rel=\"nofollow\">A special offer for all Linux Unplugged Podcast listeners and new Linode customers, visit linode.com/unplugged, and receive $100 towards your new account. </a></li><li><a href=\"http://tailscale.com/\" rel=\"nofollow\">Tailscale</a>: <a href=\"http://tailscale.com/\" rel=\"nofollow\">Tailscale is a Zero config VPN. It installs on any device in minutes, manages firewall rules for you, and works from anywhere. Get 20 devices for free for a personal account. </a></li></ul><p><a href=\"https://jupitersignal.memberful.com/checkout?plan=52946\" rel=\"payment\">Support LINUX Unplugged</a></p><p>Links:</p><ul><li><a href=\"https://www.inverse.com/science/mars-sample-return-update\" title=\"NASA greenlights two new Mars helicopters and lengthens Perseverances resume\" rel=\"nofollow\">NASA greenlights two new Mars helicopters and lengthens Perseverances resume</a> &mdash; Perseverances high-flying robotic companion, the Ingenuity helicopter, has inspired the design of two future rotorcraft that would swerve over the Martian terrain to pick up other samples.</li><li><a href=\"https://linuxunplugged.com/jpl\" title=\"Get your name in the hat for our JPL tour\" rel=\"nofollow\">Get your name in the hat for our JPL tour</a> &mdash; Join the JB Crew at JPL! We only have 15 spots. Please enter your info, and our happy little python script might just pick your name from the virtual hat.</li><li><a href=\"https://www.meetup.com/jupiterbroadcasting/events/\" title=\"Upcoming Jupiter Broadcasting Meetups\" rel=\"nofollow\">Upcoming Jupiter Broadcasting Meetups</a></li><li><a href=\"https://twitter.com/remembersonly/status/1553500805956866048?s=12&t=q5fkFL6KZjQ2bfWg6wFq2g\" title=\"remembertoremember on Twitter\" rel=\"nofollow\">remembertoremember on Twitter</a> &mdash; I havent really had major Linux woes in a long time and I use new hardware with 4k but always shop with Linux in mind.</li><li><a href=\"https://www.amazon.com/dp/B09ZLBDVZD\" title=\"New $160: Beelink MiniS Mini Pc with 11th Gen Processor N5095,8GB DDR4 128GB SSD Mini Desktop Computers\" rel=\"nofollow\">New $160: Beelink MiniS Mini Pc with 11th Gen Processor N5095,8GB DDR4 128GB SSD Mini Desktop Computers</a></li><li><a href=\"https://www.ebay.com/itm/394069161806\" title=\"Acer Switch One SW1-011 Intel Atom x5-Z8300 @ 1.44 GHz 2GB Ram 32GB Storage\" rel=\"nofollow\">Acer Switch One SW1-011 Intel Atom x5-Z8300 @ 1.44 GHz 2GB Ram 32GB Storage</a></li><li><a href=\"https://www.ebay.com/p/24039563830\" title=\"Lenovo IdeaPad 3 14IML05 14\" 128GB SSD, Intel Pentium Gold, 2.40GHz, 4GB\" rel=\"nofollow\">Lenovo IdeaPad 3 14IML05 14\" 128GB SSD, Intel Pentium Gold, 2.40GHz, 4GB</a></li><li><a href=\"https://www.ebay.com/itm/Acer-Mini-PC-Atom-x5-Z8300-2Gb-RAM-16Gb-EMMC-WiFi-Bluetooth-Linux-CloudProfessor-/164608918888?hash=item265374c568\" title=\"Acer Mini PC Atom x5-Z8300 2Gb RAM 16Gb EMMC WiFi Bluetooth Linux CloudProfessor\" rel=\"nofollow\">Acer Mini PC Atom x5-Z8300 2Gb RAM 16Gb EMMC WiFi Bluetooth Linux CloudProfessor</a></li><li><a href=\"https://github.com/nix-community/nixos-generators\" title=\"nixos-generators\" rel=\"nofollow\">nixos-generators</a> &mdash; The nixos-generators project allows to take the same NixOS configuration, and generate outputs for different target formats.</li><li><a href=\"https://store.minisforum.com/products/deskmini-um350-x-manjaro-linux?_pos=2&_psq=ma&_ss=e&_v=1.0\" title=\"MinisForum DeskMini UM350 Ryzen Mini PC\" rel=\"nofollow\">MinisForum DeskMini UM350 Ryzen Mini PC</a></li><li><a href=\"https://www.ebay.com/itm/255513324172?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=Ys7w-kJzSvG&sssrc=2349624&ssuid=dAfrwUwwSlC&var=&widget_ver=artemis&media=COPY\" title=\"Dell Wyse 5070 thin client\" rel=\"nofollow\">Dell Wyse 5070 thin client</a></li><li><a href=\"https://www.linuxmint.com/rel_vanessa_cinnamon_whatsnew.php\" title=\"New Features in Linux Mint 21 Vanessa Cinnamon Edition\" rel=\"nofollow\">New Features in Linux Mint 21 Vanessa Cinnamon Edition</a> &mdash; Linux Mint 21 is a long term support release which will be supported until 2027. It comes with updated software and brings refinements and many new features to make your desktop experience more comfortable.</li><li><a href=\"https://www.phoronix.com/news/Linux-Mint-21-Released\" title=\"Linux Mint 21 Released - Built Atop Ubuntu 22.04 LTS\" rel=\"nofollow\">Linux Mint 21 Released - Built Atop Ubuntu 22.04 LTS</a></li><li><a href=\"https://www.officehours.hair/9\" title=\"Office Hours 9\" rel=\"nofollow\">Office Hours 9</a> &mdash; We Hate Crypto Too</li><li><a href=\"https://www.manageiq.org/\" title=\"ManageIQ\" rel=\"nofollow\">ManageIQ</a></li><li><a href=\"https://flathub.org/apps/details/eu.ithz.umftpd\" title=\"Usermode FTP Server on Flathub\" rel=\"nofollow\">Usermode FTP Server on Flathub</a></li><li><a href=\"https://github.com/slapperwan/gh4a\" title=\"gh4a\" rel=\"nofollow\">gh4a</a> &mdash; Github client for Android</li><li><a href=\"https://f-droid.org/en/packages/com.gh4a/\" title=\"OctoDroid on F-Droid\" rel=\"nofollow\">OctoDroid on F-Droid</a></li><li><a href=\"https://play.google.com/store/apps/details?id=com.gh4a&hl=en_US&gl=US\" title=\"OctoDroid for GitHub\" rel=\"nofollow\">OctoDroid for GitHub</a></li><li><a href=\"http://tiny.cc/qt8vuz\" title=\"JB Colony Matrix Meetup Rooms\" rel=\"nofollow\">JB Colony Matrix Meetup Rooms</a></li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-8682",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15549192/e632a4a7-5a44-45d3-ba74-8dd60533bb5f.mp3",
      "length": "71139328",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-08-07T20:45:00+02:00"
  },
  "speedup": 1.4629945
}