{
  "transcript": {
    "utterances": [
      {
        "start": 200,
        "stop": 600,
        "text": " So I'm a little bit older than you guys. I'm kind of interested to know what your first big LAN experience was."
      },
      {
        "start": 600,
        "stop": 1000,
        "text": " LAN party style. Like, first video game."
      },
      {
        "start": 1000,
        "stop": 1400,
        "text": " What was it? Well, I think the original Starcraft for me."
      },
      {
        "start": 1400,
        "stop": 1800,
        "text": " Oh, that's some good gaming. Right? Some Warcraft 2 at the time."
      },
      {
        "start": 1800,
        "stop": 2200,
        "text": " Age of Empires in the mix. Do you happen to remember what networking protocol"
      },
      {
        "start": 2200,
        "stop": 2600,
        "text": " you used for the LAN party? I think it was IPX for the most part. Yeah."
      },
      {
        "start": 2600,
        "stop": 3000,
        "text": " That changed over the years, but that's what we started with. IPX worked great, man."
      },
      {
        "start": 3000,
        "stop": 3400,
        "text": " It worked great. It was kind of my incentive to learn a little bit about what networking"
      },
      {
        "start": 3400,
        "stop": 3800,
        "text": " even was, you know? Like, how do we make this work? And you know, the great thing about IPX,"
      },
      {
        "start": 3800,
        "stop": 4200,
        "text": " it had name resolution built into the protocol. You didn't have to run DNS separately."
      },
      {
        "start": 4200,
        "stop": 4600,
        "text": " Which is nice because there's no way I would have been able to figure out how."
      },
      {
        "start": 4600,
        "stop": 5000,
        "text": " No. What about you, Brian? What was your first LAN party experience? The first I remember was"
      },
      {
        "start": 5000,
        "stop": 5400,
        "text": " probably playing the original Quake. Yeah, yeah, me too."
      },
      {
        "start": 5400,
        "stop": 5800,
        "text": " And then, you know, the Quake 2s and the Quake 3s. Yeah."
      },
      {
        "start": 5800,
        "stop": 6200,
        "text": " Man, some great memories there. And just like back in the day when you just didn't have to"
      },
      {
        "start": 6200,
        "stop": 6600,
        "text": " care about anything else for hours and hours and hours on end. That was"
      },
      {
        "start": 6600,
        "stop": 7000,
        "text": " pretty awesome. Although you needed, you know, with me and my three brothers, we"
      },
      {
        "start": 7000,
        "stop": 7400,
        "text": " needed a minivan to move all our PCs to someone else's house and set them all up. I was just"
      },
      {
        "start": 7400,
        "stop": 7800,
        "text": " thinking of lugging the CRTs around. You had to be dedicated. She didn't want to leave for hours."
      },
      {
        "start": 7800,
        "stop": 8200,
        "text": " You're like, it took me a lot. I don't normally leave the house and I had to"
      },
      {
        "start": 8200,
        "stop": 8600,
        "text": " carry this whole thing here. It was a big day when I first got my first LCD."
      },
      {
        "start": 8600,
        "stop": 9000,
        "text": " Chris, I think you still have your first one. It's like a 4x3 teeny tiny little"
      },
      {
        "start": 9000,
        "stop": 9400,
        "text": " tiny terrible resolution thing, but man, that was an upgrade. Yeah."
      },
      {
        "start": 9400,
        "stop": 9800,
        "text": " I think it's 1024x768. And it's VGA."
      },
      {
        "start": 9800,
        "stop": 10200,
        "text": " It's old. It's KDS. And they're not"
      },
      {
        "start": 10200,
        "stop": 10600,
        "text": " even around anymore. And the thing's hooked up to our server out in the garage. It still works."
      },
      {
        "start": 10600,
        "stop": 11000,
        "text": " I still use it from time to time. And literally, every time it"
      },
      {
        "start": 11000,
        "stop": 11400,
        "text": " turns on, I'm impressed. It's gotta be 20+ years old."
      },
      {
        "start": 11400,
        "stop": 11800,
        "text": " At this point, it might never die."
      },
      {
        "start": 11800,
        "stop": 13200,
        "text": " Hello friends, and welcome back to your weekly Linux talk show."
      },
      {
        "start": 13200,
        "stop": 13600,
        "text": " My name is Chris. My name is Wes. And my name is Brent."
      },
      {
        "start": 13600,
        "stop": 14000,
        "text": " Hello gentlemen. Coming up on the show today, we're trying"
      },
      {
        "start": 14000,
        "stop": 14400,
        "text": " out Shufflecake. So this is a tool for Linux that promises the ability to"
      },
      {
        "start": 14400,
        "stop": 14800,
        "text": " create hidden volumes, much like TrueCrypt and Veracrypt"
      },
      {
        "start": 14800,
        "stop": 15200,
        "text": " are famous for. But what we're going to do is really, really put it to the test."
      },
      {
        "start": 15200,
        "stop": 15600,
        "text": " We're going to share the details all about the project on the show, and then we're going to let our"
      },
      {
        "start": 15600,
        "stop": 16000,
        "text": " livestream SSH into the box. We're going to give them pseudo access,"
      },
      {
        "start": 16000,
        "stop": 16400,
        "text": " and we're going to see if they can find our hidden Shufflecake volumes."
      },
      {
        "start": 16400,
        "stop": 16800,
        "text": " And if they can, the winner will receive"
      },
      {
        "start": 16800,
        "stop": 17200,
        "text": " 20,000 sats if they manage to unlock all of the hidden volumes that we've set up on there."
      },
      {
        "start": 17200,
        "stop": 17600,
        "text": " Plus, there's been just several threads, little thread bombs we've dropped on the show"
      },
      {
        "start": 17600,
        "stop": 18000,
        "text": " over the last few weeks, so we're going to follow up on those. We'll sit down, we'll do the work to"
      },
      {
        "start": 18000,
        "stop": 18400,
        "text": " update you on all of it. So stay tuned, because then after that, we'll round it out with some boosts,"
      },
      {
        "start": 18400,
        "stop": 18800,
        "text": " some picks, and a lot more. So before I go any further, let's say hello"
      },
      {
        "start": 18800,
        "stop": 19200,
        "text": " to our virtual look. Time-appropriate greetings, Mumble Room."
      },
      {
        "start": 19200,
        "stop": 19600,
        "text": " Hey Chris, hello Grant, and hello Wes."
      },
      {
        "start": 19600,
        "stop": 20000,
        "text": " Hello, you beautiful bastards. We've got lots of you in there, love seeing you in there. Of course,"
      },
      {
        "start": 20000,
        "stop": 20400,
        "text": " in the quiet listening as well. Also want to say good morning to our friends"
      },
      {
        "start": 20400,
        "stop": 20800,
        "text": " over at Tailscale. Tailscale is a mesh VPN that's protected"
      },
      {
        "start": 20800,
        "stop": 21200,
        "text": " by WireGuard. We love it. I use the snot out of it."
      },
      {
        "start": 21200,
        "stop": 21600,
        "text": " It's so handy. And you can get it up and going in just minutes on any device. Try it out."
      },
      {
        "start": 21600,
        "stop": 22000,
        "text": " Tailscale.com. I think it's every other week that you're coming to me with like,"
      },
      {
        "start": 22000,
        "stop": 22400,
        "text": " \"Did you know Tailscale could do this?\" I'm like, \"Yeah, it's awesome.\""
      },
      {
        "start": 22400,
        "stop": 22800,
        "text": " It has changed my Home Assistant game. Oh my goodness, no more inbound ports"
      },
      {
        "start": 22800,
        "stop": 23200,
        "text": " on my firewalls. Tailscale.com, tell Linux, unplug"
      },
      {
        "start": 23200,
        "stop": 23600,
        "text": " sent you. So we have a lot of things to talk about today."
      },
      {
        "start": 23600,
        "stop": 24000,
        "text": " But we have kind of a special guest in studio. We'll"
      },
      {
        "start": 24000,
        "stop": 24400,
        "text": " probably share the story and the bother boost, but before we go any further, I just wanted to say good morning"
      },
      {
        "start": 24400,
        "stop": 24800,
        "text": " to listener John A. who's in the studio this morning. Hey John. Hey, morning."
      },
      {
        "start": 24800,
        "stop": 25200,
        "text": " Thanks for being here. Thanks for having me. Coming from Yakima Valley of Washington"
      },
      {
        "start": 25200,
        "stop": 25600,
        "text": " you brought us some delicious beverages, including"
      },
      {
        "start": 25600,
        "stop": 26000,
        "text": " a sparkling cider, which we are participating in right now, so thank you very much for that."
      },
      {
        "start": 26000,
        "stop": 26400,
        "text": " You bet. And I think we'll talk to you in a little bit when we get to the bother boost segment."
      },
      {
        "start": 26400,
        "stop": 26800,
        "text": " So that's a fun episode. We got in-studio guests, we got live guests,"
      },
      {
        "start": 26800,
        "stop": 27200,
        "text": " we got a chat room, we got a mumble room. There's a lot going on."
      },
      {
        "start": 27200,
        "stop": 27600,
        "text": " And I want to pick Wes' brain about a topic called"
      },
      {
        "start": 27600,
        "stop": 28000,
        "text": " Shuffle Cake. I came across this a couple of weeks ago"
      },
      {
        "start": 28000,
        "stop": 28400,
        "text": " because I started seeing people talk about it online. And I also have had a hole in my heart"
      },
      {
        "start": 28400,
        "stop": 28800,
        "text": " for TrueCrypt. TrueCrypt really offered something special."
      },
      {
        "start": 28800,
        "stop": 29200,
        "text": " A usable interface to create volumes that were completely"
      },
      {
        "start": 29200,
        "stop": 29600,
        "text": " hidden on your system. So that way the idea is, an elite hacker"
      },
      {
        "start": 29600,
        "stop": 30000,
        "text": " or state actor, if they somehow, maybe it's a border agent, I don't know what your"
      },
      {
        "start": 30000,
        "stop": 30400,
        "text": " scenario is. You make up your own. But somebody gets your laptop and maybe you want to"
      },
      {
        "start": 30400,
        "stop": 30800,
        "text": " hide something in there like your Bitcoin wallet or your tax documents"
      },
      {
        "start": 30800,
        "stop": 31200,
        "text": " or whatever, again, make up your own scenario. But you want to not only be able to hide it"
      },
      {
        "start": 31200,
        "stop": 31600,
        "text": " and encrypt it, but you want to be able to plausibly deny it even exists. That's like the"
      },
      {
        "start": 31600,
        "stop": 32000,
        "text": " next level of hiding data. Not only is it encrypted and protected,"
      },
      {
        "start": 32000,
        "stop": 32400,
        "text": " but it's hard to detect that it even exists. And Shuffle Cake is a tool for doing"
      },
      {
        "start": 32400,
        "stop": 32800,
        "text": " just that. And it allows Linux users to create multiple hidden volumes"
      },
      {
        "start": 32800,
        "stop": 33200,
        "text": " on a storage device in a way that is very difficult, even under"
      },
      {
        "start": 33200,
        "stop": 33600,
        "text": " forensic inspection, to prove the existence of such a volume."
      },
      {
        "start": 33600,
        "stop": 34000,
        "text": " So I came up with a great idea to create a server that"
      },
      {
        "start": 34000,
        "stop": 34400,
        "text": " we could play around with Shuffle Cake on, and then I got super busy."
      },
      {
        "start": 34400,
        "stop": 34800,
        "text": " And Brent got super busy with family stuff. We both had a lot to do"
      },
      {
        "start": 34800,
        "stop": 35200,
        "text": " and Wes just kind of took it upon himself to really take Shuffle Cake"
      },
      {
        "start": 35200,
        "stop": 35600,
        "text": " and experiment with it. A fun new kernel module?"
      },
      {
        "start": 35600,
        "stop": 36000,
        "text": " Oh boy. Should we start there? It is"
      },
      {
        "start": 36000,
        "stop": 36400,
        "text": " new. It requires a kernel module, and they've mostly tested"
      },
      {
        "start": 36400,
        "stop": 36800,
        "text": " it with what, 5.15, I think? I think 5.13? But 5.15 is what we're"
      },
      {
        "start": 36800,
        "stop": 37200,
        "text": " running, if I recall, right? Maybe that's why it's crashing sometimes."
      },
      {
        "start": 37200,
        "stop": 37600,
        "text": " It isn't 100% stable yet. Yeah, what do they say here?"
      },
      {
        "start": 37600,
        "stop": 38000,
        "text": " \"We believe that Shuffle Cake fills a gap in the availability of robust, plausible deniability"
      },
      {
        "start": 38000,
        "stop": 38400,
        "text": " solutions for Linux.\" Yeah, it seems like it does. But their"
      },
      {
        "start": 38400,
        "stop": 38800,
        "text": " emphasis is, \"The current release is still a non-production-ready"
      },
      {
        "start": 38800,
        "stop": 39200,
        "text": " prototype, so we advise against using it for really sensitive operations.\""
      },
      {
        "start": 39200,
        "stop": 39600,
        "text": " And yeah, we're just playing with it here, we're getting the feel for how these tools work. If you're really"
      },
      {
        "start": 39600,
        "stop": 40000,
        "text": " trying to hide stuff from people that don't like you, don't use this. Yeah, this is"
      },
      {
        "start": 40000,
        "stop": 40400,
        "text": " more like, we're checking in on this tool to see if this is going to become a solution"
      },
      {
        "start": 40400,
        "stop": 40800,
        "text": " for us down the road, and clearly some of the things it's going to have to do, it's going to"
      },
      {
        "start": 40800,
        "stop": 41200,
        "text": " have to support newer kernels, and it's going to need"
      },
      {
        "start": 41200,
        "stop": 41600,
        "text": " to be able to get simply installed quickly. So some background"
      },
      {
        "start": 41600,
        "stop": 42000,
        "text": " on that kernel business. This came out of a master's thesis."
      },
      {
        "start": 42000,
        "stop": 42400,
        "text": " So it's some research that some folks at Kudelsky Security had been"
      },
      {
        "start": 42400,
        "stop": 42800,
        "text": " thinking about, they'd seen the gaps in this, especially after TrueKip was"
      },
      {
        "start": 42800,
        "stop": 43200,
        "text": " deprecated, the gaps in this sort of tooling, especially Linux-first sort of tooling."
      },
      {
        "start": 43200,
        "stop": 43600,
        "text": " And so there's just sort of an alignment where"
      },
      {
        "start": 43600,
        "stop": 44000,
        "text": " there's people willing to sponsor that, companies sponsoring that, academics interested, and"
      },
      {
        "start": 44000,
        "stop": 44400,
        "text": " the right students who wanted to push along that path and sort of see if they could"
      },
      {
        "start": 44400,
        "stop": 44800,
        "text": " progress the state of the art. And that all came together, but"
      },
      {
        "start": 44800,
        "stop": 45200,
        "text": " when you're picking a project like this, you're trying to develop the algorithm"
      },
      {
        "start": 45200,
        "stop": 45600,
        "text": " and the protocols and how all the tools work, not trying to keep up with the latest"
      },
      {
        "start": 45600,
        "stop": 46000,
        "text": " kernel release. So I suspect that's because that was the version that they started with"
      },
      {
        "start": 46000,
        "stop": 46400,
        "text": " when they started working on the project. Yeah, that makes sense, right? And then the idea would be maybe the"
      },
      {
        "start": 46400,
        "stop": 46800,
        "text": " community could help them expanding it from there, like they're doing the basic research, they're"
      },
      {
        "start": 46800,
        "stop": 47200,
        "text": " getting the first principle stuff done. Right, step one is, hey, it works at all. Step two is"
      },
      {
        "start": 47200,
        "stop": 47600,
        "text": " let's make it work more rapidly. So we want to give our livestream a head start here."
      },
      {
        "start": 47600,
        "stop": 48000,
        "text": " What we want to do is we want to give you the host that you can SSH into, a"
      },
      {
        "start": 48000,
        "stop": 48400,
        "text": " user and a password that has pseudo-privileges. We're asking that"
      },
      {
        "start": 48400,
        "stop": 48800,
        "text": " people don't wreck the box, but we've set up a ShuffleCake box on Linode with some hidden"
      },
      {
        "start": 48800,
        "stop": 49200,
        "text": " data, and the challenge is to be the first to find a secret value that we"
      },
      {
        "start": 49200,
        "stop": 49600,
        "text": " have hidden in there and then post that secret value in the matrix chat room."
      },
      {
        "start": 49600,
        "stop": 50000,
        "text": " And what we're going to do is we're going to give you a hint that should unlock the first"
      },
      {
        "start": 50000,
        "stop": 50400,
        "text": " volume. Once you unlock that volume, you'll get a second hint."
      },
      {
        "start": 50400,
        "stop": 50800,
        "text": " That second hint will allow you to unlock a second hidden volume"
      },
      {
        "start": 50800,
        "stop": 51200,
        "text": " that has the secret value. That's the value you post in the matrix chat room."
      },
      {
        "start": 51200,
        "stop": 51600,
        "text": " We want to give it out now because as we explain ShuffleCake,"
      },
      {
        "start": 51600,
        "stop": 52000,
        "text": " we just want people to have time to try to do this, because the idea is it's supposed to be hard."
      },
      {
        "start": 52000,
        "stop": 52400,
        "text": " So, get your terminals ready and SSH into"
      },
      {
        "start": 52400,
        "stop": 52800,
        "text": " startrek.sexy, the username, all lowercase,"
      },
      {
        "start": 52800,
        "stop": 53200,
        "text": " Kirk, K-I-R-K, and the password,"
      },
      {
        "start": 53200,
        "stop": 53600,
        "text": " all one word lowercase, StarTrek. You'll probably"
      },
      {
        "start": 53600,
        "stop": 54000,
        "text": " pretty quickly find a suspicious looking volume, and the password"
      },
      {
        "start": 54000,
        "stop": 54400,
        "text": " to unlock that first suspicious looking volume is my"
      },
      {
        "start": 54400,
        "stop": 54800,
        "text": " dog's name. So, if you know my dog's name, you can unlock that first volume."
      },
      {
        "start": 54800,
        "stop": 55200,
        "text": " That will give you a hint for the second volume, which is the value you need to post"
      },
      {
        "start": 55200,
        "stop": 55600,
        "text": " in the matrix chat room to win. So, log in to startrek.sexy,"
      },
      {
        "start": 55600,
        "stop": 56000,
        "text": " user Kirk, password StarTrek, and begin looking around."
      },
      {
        "start": 56000,
        "stop": 56400,
        "text": " Use my dog's name to unlock that first volume, which will probably come across"
      },
      {
        "start": 56400,
        "stop": 56800,
        "text": " fairly quickly, and it's the second volume that's actually the tricky"
      },
      {
        "start": 56800,
        "stop": 57200,
        "text": " one to find and has the goodies you need to share."
      },
      {
        "start": 57200,
        "stop": 57600,
        "text": " To be clear, we've got some of the tooling installed for that user already, but you're also, you know, you don't have to take that path."
      },
      {
        "start": 57600,
        "stop": 58000,
        "text": " Do whatever you want. Investigate the file, see if you can find our secrets another way, if you've got the means."
      },
      {
        "start": 58000,
        "stop": 58400,
        "text": " So, you could, so this ShuffleCake is two parts."
      },
      {
        "start": 58400,
        "stop": 58800,
        "text": " It's some user land tools, and it's a kernel module to make this work. And you could"
      },
      {
        "start": 58800,
        "stop": 59200,
        "text": " load it all up, create your volumes, stash your data,"
      },
      {
        "start": 59200,
        "stop": 59600,
        "text": " and then completely delete the user land tools, right? So, if somebody was"
      },
      {
        "start": 59600,
        "stop": 60000,
        "text": " coming across your box, and they didn't even have ShuffleCake to begin with,"
      },
      {
        "start": 60000,
        "stop": 60400,
        "text": " that makes it even harder, right? So, explain a little bit of what's going on here,"
      },
      {
        "start": 60400,
        "stop": 60800,
        "text": " and how you can so secretly hide files, because this sounds really cool."
      },
      {
        "start": 60800,
        "stop": 61200,
        "text": " Yeah, okay, so the idea here is plausible deniability. So, you might not"
      },
      {
        "start": 61200,
        "stop": 61600,
        "text": " use this, and ShuffleCake as it stands now doesn't really address"
      },
      {
        "start": 61600,
        "stop": 62000,
        "text": " just straight up hiding it. You know, you're gonna need to have a, you clearly have some kind of storage device."
      },
      {
        "start": 62000,
        "stop": 62400,
        "text": " I think a lot of the threats, and if you check out the master's thesis, they talk about"
      },
      {
        "start": 62400,
        "stop": 62800,
        "text": " like the state of the art at the time, and review some of the existing tooling, like TrueCrypt, and"
      },
      {
        "start": 62800,
        "stop": 63200,
        "text": " kind of talk about the different threat models that you might want to use ShuffleCake as a tool to help you with."
      },
      {
        "start": 63200,
        "stop": 63800,
        "text": " That's handy. Yeah, so if you're gonna actually adopt this, it's worth checking out the whole thesis, which we'll have linked in the notes."
      },
      {
        "start": 63800,
        "stop": 64200,
        "text": " And probably waiting for some development time. Yeah, yeah, definitely. But it talks about"
      },
      {
        "start": 64200,
        "stop": 64600,
        "text": " you know, you're probably someone, maybe you're a journalist, or an activist, or whatever,"
      },
      {
        "start": 64600,
        "stop": 65000,
        "text": " maybe you're Captain Picard, and you suspect that the top leadership"
      },
      {
        "start": 65000,
        "stop": 65400,
        "text": " at the Federation's been taken over by somebody, and you gotta, you know, hide some stuff to work with your fellow captains."
      },
      {
        "start": 65400,
        "stop": 65800,
        "text": " They got these weird things sticking out the back of their necks. What's the deal with that?"
      },
      {
        "start": 65800,
        "stop": 66200,
        "text": " Yeah, your adversaries probably assume that you have some secrets, right? Like whether it's your"
      },
      {
        "start": 66200,
        "stop": 66600,
        "text": " work documents or whatever, they expect you to have an encrypted drive, or a secure drive of some kind."
      },
      {
        "start": 66600,
        "stop": 67000,
        "text": " Sure, or if you stole Chris's laptop, you'd probably expect there to be some Bitcoin on there."
      },
      {
        "start": 67000,
        "stop": 67400,
        "text": " Right, and you'd probably want to secure that. Yeah. So really the idea here is that you could have"
      },
      {
        "start": 67400,
        "stop": 67800,
        "text": " multiple hidden volumes, and that you can have multiple"
      },
      {
        "start": 67800,
        "stop": 68200,
        "text": " passwords to get access to those multiple volumes, so that, let's say, you know,"
      },
      {
        "start": 68200,
        "stop": 68600,
        "text": " you found out that I, you know, I know you've got some Bitcoin,"
      },
      {
        "start": 68600,
        "stop": 69000,
        "text": " I have you under physical constraint, and I want to get access to that Bitcoin."
      },
      {
        "start": 69000,
        "stop": 69400,
        "text": " You can ham it up a bit, you know, pretend that you don't, whatever,"
      },
      {
        "start": 69400,
        "stop": 69800,
        "text": " but eventually I'm torturing you, or I'm threatening your dog,"
      },
      {
        "start": 69800,
        "stop": 70200,
        "text": " or I'm threatening Dylan, or I'm threatening the mixer, who knows? Wow! This got really dark, dude!"
      },
      {
        "start": 70200,
        "stop": 70600,
        "text": " Something real mean to you. Okay. Under duress, you can then be like, okay,"
      },
      {
        "start": 70600,
        "stop": 71000,
        "text": " yes, I do, you know, I am Satoshi, I do have"
      },
      {
        "start": 71000,
        "stop": 71400,
        "text": " that original wallet key, here's the password. Yeah, and that unlocks"
      },
      {
        "start": 71400,
        "stop": 71800,
        "text": " a volume for them. Right, and so it all looks like you're unlocking, you know,"
      },
      {
        "start": 71800,
        "stop": 72200,
        "text": " you're unlocking a secret volume. You are, you couldn't, it'd be hard to find that if you didn't have the key."
      },
      {
        "start": 72200,
        "stop": 72600,
        "text": " Pops up on your system, and then they can investigate that,"
      },
      {
        "start": 72600,
        "stop": 73000,
        "text": " and take a look at it, and ideally what you'd want is to have some plausibly secret data,"
      },
      {
        "start": 73000,
        "stop": 73400,
        "text": " you know, whatever, something that's not going to get you killed, but maybe is, you know,"
      },
      {
        "start": 73400,
        "stop": 73800,
        "text": " slightly clandestine, or looks like something you might want to do. So if they came across this"
      },
      {
        "start": 73800,
        "stop": 74200,
        "text": " that you've revealed, it looks like the legitimate stash you're looking for. So like, if you're trying to hide your"
      },
      {
        "start": 74200,
        "stop": 74600,
        "text": " Bitcoin, throw some sats in there. Yeah, you got a smaller Bitcoin wallet. Yeah, yeah, okay."
      },
      {
        "start": 74600,
        "stop": 75000,
        "text": " Now he's just poor, okay. But I actually have another Shufflecake"
      },
      {
        "start": 75000,
        "stop": 75400,
        "text": " volume that's even more hidden. Exactly, and you can keep doing that. I think right now it supports"
      },
      {
        "start": 75400,
        "stop": 75800,
        "text": " up to 15 or so, and they're very cautious in the paper to not recommend"
      },
      {
        "start": 75800,
        "stop": 76200,
        "text": " any certain amount. They just recommend that you have more than a couple. Okay."
      },
      {
        "start": 76200,
        "stop": 76600,
        "text": " You know, mostly because it's all public and open source, so if they pick a recommendation, that's what"
      },
      {
        "start": 76600,
        "stop": 77000,
        "text": " adversaries will begin to expect, etc. Yeah. But yeah, the idea is you can have"
      },
      {
        "start": 77000,
        "stop": 77400,
        "text": " multiple levels, and that the adversary"
      },
      {
        "start": 77400,
        "stop": 77800,
        "text": " can't prove without knowing all of the keys how many there are."
      },
      {
        "start": 77800,
        "stop": 78200,
        "text": " So you could have, like, documents, you could have finances,"
      },
      {
        "start": 78200,
        "stop": 78600,
        "text": " you could have multiple different volumes that you are using to store this stuff."
      },
      {
        "start": 78600,
        "stop": 79000,
        "text": " You could even do some organization, and none of this is"
      },
      {
        "start": 79000,
        "stop": 79400,
        "text": " visible. How is that achieved? How does it hide it on the file system so"
      },
      {
        "start": 79400,
        "stop": 79800,
        "text": " that none of it is visible? Yeah, okay, so you have to first create"
      },
      {
        "start": 79800,
        "stop": 80200,
        "text": " your volumes, and so you give it a device that you're going to do, and Shufflecake"
      },
      {
        "start": 80200,
        "stop": 80600,
        "text": " writes a whole bunch of random data to that, as you might expect. And then its basic"
      },
      {
        "start": 80600,
        "stop": 81000,
        "text": " technique is it allocates space for each of the volumes, and you give it, when you make your"
      },
      {
        "start": 81000,
        "stop": 81400,
        "text": " volumes, you run this create vol command, and you have to tell it how many you're going to do,"
      },
      {
        "start": 81400,
        "stop": 81800,
        "text": " and you do that by giving it a certain number of passwords, which is like the unique key, right, for"
      },
      {
        "start": 81800,
        "stop": 82200,
        "text": " each, to unlock each of the volumes. So maybe I'm going to do five, I've got to put it, I've got to tell it"
      },
      {
        "start": 82200,
        "stop": 82600,
        "text": " create some volumes, here's the device I want you to use for that, and here are the"
      },
      {
        "start": 82600,
        "stop": 83000,
        "text": " passwords for all of the volumes I want to create. So it's just like a long list of stuff. Yep."
      },
      {
        "start": 83000,
        "stop": 83400,
        "text": " And then it's going to wipe that drive, and then start setting things up, and it"
      },
      {
        "start": 83400,
        "stop": 83800,
        "text": " allocates space for each volume as encrypted slices"
      },
      {
        "start": 83800,
        "stop": 84200,
        "text": " at random positions on the underlying device."
      },
      {
        "start": 84200,
        "stop": 84600,
        "text": " Wow, so it is taking over the whole device. Yeah, it wipes the whole device,"
      },
      {
        "start": 84600,
        "stop": 85000,
        "text": " now that could be just a partition or something, right, but whatever device at the logical"
      },
      {
        "start": 85000,
        "stop": 85400,
        "text": " level from the kernel that it sees, it wipes that first, you can ask it not to, if you want,"
      },
      {
        "start": 85400,
        "stop": 85800,
        "text": " but by default it'll wipe it. You can pre-wipe it if you've got your own wiping constraints"
      },
      {
        "start": 85800,
        "stop": 86200,
        "text": " or, you know, whatever. Okay. Slices are allocated dynamically, so as soon as the kernel module"
      },
      {
        "start": 86200,
        "stop": 86600,
        "text": " decides that you need more space, it's going to go make some more slices for you. But that's"
      },
      {
        "start": 86600,
        "stop": 87000,
        "text": " where the whole shuffle cake sort of thing is, right, it's not just volumes laid out"
      },
      {
        "start": 87000,
        "stop": 87400,
        "text": " sequentially, each of the different volumes, and again, you can't know"
      },
      {
        "start": 87400,
        "stop": 87800,
        "text": " ahead of time how many there are, are all interspersed on the same storage"
      },
      {
        "start": 87800,
        "stop": 88200,
        "text": " device. I see. Okay. I did a little test, I set up a volume,"
      },
      {
        "start": 88200,
        "stop": 88600,
        "text": " well I set up a couple volumes, copied the file,"
      },
      {
        "start": 88600,
        "stop": 89000,
        "text": " and I did this all with just like a loopback file, you know, you could do it with a USB drive, or an"
      },
      {
        "start": 89000,
        "stop": 89400,
        "text": " external storage, or an internal hard disk, or, you know, anything that shows up as a device"
      },
      {
        "start": 89400,
        "stop": 89800,
        "text": " to the kernel. I copied this file, mounted all the stuff again,"
      },
      {
        "start": 89800,
        "stop": 90200,
        "text": " modified just one character in a text file on one of the volumes, and then"
      },
      {
        "start": 90200,
        "stop": 90600,
        "text": " took a look and used some tools to do like a binary diff on the two files. Okay."
      },
      {
        "start": 90600,
        "stop": 91000,
        "text": " And yeah, like you'd expect, again, this is not like, I'm no cryptographer, but just trying"
      },
      {
        "start": 91000,
        "stop": 91400,
        "text": " to see like from a casual observer, like what does this look like? And a whole bunch"
      },
      {
        "start": 91400,
        "stop": 91800,
        "text": " of that file has changed, right, like it's not, it's pretty hard, they"
      },
      {
        "start": 91800,
        "stop": 92200,
        "text": " talk about being-- So you really couldn't pull much out of that. Right, yeah."
      },
      {
        "start": 92200,
        "stop": 92600,
        "text": " They talk about different methods in the paper, you have"
      },
      {
        "start": 92600,
        "stop": 93000,
        "text": " security versus single snapshots, where an adversary just gets a single snapshot"
      },
      {
        "start": 93000,
        "stop": 93400,
        "text": " of your data, and how that's different than if your adversary can see changing data, so"
      },
      {
        "start": 93400,
        "stop": 93800,
        "text": " that'd be multiple snapshots, right, where they can sort of see like, oh, here's the encrypted drive now,"
      },
      {
        "start": 93800,
        "stop": 94200,
        "text": " I look at the encrypted drive later, Shovel Kick doesn't quite defend"
      },
      {
        "start": 94200,
        "stop": 94600,
        "text": " against multiple snapshots yet, but they have some ideas in the paper about how that could"
      },
      {
        "start": 94600,
        "stop": 95000,
        "text": " happen, which is why I was curious about how does it look if you can see the file changing?"
      },
      {
        "start": 95000,
        "stop": 95400,
        "text": " So the, again, I gotta under, I gotta just underline, it is a little unstable, some"
      },
      {
        "start": 95400,
        "stop": 95800,
        "text": " folks are having issues, so I just decided to reboot the box, so I just kicked everybody out. Yeah, do let us know,"
      },
      {
        "start": 95800,
        "stop": 96200,
        "text": " we have had the kernel panic a couple times with this module, so... But that just"
      },
      {
        "start": 96200,
        "stop": 96600,
        "text": " adds to the security, Wes. It sure does, yeah. My box is not highly available, so..."
      },
      {
        "start": 96600,
        "stop": 97000,
        "text": " Right, and every time it reboots, they gotta log back in, so they need your credentials, so if you"
      },
      {
        "start": 97000,
        "stop": 97400,
        "text": " like layered this stuff and you did some volume encryption on top of that, you know,"
      },
      {
        "start": 97400,
        "stop": 97800,
        "text": " maybe a BIOS password. I was thinking it'd be kind of fun, this isn't"
      },
      {
        "start": 97800,
        "stop": 98200,
        "text": " built into Shovel Kick, but because it's just like, it's super"
      },
      {
        "start": 98200,
        "stop": 98600,
        "text": " easy to build, like you don't need a bunch of dependencies, it's, you know, you need your headers for your kernel if you're"
      },
      {
        "start": 98600,
        "stop": 99000,
        "text": " going to build the module. Yes. But the userland stuff, I think it's just a simple little C program"
      },
      {
        "start": 99000,
        "stop": 99400,
        "text": " calling into it, so you just, you know, as long as you got Make installed, you can"
      },
      {
        "start": 99400,
        "stop": 99800,
        "text": " go ahead and use it, which it means in the sort of classic Unix-y style, and it's just"
      },
      {
        "start": 99800,
        "stop": 100200,
        "text": " using device mapper in the kernel side, you can layer it on"
      },
      {
        "start": 100200,
        "stop": 100600,
        "text": " stuff. So I was thinking you could maybe, if you had like a USB drive,"
      },
      {
        "start": 100600,
        "stop": 101000,
        "text": " you know, you just dump like an ISO on there or something that doesn't take up the whole of your USB drive,"
      },
      {
        "start": 101000,
        "stop": 101400,
        "text": " and then use the kernel's ability, like if you use"
      },
      {
        "start": 101400,
        "stop": 101800,
        "text": " LO set up, loopback set up, you know, for making a loop device,"
      },
      {
        "start": 101800,
        "stop": 102200,
        "text": " you can give it an offset, and say like, \"Hey, of the underlying storage,"
      },
      {
        "start": 102200,
        "stop": 102600,
        "text": " don't start this device until you get to this"
      },
      {
        "start": 102600,
        "stop": 103000,
        "text": " byte offset.\" So you could just take some of the unused space at like the end of the drive,"
      },
      {
        "start": 103000,
        "stop": 103400,
        "text": " and stick some of your Shufflecake there. If you wanted that, again,"
      },
      {
        "start": 103400,
        "stop": 103800,
        "text": " Shufflecake's targeting implausible deniability, where you, they know that you have an encrypted thing, but if you"
      },
      {
        "start": 103800,
        "stop": 104200,
        "text": " want to add just a fun layer of obscurity, the kernel's got some, you know, got some"
      },
      {
        "start": 104200,
        "stop": 104600,
        "text": " stuff you could use. And if you, so, you know, perfect example, right, would be"
      },
      {
        "start": 104600,
        "stop": 105000,
        "text": " a Ventoy kind of thing. And then you have just a little bit of extra free space"
      },
      {
        "start": 105000,
        "stop": 105400,
        "text": " on there that you dedicate to Shufflecake. Right, and you've got lots of distracting stuff on there. Yeah."
      },
      {
        "start": 105400,
        "stop": 105800,
        "text": " I mean, you could even use it legitimately for Ventoy. Yeah, as long as you don't change"
      },
      {
        "start": 105800,
        "stop": 106200,
        "text": " the partition sizes or whatever, right? And it just also happens to have your"
      },
      {
        "start": 106200,
        "stop": 106600,
        "text": " super secret volume on there. Operationally, there's some things to be aware of, because you can't"
      },
      {
        "start": 106600,
        "stop": 107000,
        "text": " prove ahead of time how many different"
      },
      {
        "start": 107000,
        "stop": 107400,
        "text": " volumes are on there. It can't know how much space is allocated to"
      },
      {
        "start": 107400,
        "stop": 107800,
        "text": " that. And so, the way it works operationally is you can, as"
      },
      {
        "start": 107800,
        "stop": 108200,
        "text": " you go to more secret keys, so like if I want to unlock the first volume, I just need, I put"
      },
      {
        "start": 108200,
        "stop": 108600,
        "text": " in one password, that gets me that. If I want to unlock, say, like the third"
      },
      {
        "start": 108600,
        "stop": 109000,
        "text": " volume down, I just put in one password, which is the password for that. But"
      },
      {
        "start": 109000,
        "stop": 109400,
        "text": " it unlocks all of the earlier volumes."
      },
      {
        "start": 109400,
        "stop": 109800,
        "text": " So that the encrypted header of each of the previous volumes contains, or of the"
      },
      {
        "start": 109800,
        "stop": 110200,
        "text": " next volume contains the password for the previous volume. And that's because the only really"
      },
      {
        "start": 110200,
        "stop": 110600,
        "text": " robust way to, like if you want to, if you're going to be making a bunch of changes"
      },
      {
        "start": 110600,
        "stop": 111000,
        "text": " or adding new files or stuff, you always want to mount all of the volumes"
      },
      {
        "start": 111000,
        "stop": 111400,
        "text": " because that's the only way it can properly account for all of the space that's used. That makes sense. Otherwise"
      },
      {
        "start": 111400,
        "stop": 111800,
        "text": " you can risk corrupting it. So if you are going to use this and you're worried that adversaries"
      },
      {
        "start": 111800,
        "stop": 112200,
        "text": " might start messing with it, as with everything, have backups of your"
      },
      {
        "start": 112200,
        "stop": 112600,
        "text": " actual trust and secret stuff. Yeah, this really seems like it has potential"
      },
      {
        "start": 112600,
        "stop": 113000,
        "text": " though. I think it needs a community. It needs packaged. It needs"
      },
      {
        "start": 113000,
        "stop": 113400,
        "text": " to be just a, you know, app git, shuffle cake away."
      },
      {
        "start": 113400,
        "stop": 113800,
        "text": " Yeah, really right now, it started as like some research and then"
      },
      {
        "start": 113800,
        "stop": 114200,
        "text": " some folks at Kudolsky Security took the next step to sort of package that up, get a"
      },
      {
        "start": 114200,
        "stop": 114600,
        "text": " working prototype out there, but that's it, right? That's where we're at."
      },
      {
        "start": 114600,
        "stop": 115000,
        "text": " Once people start packaging it, making it easy to use, getting it updated for modern kernels, and"
      },
      {
        "start": 115000,
        "stop": 115400,
        "text": " perhaps building some tooling around it. It could. I've been sad since"
      },
      {
        "start": 115400,
        "stop": 115800,
        "text": " TrueCrypt faded and VeraCrypt doesn't seem to really have the faith of"
      },
      {
        "start": 115800,
        "stop": 116200,
        "text": " the community. Something like this comes along. It's free software. It's built specifically"
      },
      {
        "start": 116200,
        "stop": 116600,
        "text": " for us Linux users. There's a lot to like here. It doesn't have a GUI tool yet."
      },
      {
        "start": 116600,
        "stop": 117000,
        "text": " Another note, one thing about the TrueCrypt/Veracrypt model is you had to have"
      },
      {
        "start": 117000,
        "stop": 117400,
        "text": " a specific type of partition setup to make the hidden volume."
      },
      {
        "start": 117400,
        "stop": 117800,
        "text": " That's not true of ShuffleCake. ShuffleCake's also much faster."
      },
      {
        "start": 117800,
        "stop": 118200,
        "text": " At least in their testing, the I/O slowdown, it's basically like"
      },
      {
        "start": 118200,
        "stop": 118600,
        "text": " half the speed compared to a normal LUX encrypted disk, but you get all this"
      },
      {
        "start": 118600,
        "stop": 119000,
        "text": " plausible-to-diability stuff built in, and it only wastes about 1%"
      },
      {
        "start": 119000,
        "stop": 119400,
        "text": " of the available disk space. That's alright. Totally worth it. And also"
      },
      {
        "start": 119400,
        "stop": 119800,
        "text": " it doesn't feel like this negates the use of LUX, right? The two"
      },
      {
        "start": 119800,
        "stop": 120200,
        "text": " could easily be used together. In fact, LUX could even be the forward-facing"
      },
      {
        "start": 120200,
        "stop": 120600,
        "text": " encryption you have to protect yourself, and ShuffleCake's actually how you hide stuff."
      },
      {
        "start": 120600,
        "stop": 121000,
        "text": " Yeah, totally. If you want to be really sneaky. Layers and layers. Alright, so the host is back up."
      },
      {
        "start": 121000,
        "stop": 121400,
        "text": " StarTrek.sexy is running, and the race is on, so let us know in the matrix room"
      },
      {
        "start": 121400,
        "stop": 121800,
        "text": " if anybody manages to find our secrets."
      },
      {
        "start": 121800,
        "stop": 122200,
        "text": " linode.com/unplugged. That's where you go to get $100"
      },
      {
        "start": 122200,
        "stop": 122600,
        "text": " in 60-day credit, and it's a great way to just support the show while you're"
      },
      {
        "start": 122600,
        "stop": 123000,
        "text": " trying out something really solid. You guys know that Linode's been around"
      },
      {
        "start": 123000,
        "stop": 123400,
        "text": " for a little while now, and there's a reason. Our audience loves Linode, and we do"
      },
      {
        "start": 123400,
        "stop": 123800,
        "text": " as well. I think you guys know that we use Linode for everything we've built in the last few years."
      },
      {
        "start": 123800,
        "stop": 124200,
        "text": " But even today, the show today, we're hosting a"
      },
      {
        "start": 124200,
        "stop": 124600,
        "text": " live login session on Linode with"
      },
      {
        "start": 124600,
        "stop": 125000,
        "text": " potentially hundreds of people? I mean, you never really know, right?"
      },
      {
        "start": 125000,
        "stop": 125400,
        "text": " Like, recently we did the Deep Fusion stuff, and had"
      },
      {
        "start": 125400,
        "stop": 125800,
        "text": " a ton of people generating images in real time. In the past, we've had people login"
      },
      {
        "start": 125800,
        "stop": 126200,
        "text": " and find intentional vulnerabilities that we've left in Docker, because you can"
      },
      {
        "start": 126200,
        "stop": 126600,
        "text": " also use Linode as a learning place, as a playground."
      },
      {
        "start": 126600,
        "stop": 127000,
        "text": " And that's a great way to spend that $100 credit. You can then"
      },
      {
        "start": 127000,
        "stop": 127400,
        "text": " go from playing around to deploying in production. And they have"
      },
      {
        "start": 127400,
        "stop": 127800,
        "text": " really fast rigs. That's one of the things that we rely on when we just open it up to the"
      },
      {
        "start": 127800,
        "stop": 128200,
        "text": " livestream. We need to have a name, like Live Bash or something, some"
      },
      {
        "start": 128200,
        "stop": 128600,
        "text": " kind of name for it. Because it's like you're opening up the floodgates."
      },
      {
        "start": 128600,
        "stop": 129000,
        "text": " It's fast, it's reliable, it always holds up for us. I think you're going to love it for your next"
      },
      {
        "start": 129000,
        "stop": 129400,
        "text": " project. And Linode's been rolling out upgrades for a while. Recently, they"
      },
      {
        "start": 129400,
        "stop": 129800,
        "text": " upgraded our machines to MVME storage. Woo! And Linode's turning up"
      },
      {
        "start": 129800,
        "stop": 130200,
        "text": " past 11. They have 11 data centers now, but they're going to have a dozen new Linode data"
      },
      {
        "start": 130200,
        "stop": 130600,
        "text": " centers across North America, APAC, WATAM, that's what they call it."
      },
      {
        "start": 130600,
        "stop": 131000,
        "text": " And Europe, of course. Don't worry, Europe, yes, you too."
      },
      {
        "start": 131000,
        "stop": 131400,
        "text": " It's all coming by the end of 2023. So they're just adding more capacity, more"
      },
      {
        "start": 131400,
        "stop": 131800,
        "text": " options. And if you're a performance hound, I think you're going to love it."
      },
      {
        "start": 131800,
        "stop": 132200,
        "text": " But if you're also a price hound, is that the right term? If you're value"
      },
      {
        "start": 132200,
        "stop": 132600,
        "text": " conscious, is that how I should say it? You'll love Linode too. 30-50%"
      },
      {
        "start": 132600,
        "stop": 133000,
        "text": " cheaper than the hyperscalers out there. Linode's been in it for the long haul. It's not a fly-by"
      },
      {
        "start": 133000,
        "stop": 133400,
        "text": " night that's doing a race to the bottom and they're not trying to nickel and dime you with upsells and crazy"
      },
      {
        "start": 133400,
        "stop": 133800,
        "text": " terms and lock-in. It's just a really great mix of support,"
      },
      {
        "start": 133800,
        "stop": 134200,
        "text": " performance, price, and for us Linux users, some real options that we'll"
      },
      {
        "start": 134200,
        "stop": 134600,
        "text": " appreciate. So go try it out. See why they're the best and support the show."
      },
      {
        "start": 134600,
        "stop": 135000,
        "text": " Linode.com/unplugged. One more time, go support the show."
      },
      {
        "start": 135000,
        "stop": 135400,
        "text": " Linode.com/unplugged."
      },
      {
        "start": 135400,
        "stop": 135800,
        "text": " Well, we do have a spot of housekeeping. We didn't clean up around here last week."
      },
      {
        "start": 135800,
        "stop": 136200,
        "text": " So we wanted to do something just to make it like a little bit livable."
      },
      {
        "start": 136200,
        "stop": 136600,
        "text": " And my buddy Alex from Self Hosted is going to be at"
      },
      {
        "start": 136600,
        "stop": 137000,
        "text": " AWS Reinvent in Vegas. The week"
      },
      {
        "start": 137000,
        "stop": 137400,
        "text": " after Thanksgiving, so that's next week. And he's"
      },
      {
        "start": 137400,
        "stop": 137800,
        "text": " you know, looking to say hi. So go say hi to Alex if you're going to be at AWS Reinvent."
      },
      {
        "start": 137800,
        "stop": 138200,
        "text": " You could probably track him down in the matrix room. We have"
      },
      {
        "start": 138200,
        "stop": 138600,
        "text": " a bit.ly/westcoastcrew room that you could join."
      },
      {
        "start": 138600,
        "stop": 139000,
        "text": " Just ping him in there and let him know if you're going to be at AWS Reinvent."
      },
      {
        "start": 139000,
        "stop": 139400,
        "text": " I assume you'll just find him at the poker table. You know Alex, he's going to go out and take some pictures."
      },
      {
        "start": 139400,
        "stop": 139800,
        "text": " That's what he's going to do. Yeah. You'd be at the poker table. Alex is out taking pictures."
      },
      {
        "start": 139800,
        "stop": 140200,
        "text": " And then you two just, you know, betrayed off. I could see that."
      },
      {
        "start": 140200,
        "stop": 140600,
        "text": " I could definitely see that. So definitely go say hi to Alex. That's really fun. I didn't"
      },
      {
        "start": 140600,
        "stop": 141000,
        "text": " I didn't really even realize AWS Reinvent was coming up."
      },
      {
        "start": 141000,
        "stop": 141400,
        "text": " And I'm thinking Vegas in late November could actually"
      },
      {
        "start": 141400,
        "stop": 141800,
        "text": " be quite pleasant."
      },
      {
        "start": 141800,
        "stop": 142200,
        "text": " I support this. Check it out. And again, bit.ly/westcoastcrew."
      },
      {
        "start": 142200,
        "stop": 142800,
        "text": " For the dedicated matrix chatroom for folks on the west coast that are trying to meet up."
      },
      {
        "start": 142800,
        "stop": 143200,
        "text": " Now let's do some baller boosts as we like to do in this here segment."
      },
      {
        "start": 143200,
        "stop": 143600,
        "text": " And very appropriately, our baller boost comes in from our very own"
      },
      {
        "start": 143600,
        "stop": 144000,
        "text": " John A. with, ready for this boys, are you ready for this one?"
      },
      {
        "start": 144000,
        "stop": 144600,
        "text": " 299,998 sets."
      },
      {
        "start": 144600,
        "stop": 145000,
        "text": " Hey, John! Stop!"
      },
      {
        "start": 145000,
        "stop": 145400,
        "text": " A true baller over there. John writes, this is a shameless bribe to put you all in"
      },
      {
        "start": 145400,
        "stop": 145800,
        "text": " a pleasant disposition towards me when I visit in person this week."
      },
      {
        "start": 145800,
        "stop": 146200,
        "text": " Well, you didn't need that. You brought us delicious beverages."
      },
      {
        "start": 146200,
        "stop": 146600,
        "text": " Well, you know, John, when you showed up, I didn't expect the beverages because of the boost."
      },
      {
        "start": 146600,
        "stop": 147000,
        "text": " Yeah, I wanted the digital version of, you know, walking into the club, slinging the"
      },
      {
        "start": 147000,
        "stop": 147400,
        "text": " Benjamin's, but I didn't actually have any hundred dollar bills. Satoshi's was all I could afford."
      },
      {
        "start": 147400,
        "stop": 147800,
        "text": " It's easier to acquire. You don't have to go to the bank. You know, the good news is they're on sale right now, too."
      },
      {
        "start": 147800,
        "stop": 148200,
        "text": " So 299 sets is a better deal than it's going to be in a couple of years."
      },
      {
        "start": 148200,
        "stop": 148600,
        "text": " Thank you, sir. That is a fantastic boost. So John, is this"
      },
      {
        "start": 148600,
        "stop": 149000,
        "text": " the only show you boost? Do you boost other podcasts at this point?"
      },
      {
        "start": 149000,
        "stop": 149400,
        "text": " So I've been boosting pretty much all of the JB"
      },
      {
        "start": 149400,
        "stop": 149800,
        "text": " shows, at least with the streaming"
      },
      {
        "start": 149800,
        "stop": 150200,
        "text": " sets, and pretty much any of them, since I've been listening to all"
      },
      {
        "start": 150200,
        "stop": 150600,
        "text": " in Cast-O-Matic, any of them that accept them, I'm"
      },
      {
        "start": 150600,
        "stop": 151000,
        "text": " streaming that way. That's fantastic. I love it."
      },
      {
        "start": 151000,
        "stop": 151400,
        "text": " It is right now the perfect time to really get people on board."
      },
      {
        "start": 151400,
        "stop": 151800,
        "text": " And our baller boosters, not only do they kind of, you know, come in with some"
      },
      {
        "start": 151800,
        "stop": 152200,
        "text": " fantastic support, but like I've mentioned before, the help and the rankings on the"
      },
      {
        "start": 152200,
        "stop": 152600,
        "text": " podcast charts, too. And that's really something, too, because if you're a"
      },
      {
        "start": 152600,
        "stop": 153000,
        "text": " Cast-O-Matic or a Fountain or a Podverse user and you see somebody's getting"
      },
      {
        "start": 153000,
        "stop": 153400,
        "text": " 299,000 sets, well, they must be doing something right, right?"
      },
      {
        "start": 153400,
        "stop": 153800,
        "text": " And people find the shows because of that, so that's fantastic."
      },
      {
        "start": 153800,
        "stop": 154200,
        "text": " Night62 boosted it with 20,000 sets."
      },
      {
        "start": 154200,
        "stop": 154600,
        "text": " Keep the change, you filthy animal. Alright, here we go, boys. So we gotta"
      },
      {
        "start": 154600,
        "stop": 155000,
        "text": " do some legislation here. I don't know, we gotta call for a quorum"
      },
      {
        "start": 155000,
        "stop": 155400,
        "text": " or something."
      },
      {
        "start": 155400,
        "stop": 155800,
        "text": " Wes, will you read this one so I don't accidentally mispronounce it?"
      },
      {
        "start": 155800,
        "stop": 156200,
        "text": " The words, the file format spelled G-I-F."
      },
      {
        "start": 156200,
        "stop": 156600,
        "text": " Oh my god, I thought you would nail this. It's pronounced"
      },
      {
        "start": 156600,
        "stop": 157000,
        "text": " with a soft G like GIF. You got it, good job. Alright,"
      },
      {
        "start": 157000,
        "stop": 157400,
        "text": " so, okay. GIF. Not GIF. GIF."
      },
      {
        "start": 157400,
        "stop": 157800,
        "text": " This is what, this is the position that Night62 is laying out. Night's is throwing"
      },
      {
        "start": 157800,
        "stop": 158200,
        "text": " 20,000 sets behind this, right. GIF. That's because"
      },
      {
        "start": 158200,
        "stop": 158600,
        "text": " choosy programmers choose GIF."
      },
      {
        "start": 158600,
        "stop": 159000,
        "text": " Wait a minute. Okay, so GIF is"
      },
      {
        "start": 159000,
        "stop": 159400,
        "text": " the peanut butter? According to Night's who's done"
      },
      {
        "start": 159400,
        "stop": 159800,
        "text": " the research here, in the specifications the team wrote that, quote, choosy programmers"
      },
      {
        "start": 159800,
        "stop": 160200,
        "text": " choose GIF. Oh, so he's coming at us with like the"
      },
      {
        "start": 160200,
        "stop": 160600,
        "text": " original spec. And then follows up with, lots of people spell their kids' names in a weird way"
      },
      {
        "start": 160600,
        "stop": 161000,
        "text": " but we learned to pronounce it the way their parents intended. Can we just put this"
      },
      {
        "start": 161000,
        "stop": 161400,
        "text": " argument to rest? Alright, well, we could, but then CB comes in with"
      },
      {
        "start": 161400,
        "stop": 161800,
        "text": " 33,333 sets."
      },
      {
        "start": 162000,
        "stop": 162400,
        "text": " And CB's throwing 33,000 sets behind"
      },
      {
        "start": 162400,
        "stop": 162800,
        "text": " a hard G. So that would be GIF. GIF."
      },
      {
        "start": 162800,
        "stop": 163200,
        "text": " So is, no, oh, right, that's the opposite of the, oh my god."
      },
      {
        "start": 163200,
        "stop": 163600,
        "text": " So we have two disagreements. Yeah, CB's coming with what I think is maybe the more popular"
      },
      {
        "start": 163600,
        "stop": 164000,
        "text": " one, just sort of like, in common culture. Or at least on the internet."
      },
      {
        "start": 164000,
        "stop": 164400,
        "text": " Oh my gosh. Oh my gosh. You know how hard this is for a guy like me?"
      },
      {
        "start": 164400,
        "stop": 164800,
        "text": " This is rough. Yeah, right. Pronunciation was never your strong suit. No, no."
      },
      {
        "start": 164800,
        "stop": 165200,
        "text": " I was never good at this. And now. Can I interject something? Yes, John. So"
      },
      {
        "start": 165200,
        "stop": 165600,
        "text": " I am old, but I will tell you the original developer of"
      },
      {
        "start": 165600,
        "stop": 166000,
        "text": " it pronounced it JIF. There's a video you can find out there"
      },
      {
        "start": 166000,
        "stop": 166400,
        "text": " and yeah, in the original spec, in the original developer, they absolutely"
      },
      {
        "start": 166400,
        "stop": 166800,
        "text": " pronounced it JIF. GIF didn't come out till way later. People"
      },
      {
        "start": 166800,
        "stop": 167200,
        "text": " started calling it that. Now it does seem to be more popular, but GIF was the original."
      },
      {
        "start": 167200,
        "stop": 167600,
        "text": " That's fascinating. I think that's where it's an interesting societal question, is sort of like, there's lots"
      },
      {
        "start": 167600,
        "stop": 168000,
        "text": " of times, and I mean, what, in Linux Action News, every other week we're going, trying to find some"
      },
      {
        "start": 168000,
        "stop": 168400,
        "text": " like, did the project say how they want this pronounced? But"
      },
      {
        "start": 168400,
        "stop": 168800,
        "text": " GIFs, GIFs, they're such a, they've become such a part"
      },
      {
        "start": 168800,
        "stop": 169200,
        "text": " of internet culture. It always seems like, is the original team"
      },
      {
        "start": 169200,
        "stop": 169600,
        "text": " still relevant? Maybe they are. I'm not saying they're not, but it seems like a worthwhile question of at some point, you know,"
      },
      {
        "start": 169600,
        "stop": 170000,
        "text": " words change meanings, pronunciations change. Are you throwing, wow, are you"
      },
      {
        "start": 170000,
        "stop": 170400,
        "text": " throwing that at us? You're like, maybe the original team, like that's like, does the Constitution"
      },
      {
        "start": 170400,
        "stop": 170800,
        "text": " still matter? Is what you just dropped on the table? But it's not like the specs getting constantly updated and it's some like, you know,"
      },
      {
        "start": 170800,
        "stop": 171200,
        "text": " it's, it sort of was thrown out there and it's evolved. Yeah, okay."
      },
      {
        "start": 171200,
        "stop": 171600,
        "text": " Alright, okay, alright, okay, but then, okay, so that, CB came"
      },
      {
        "start": 171600,
        "stop": 172000,
        "text": " in with, with 33,000 sats, but then wise Papa John comes"
      },
      {
        "start": 172000,
        "stop": 172400,
        "text": " in with 40,000 sats."
      },
      {
        "start": 172400,
        "stop": 172800,
        "text": " Okay, alright."
      },
      {
        "start": 172800,
        "stop": 173200,
        "text": " R-G is GIF. No, GIF. GIF, right."
      },
      {
        "start": 173200,
        "stop": 173600,
        "text": " [laughter]"
      },
      {
        "start": 173600,
        "stop": 174000,
        "text": " Alright, so is this two now? Okay, so we've been thinking about"
      },
      {
        "start": 174000,
        "stop": 174400,
        "text": " this, and, you know, there's two ways to approach this. It could be total"
      },
      {
        "start": 174400,
        "stop": 174800,
        "text": " sats behind a way to pronounce this as the winner, or it could be highest"
      },
      {
        "start": 174800,
        "stop": 175200,
        "text": " bidder. And the issue with the total sats behind the winner is quite"
      },
      {
        "start": 175200,
        "stop": 175600,
        "text": " simply, that requires that we do the accounting and keep track of this."
      },
      {
        "start": 175600,
        "stop": 176000,
        "text": " And, which I'm not totally opposed to, but we probably should have started that two weeks ago,"
      },
      {
        "start": 176000,
        "stop": 176400,
        "text": " and we did not. So I think we have to go with highest bidder."
      },
      {
        "start": 176400,
        "stop": 176800,
        "text": " I think we have to go with highest bidder wins in this one, which means it's always kind of available"
      },
      {
        "start": 176800,
        "stop": 177200,
        "text": " for a bid, but I think it's going to be settled. Wise Papa"
      },
      {
        "start": 177200,
        "stop": 177600,
        "text": " John also said, \"Matrix can be a little intimidating for new users, and I feel like something"
      },
      {
        "start": 177600,
        "stop": 178000,
        "text": " more akin to mainstream social media, like Mastodon,"
      },
      {
        "start": 178000,
        "stop": 178400,
        "text": " might make audience interaction more approachable for newbies."
      },
      {
        "start": 178400,
        "stop": 178800,
        "text": " It could also be another way to discover old show topics, thinking maybe a post"
      },
      {
        "start": 178800,
        "stop": 179200,
        "text": " for each new episode with comments and whatnot.\""
      },
      {
        "start": 179200,
        "stop": 179600,
        "text": " It does seem like it addresses a little bit of a different, obviously you can have more real-time sort of, you know,"
      },
      {
        "start": 179600,
        "stop": 180000,
        "text": " toots and tweets and that, but Matrix is primarily real-time."
      },
      {
        "start": 180000,
        "stop": 180400,
        "text": " It doesn't have to be, but that's how our community operates, right? Which can be, like, if you don't"
      },
      {
        "start": 180400,
        "stop": 180800,
        "text": " if you just want to casually browse and check out what people have been chatting about, it's not always the best medium."
      },
      {
        "start": 180800,
        "stop": 181200,
        "text": " And, I think we'd all agree, the Matrix experience isn't still like super"
      },
      {
        "start": 181200,
        "stop": 181600,
        "text": " streamlined. There's still some rough edges. That's kind of why we like"
      },
      {
        "start": 181600,
        "stop": 182000,
        "text": " it, but it's also, it is a problem, right Brent?"
      },
      {
        "start": 182000,
        "stop": 182400,
        "text": " Yes. One thing that comes to mind"
      },
      {
        "start": 182400,
        "stop": 182800,
        "text": " initially is when Matrix was first getting popular, there was"
      },
      {
        "start": 182800,
        "stop": 183200,
        "text": " all these bridges. Do you remember how many issues happened"
      },
      {
        "start": 183200,
        "stop": 183600,
        "text": " with the bridges between the various services, which was trying to, like, make it so"
      },
      {
        "start": 183600,
        "stop": 184000,
        "text": " that users who weren't totally committed could still, like, participate in the conversation?"
      },
      {
        "start": 184000,
        "stop": 184400,
        "text": " And part of my question is, like, are we seeing that with Mastodon? Is there, like,"
      },
      {
        "start": 184400,
        "stop": 184800,
        "text": " a Twitter bridge to Mastodon or something like that? Anybody have any feedback"
      },
      {
        "start": 184800,
        "stop": 185200,
        "text": " on that one? I know people cross-post. You know, there's like some cross-post, there's"
      },
      {
        "start": 185200,
        "stop": 185600,
        "text": " various ways to do that. That might kind of solve it while you're transitioning, I suppose."
      },
      {
        "start": 185600,
        "stop": 186000,
        "text": " I have thoughts. You know, I noticed Hector Martin of the Asahi Linux project just announced"
      },
      {
        "start": 186000,
        "stop": 186400,
        "text": " that he's leaving Twitter for the Fediverse. I wonder, guys,"
      },
      {
        "start": 186400,
        "stop": 186800,
        "text": " is that not the way we should talk about this? Is instead of saying, \"I'm"
      },
      {
        "start": 186800,
        "stop": 187200,
        "text": " leaving Twitter for Mastodon,\" maybe it's more like, \"I'm just joining"
      },
      {
        "start": 187200,
        "stop": 187600,
        "text": " the Fediverse,\" which is a lot of different things, really anything activity-pub-based."
      },
      {
        "start": 187600,
        "stop": 188000,
        "text": " Yeah, it does seem like that's part of the value proposition, right? You're not constrained"
      },
      {
        "start": 188000,
        "stop": 188400,
        "text": " to this one implementation. We've already got a nice protocol, which is what"
      },
      {
        "start": 188400,
        "stop": 188800,
        "text": " so many of us were like, \"Why have these walled gardens when"
      },
      {
        "start": 188800,
        "stop": 189200,
        "text": " we can have interoperability?\""
      },
      {
        "start": 189200,
        "stop": 189600,
        "text": " We'll have more to say about Mastodon, but moving on, we have one last baller boost."
      },
      {
        "start": 189600,
        "stop": 190000,
        "text": " This was a banger baller booster, so thank you everybody for the support. Jean Bean came in"
      },
      {
        "start": 190000,
        "stop": 190400,
        "text": " with 60,000 sats."
      },
      {
        "start": 190400,
        "stop": 190800,
        "text": " [music]"
      },
      {
        "start": 190800,
        "stop": 191200,
        "text": " \"Gif is like gift, not a hard G, as that would be spelled in particular to a"
      },
      {
        "start": 191200,
        "stop": 191600,
        "text": " peanut butter.\" So he's throwing 60,000 sats behind"
      },
      {
        "start": 191600,
        "stop": 192000,
        "text": " \"jif.\" Wait, no, I think \"gift,\" right? So \"gif.\""
      },
      {
        "start": 192000,
        "stop": 192400,
        "text": " \"Gif.\" All right, so which one's hard? \"Gif is like gift.\""
      },
      {
        "start": 192400,
        "stop": 192800,
        "text": " I think maybe we've interpreted what hard and soft is the opposite"
      },
      {
        "start": 192800,
        "stop": 193200,
        "text": " of the way Jean Bean did, but the \"gift\" part makes it clear. Okay, you're right."
      },
      {
        "start": 193200,
        "stop": 193600,
        "text": " So thank you, Jean Bean, for making that clarification. So he's thinking \"gift,\" so he's thinking"
      },
      {
        "start": 193600,
        "stop": 194000,
        "text": " \"gif.\" Right now, I think that means \"gift's at the top.\" That's hard to say."
      },
      {
        "start": 194000,
        "stop": 194400,
        "text": " But I think that means if we go by the biggest"
      },
      {
        "start": 194400,
        "stop": 194800,
        "text": " \"Don't look a gif of a gift horse in the mouth.\""
      },
      {
        "start": 194800,
        "stop": 195200,
        "text": " Right, of course. Yeah, the 60,000 sats was a"
      },
      {
        "start": 195200,
        "stop": 195600,
        "text": " \"gift\" horse in the mouth. Now it's definitely in my mouth. But I think"
      },
      {
        "start": 195600,
        "stop": 196000,
        "text": " we have to go by the biggest, the highest bidder, because I just cannot keep track of this"
      },
      {
        "start": 196000,
        "stop": 196400,
        "text": " at this point. I'll fix this in the future. Lesson learned. But right now, and I'm not sure"
      },
      {
        "start": 196400,
        "stop": 196800,
        "text": " I love this, I have to say Jean Bean wins"
      },
      {
        "start": 196800,
        "stop": 197200,
        "text": " and we're gonna say it like the peanut butter. At least for the week."
      },
      {
        "start": 197200,
        "stop": 197600,
        "text": " Wait, I think, but no, but Jean Bean's endorsing"
      },
      {
        "start": 197600,
        "stop": 198000,
        "text": " \"gift.\" Okay, all right. So you don't have"
      },
      {
        "start": 198000,
        "stop": 198400,
        "text": " to say \"gift.\" Okay, so I'm gonna say \"jif.\" Is that what I'm saying or am I saying"
      },
      {
        "start": 198400,
        "stop": 198800,
        "text": " \"gift?\" You're saying \"gift.\" Okay, I'm gonna say \"gift.\" If Jean Bean wins, you're saying"
      },
      {
        "start": 198800,
        "stop": 199200,
        "text": " \"gift.\" I just need somebody to show up and tell me what to say. So I'm saying"
      },
      {
        "start": 199200,
        "stop": 199600,
        "text": " \"gift.\" All right. It's gonna stay that way unless somebody can"
      },
      {
        "start": 199600,
        "stop": 200000,
        "text": " beat 60,000 sats. I'm sticking with \"gift.\" I'm gonna write it down on a sticky note and I'm saying \"gift.\""
      },
      {
        "start": 200000,
        "stop": 200400,
        "text": " Next up, we decide how to pronounce that popular GTK desktop."
      },
      {
        "start": 200400,
        "stop": 200800,
        "text": " Oh, man."
      },
      {
        "start": 200800,
        "stop": 201200,
        "text": " You know what? Can I just say? I'm willing to throw 20,000 sats"
      },
      {
        "start": 201200,
        "stop": 201600,
        "text": " behind \"Nome.\" Is that right? Yeah, I am. I will put 20,000 sats"
      },
      {
        "start": 201600,
        "stop": 202000,
        "text": " behind \"Nome.\" I guess we'll find out next week. I try to say \"g'Nome\""
      },
      {
        "start": 202000,
        "stop": 202400,
        "text": " I'm gonna do it. Set a reminder"
      },
      {
        "start": 202400,
        "stop": 202800,
        "text": " in three hours to boost into the show about"
      },
      {
        "start": 202800,
        "stop": 203200,
        "text": " what is it? How to pronounce \"g'Nome.\""
      },
      {
        "start": 203200,
        "stop": 203600,
        "text": " [Laughter]"
      },
      {
        "start": 203600,
        "stop": 204000,
        "text": " I can't believe I forgot about that."
      },
      {
        "start": 204000,
        "stop": 204400,
        "text": " You probably don't remember how to pronounce"
      },
      {
        "start": 204400,
        "stop": 204800,
        "text": " the animated image, do you? No, I do now. I'm going with \"gift.\""
      },
      {
        "start": 204800,
        "stop": 205200,
        "text": " I can remember \"gift\" because it's holidays. So if I just gotta do... I think that's the trick."
      },
      {
        "start": 205200,
        "stop": 205600,
        "text": " You gotta do association. All right. Set a reminder for tomorrow"
      },
      {
        "start": 205600,
        "stop": 206000,
        "text": " at 9 a.m. to send a boost into Unplugged about \"Nomes.\""
      },
      {
        "start": 206000,
        "stop": 206400,
        "text": " There we go. That's how I'm gonna remember. You see? That's how I'll do it."
      },
      {
        "start": 206400,
        "stop": 206800,
        "text": " All right. Thank you very much, everybody. The ballers out there."
      },
      {
        "start": 206800,
        "stop": 207200,
        "text": " We really appreciate you. Not everybody is able to join us in studio, but"
      },
      {
        "start": 207200,
        "stop": 207600,
        "text": " there is an open invitation to come out here and join us in studio from time to time. We love that."
      },
      {
        "start": 207600,
        "stop": 208000,
        "text": " And we also appreciate the support. If you'd like to boost into the show, go grab a"
      },
      {
        "start": 208000,
        "stop": 208400,
        "text": " new podcast app at newpodcastapps.com"
      },
      {
        "start": 208400,
        "stop": 208800,
        "text": " [Laughter] Hold on. Late breaking news."
      },
      {
        "start": 208800,
        "stop": 209200,
        "text": " [Music]"
      },
      {
        "start": 209200,
        "stop": 209600,
        "text": " If you could boost in while sitting in studio 28 seconds ago, it is"
      },
      {
        "start": 209600,
        "stop": 210000,
        "text": " J-I-F. All right. Peanut butter."
      },
      {
        "start": 210000,
        "stop": 210400,
        "text": " It is peanut butter time, everybody. All right. There we go. 61,000"
      },
      {
        "start": 210400,
        "stop": 210800,
        "text": " sats behind peanut butter time. We are going with \"jif.\""
      },
      {
        "start": 210800,
        "stop": 211200,
        "text": " Thank you, John. Ooh, I see eight little login sessions for our"
      },
      {
        "start": 211200,
        "stop": 211600,
        "text": " Kirk user right now. Oh, yeah? So folks are hard at work. Good. Good. Good."
      },
      {
        "start": 211600,
        "stop": 212000,
        "text": " Amazing. I can't believe that changed during the show. Before we leave the Baller Boost segment,"
      },
      {
        "start": 212000,
        "stop": 212400,
        "text": " you guys have caught the attention of some other podcasters out there,"
      },
      {
        "start": 212400,
        "stop": 212800,
        "text": " including Guy Swan of the Bitcoin Audible podcast,"
      },
      {
        "start": 212800,
        "stop": 213200,
        "text": " which seems like a really high quality production from what I heard. And"
      },
      {
        "start": 213200,
        "stop": 213600,
        "text": " he's not so happy with some Linux podcast beating him out. Oh, and"
      },
      {
        "start": 213600,
        "stop": 214000,
        "text": " one last thing to point out, actually, is that I'm actually,"
      },
      {
        "start": 214000,
        "stop": 214400,
        "text": " Bitcoin Audible is actually number seven in the fountain,"
      },
      {
        "start": 214400,
        "stop": 214800,
        "text": " fountain.fm hierarchy for, like, the number of boosts and"
      },
      {
        "start": 214800,
        "stop": 215200,
        "text": " listens. But the Linux unplugged guys are literally, like, neck"
      },
      {
        "start": 215200,
        "stop": 215600,
        "text": " and neck. They are, like, right behind me. And I feel like it would be wrong for"
      },
      {
        "start": 215600,
        "stop": 216000,
        "text": " it needs to be a Bitcoin podcast. I want to get Bitcoin Audible to number"
      },
      {
        "start": 216000,
        "stop": 216400,
        "text": " one. So if you use fountain, if you have the fountain app, go over there"
      },
      {
        "start": 216400,
        "stop": 216800,
        "text": " and boost it or clip it or something. Share it out."
      },
      {
        "start": 216800,
        "stop": 217200,
        "text": " Because I think a good Bitcoin podcast needs to be number one up"
      },
      {
        "start": 217200,
        "stop": 217600,
        "text": " there. So jump over there and give me a bump."
      },
      {
        "start": 217600,
        "stop": 218000,
        "text": " I'm just saying, what if Guy looked at the numbers and saw"
      },
      {
        "start": 218000,
        "stop": 218400,
        "text": " a big surprise and Linux Unplugged was crushing it? This is a great opportunity"
      },
      {
        "start": 218400,
        "stop": 218800,
        "text": " because I think we could get some exposure on another podcast, too. So this is"
      },
      {
        "start": 218800,
        "stop": 219200,
        "text": " your chance, audience. Be a baller and let's show"
      },
      {
        "start": 219200,
        "stop": 219600,
        "text": " Guy what the Linux Unplugged audience can do."
      },
      {
        "start": 219600,
        "stop": 220000,
        "text": " All right, so we have several things we've been talking about on the show over the last"
      },
      {
        "start": 220000,
        "stop": 220400,
        "text": " few weeks that we want to follow up on. And we thought we'll buy the audience some time while they're trying to"
      },
      {
        "start": 220400,
        "stop": 220800,
        "text": " hack our box by covering some of these. And we wanted to start"
      },
      {
        "start": 220800,
        "stop": 221200,
        "text": " with our dear, poor friend, Mr. Brintley, who"
      },
      {
        "start": 221200,
        "stop": 221600,
        "text": " has really not been able to move in since we gave him the Dev1. He's been struggling"
      },
      {
        "start": 221600,
        "stop": 222000,
        "text": " with his setup. He's had some never-ending desktop issues."
      },
      {
        "start": 222000,
        "stop": 222400,
        "text": " And I kind of thought, Brent, I wanted to open the floor to you, cover several"
      },
      {
        "start": 222400,
        "stop": 222800,
        "text": " topics. I know you've been looking at different things and trying to find your Linux home."
      },
      {
        "start": 222800,
        "stop": 223200,
        "text": " So tell us, sir, about your journey. Yeah, I would say at this point"
      },
      {
        "start": 223200,
        "stop": 223600,
        "text": " I'm using a desktop that I feel is not serving me that well,"
      },
      {
        "start": 223600,
        "stop": 224000,
        "text": " but I don't know where to go. And this has been a topic"
      },
      {
        "start": 224000,
        "stop": 224400,
        "text": " that I think we've touched on a little bit, maybe throughout the last several weeks."
      },
      {
        "start": 224400,
        "stop": 224800,
        "text": " The Dev1, when did I get that? Like late September now?"
      },
      {
        "start": 224800,
        "stop": 225200,
        "text": " And I just kept the sort of default Pop!OS installation"
      },
      {
        "start": 225200,
        "stop": 225600,
        "text": " on here as a test to myself to try the Gnome"
      },
      {
        "start": 225600,
        "stop": 226000,
        "text": " ecosystem. And I hate to say this, but I think"
      },
      {
        "start": 226000,
        "stop": 226400,
        "text": " I failed at that test, and it's not going well for me. So I'm looking"
      },
      {
        "start": 226400,
        "stop": 226800,
        "text": " for a new place to go. And we've been talking about"
      },
      {
        "start": 226800,
        "stop": 227200,
        "text": " this back and forth, and we haven't really landed on a really solid"
      },
      {
        "start": 227200,
        "stop": 227600,
        "text": " place. Now, some listeners have been pretty amazing. For instance,"
      },
      {
        "start": 227600,
        "stop": 228000,
        "text": " Nev sent in physically a Gen2 thumb drive that"
      },
      {
        "start": 228000,
        "stop": 228400,
        "text": " he suggests that I should get running on this laptop."
      },
      {
        "start": 228400,
        "stop": 228800,
        "text": " So thank you, Nev, for that. And TuxMM last week in Matrix"
      },
      {
        "start": 228800,
        "stop": 229200,
        "text": " suggested that I actually try Debian, which feels like, I don't know,"
      },
      {
        "start": 229200,
        "stop": 229600,
        "text": " maybe the totally opposite direction. Can I just jump in? I've also"
      },
      {
        "start": 229600,
        "stop": 230000,
        "text": " gotten some notes privately. People message me and"
      },
      {
        "start": 230000,
        "stop": 230400,
        "text": " email me and they tell me what you should run. And they've also been suggesting Debian. I've gotten"
      },
      {
        "start": 230400,
        "stop": 230800,
        "text": " several people that have reached out and said, \"Why isn't he just trying Debian? This is like the"
      },
      {
        "start": 230800,
        "stop": 231200,
        "text": " perfect intersection of what Brent needs.\" So I'd be curious,"
      },
      {
        "start": 231200,
        "stop": 231600,
        "text": " Chris, from your perspective then, why you think we're getting so many recommendations for"
      },
      {
        "start": 231600,
        "stop": 232000,
        "text": " Debian for a Brent? You know, it's a"
      },
      {
        "start": 232000,
        "stop": 232400,
        "text": " similar story. I've tried a lot of different stuff. I'm not"
      },
      {
        "start": 232400,
        "stop": 232800,
        "text": " really happy with anything, but if I just go with Debian, it just works."
      },
      {
        "start": 232800,
        "stop": 233200,
        "text": " And I don't need the absolute latest, but I can go with testing if I do,"
      },
      {
        "start": 233200,
        "stop": 233600,
        "text": " and it just seems to be pretty solid. And there's no shenanigans involved. Right, you don't get"
      },
      {
        "start": 233600,
        "stop": 234000,
        "text": " you know, whatever you think of Canonical's projects, that's"
      },
      {
        "start": 234000,
        "stop": 234400,
        "text": " not a layer that you get. There's not a company pushing a direction, good or bad,"
      },
      {
        "start": 234400,
        "stop": 234800,
        "text": " on top of it. You just get this community distro, that's sort of the common base level"
      },
      {
        "start": 234800,
        "stop": 235200,
        "text": " of the Debian universe. That's what I refer to as the strategy tax. Sometimes it's good,"
      },
      {
        "start": 235200,
        "stop": 235600,
        "text": " sometimes it's bad, it's just totally dependent. But there's a strategy tax when you use Ubuntu."
      },
      {
        "start": 235600,
        "stop": 236000,
        "text": " I don't know, I could see something there. For me, it's just not a"
      },
      {
        "start": 236000,
        "stop": 236400,
        "text": " super compelling option. You know, it doesn't really move the needle for me."
      },
      {
        "start": 236400,
        "stop": 236800,
        "text": " Maybe it's too boring, but maybe that's exactly what you want."
      },
      {
        "start": 236800,
        "stop": 237200,
        "text": " Well, I guess my question for you both, and maybe for the audience as well, is"
      },
      {
        "start": 237200,
        "stop": 237600,
        "text": " when's the last time you tried it? I don't"
      },
      {
        "start": 237600,
        "stop": 238000,
        "text": " I don't think I ever have tried for like a real"
      },
      {
        "start": 238000,
        "stop": 238400,
        "text": " test, you know, for more than an hour, a Debian"
      },
      {
        "start": 238400,
        "stop": 238800,
        "text": " install. The closest I came was probably many years ago"
      },
      {
        "start": 238800,
        "stop": 239200,
        "text": " when I think it was Mint desktop"
      },
      {
        "start": 239200,
        "stop": 239600,
        "text": " edition, or sorry, Mint Debian edition, which is the Debian rolling"
      },
      {
        "start": 239600,
        "stop": 240000,
        "text": " base to Mint. And you know, that"
      },
      {
        "start": 240000,
        "stop": 240400,
        "text": " didn't go so well. Mostly because I was tinkering and I broke it all."
      },
      {
        "start": 240400,
        "stop": 240800,
        "text": " But I gotta say, the audience suggesting"
      },
      {
        "start": 240800,
        "stop": 241200,
        "text": " Debian actually feels kind of intriguing."
      },
      {
        "start": 241200,
        "stop": 241600,
        "text": " So I think I might give that a try for a little bit. But I'm worried because"
      },
      {
        "start": 241600,
        "stop": 242000,
        "text": " I feel like what I have in my mind about what Debian is"
      },
      {
        "start": 242000,
        "stop": 242400,
        "text": " stable, which is good, very good, but also quite"
      },
      {
        "start": 242400,
        "stop": 242800,
        "text": " slow releasing. And you know, being a host on maybe a Linux"
      },
      {
        "start": 242800,
        "stop": 243200,
        "text": " podcast that likes to look at new fangled technologies and things, is that"
      },
      {
        "start": 243200,
        "stop": 243600,
        "text": " going to be a problem for me? That's a question I have."
      },
      {
        "start": 243600,
        "stop": 244000,
        "text": " I think, you know, the question there is how much do flatpacks and snaps"
      },
      {
        "start": 244000,
        "stop": 244400,
        "text": " cover you there? Right, are you"
      },
      {
        "start": 244400,
        "stop": 244800,
        "text": " is the stuff that you really rely on and you want the latest features from? Because some of the software you don't care,"
      },
      {
        "start": 244800,
        "stop": 245200,
        "text": " right? Command line utilities, random notes, or whatever. But if it's an app in your"
      },
      {
        "start": 245200,
        "stop": 245600,
        "text": " wheelhouse that you rely on to get your real work done, that you might. Are all of those"
      },
      {
        "start": 245600,
        "stop": 246000,
        "text": " covered in flatpacks? Or side-loading in whatever way you feel comfortable with? And you don't get PPAs."
      },
      {
        "start": 246000,
        "stop": 246400,
        "text": " You know, that's one of the things that makes Ubuntu a little more"
      },
      {
        "start": 246400,
        "stop": 246800,
        "text": " livable is PPAs. And I guess my question for you is"
      },
      {
        "start": 246800,
        "stop": 247200,
        "text": " I'm sure you must have reconsidered just going back to Kubuntu. I have been hesitant"
      },
      {
        "start": 247200,
        "stop": 247600,
        "text": " to say it. I don't know why."
      },
      {
        "start": 247600,
        "stop": 248000,
        "text": " You know, it's like recommending a friend to go buy an Accord. It's like"
      },
      {
        "start": 248000,
        "stop": 248400,
        "text": " a super reliable, very solid car, but like"
      },
      {
        "start": 248400,
        "stop": 248800,
        "text": " there's nothing fun about an Accord, really. Especially if you get the lower end model, right? There's nothing fun about an Accord."
      },
      {
        "start": 248800,
        "stop": 249200,
        "text": " He's more of a Corolla guy. Maybe, or a Corolla, right? Like it's just"
      },
      {
        "start": 249200,
        "stop": 249600,
        "text": " it's a great, solid car that's going to last years, that's going to"
      },
      {
        "start": 249600,
        "stop": 250000,
        "text": " hold its value, that's going to get great gas mileage, it's going to have decent performance,"
      },
      {
        "start": 250000,
        "stop": 250400,
        "text": " it's going to have a lot of great features out of the box, and yet for some reason, I'm not"
      },
      {
        "start": 250400,
        "stop": 250800,
        "text": " buying myself a Corolla or an Accord. There's also that second layer of"
      },
      {
        "start": 250800,
        "stop": 251200,
        "text": " the host thing, you know? Because if you do find"
      },
      {
        "start": 251200,
        "stop": 251600,
        "text": " a distro that just works for you, like Kubuntu is just kind of hitting the sweet spot,"
      },
      {
        "start": 251600,
        "stop": 252000,
        "text": " we probably won't hear about it. It's funny you mention that because I was actually very"
      },
      {
        "start": 252000,
        "stop": 252400,
        "text": " happy with Kubuntu. And the whole, what got me started on this whole"
      },
      {
        "start": 252400,
        "stop": 252800,
        "text": " thought experiment, and therefore suffering at this point, is"
      },
      {
        "start": 252800,
        "stop": 253200,
        "text": " that I did a little bit of beta testing for"
      },
      {
        "start": 253200,
        "stop": 253600,
        "text": " Kubuntu 2204,"
      },
      {
        "start": 253600,
        "stop": 254000,
        "text": " and ran into a whole bunch of things that made me pretty unhappy with that experience."
      },
      {
        "start": 254000,
        "stop": 254400,
        "text": " Many of which are still being looked at and haven't been"
      },
      {
        "start": 254400,
        "stop": 254800,
        "text": " solved, and it just got me wondering, is it"
      },
      {
        "start": 254800,
        "stop": 255200,
        "text": " maybe not the Kubuntu that I came to love for many years and ran and recommended to"
      },
      {
        "start": 255200,
        "stop": 255600,
        "text": " friends and family? So it got me"
      },
      {
        "start": 255600,
        "stop": 256000,
        "text": " really looking elsewhere. And I can't say"
      },
      {
        "start": 256000,
        "stop": 256400,
        "text": " you know, we for the last, what, year now?"
      },
      {
        "start": 256400,
        "stop": 256800,
        "text": " Have been testing things like KD Neon when I was at Alex's place for"
      },
      {
        "start": 256800,
        "stop": 257200,
        "text": " however long, I was there a long time, ran into a bunch of"
      },
      {
        "start": 257200,
        "stop": 257600,
        "text": " issues there. And Fedora, you know,"
      },
      {
        "start": 257600,
        "stop": 258000,
        "text": " our last two tests on Fedora 36 and 37, I was like, oh, maybe this is the one."
      },
      {
        "start": 258000,
        "stop": 258400,
        "text": " And that was a disappointing experience for"
      },
      {
        "start": 258400,
        "stop": 258800,
        "text": " a variety of reasons. Now, this is mostly the Plasma"
      },
      {
        "start": 258800,
        "stop": 259200,
        "text": " experience I'm referring to. But at the same time,"
      },
      {
        "start": 259200,
        "stop": 259600,
        "text": " I just, it got me thinking about a bigger topic,"
      },
      {
        "start": 259600,
        "stop": 260000,
        "text": " which is, well, is it just me who's not very"
      },
      {
        "start": 260000,
        "stop": 260400,
        "text": " happy because I'm learning more and more and more about how Linux works and how the development"
      },
      {
        "start": 260400,
        "stop": 260800,
        "text": " cycles work and how hard it is to make a really"
      },
      {
        "start": 260800,
        "stop": 261200,
        "text": " super solid software experience? Like, making a distribution"
      },
      {
        "start": 261200,
        "stop": 261600,
        "text": " is extremely complex, and I have a ton of empathy. The more I learn about it,"
      },
      {
        "start": 261600,
        "stop": 262000,
        "text": " the more empathy I have with how difficult that is to do perfectly."
      },
      {
        "start": 262000,
        "stop": 262400,
        "text": " And I don't think that's even possible, really, because software is changing constantly."
      },
      {
        "start": 262400,
        "stop": 262800,
        "text": " But there's something about maybe what I've"
      },
      {
        "start": 262800,
        "stop": 263200,
        "text": " seen in the last year that just gets me, I don't know, maybe down"
      },
      {
        "start": 263200,
        "stop": 263600,
        "text": " a little bit about the choices out there, and I want to be wrong about that. So"
      },
      {
        "start": 263600,
        "stop": 264000,
        "text": " I'm open to being excited. You know, no, no, no, no, no,"
      },
      {
        "start": 264000,
        "stop": 264400,
        "text": " you're absolutely, in fact, you're 100% right. And this is something that"
      },
      {
        "start": 264400,
        "stop": 264800,
        "text": " Wes and I had a conversation last week after we wrapped up, and we just kind of realized"
      },
      {
        "start": 264800,
        "stop": 265200,
        "text": " it just sitting here after we disconnected with you, is"
      },
      {
        "start": 265200,
        "stop": 265600,
        "text": " we are watching you take a journey that both"
      },
      {
        "start": 265600,
        "stop": 266000,
        "text": " Wes and I have taken, and that is becoming a hardened, cynical Linux user."
      },
      {
        "start": 266000,
        "stop": 266400,
        "text": " Right? Are we totally? And it's one of these things"
      },
      {
        "start": 266400,
        "stop": 266800,
        "text": " where as you begin to acquire a deeper understanding"
      },
      {
        "start": 266800,
        "stop": 267200,
        "text": " of how the technology works, the communities that are creating these things,"
      },
      {
        "start": 267200,
        "stop": 267600,
        "text": " you begin to switch from \"I feel like something"
      },
      {
        "start": 267600,
        "stop": 268000,
        "text": " should do this\" to \"I understand why it can't do this.\""
      },
      {
        "start": 268000,
        "stop": 268400,
        "text": " And you go from \"How come it doesn't work like this?\""
      },
      {
        "start": 268400,
        "stop": 268800,
        "text": " to \"I'm surprised it does this at all.\" Right?"
      },
      {
        "start": 268800,
        "stop": 269200,
        "text": " And you're in that journey right now of going"
      },
      {
        "start": 269200,
        "stop": 269600,
        "text": " to \"Why doesn't this work like this?\" to \"I'm surprised this"
      },
      {
        "start": 269600,
        "stop": 270000,
        "text": " works at all! This is amazing! Do you know what it takes?\" And unfortunately, it takes"
      },
      {
        "start": 270000,
        "stop": 270400,
        "text": " a lot of constant, hard lessons of what"
      },
      {
        "start": 270400,
        "stop": 270800,
        "text": " works and doesn't work and what doesn't manage to stick around. We should get him"
      },
      {
        "start": 270800,
        "stop": 271200,
        "text": " like a pad for his forehead, you know? Somebody's hitting him on the wall."
      },
      {
        "start": 271200,
        "stop": 271600,
        "text": " Yeah, it's one of those things where like... And you know, I think a lot of folks"
      },
      {
        "start": 271600,
        "stop": 272000,
        "text": " along this path that you're on right now, which is"
      },
      {
        "start": 272000,
        "stop": 272400,
        "text": " you're basically upgrading your knowledge and you're learning about the backend infrastructure and all these different tools"
      },
      {
        "start": 272400,
        "stop": 272800,
        "text": " and this is sometimes where folks that got just"
      },
      {
        "start": 272800,
        "stop": 273200,
        "text": " too much going on, I think bail off of Linux and end up on a Mac"
      },
      {
        "start": 273200,
        "stop": 273600,
        "text": " or god forbid, Windows. And, you know,"
      },
      {
        "start": 273600,
        "stop": 274000,
        "text": " I understand that. It can be frustrating."
      },
      {
        "start": 274000,
        "stop": 274400,
        "text": " Yeah, you sort of threatened me with that idea last week. And I think my heart"
      },
      {
        "start": 274400,
        "stop": 274800,
        "text": " sunk quite a bit. Because actually, that's how I got onto Linux, was using Mac"
      },
      {
        "start": 274800,
        "stop": 275200,
        "text": " and being pretty unhappy and having maybe some similar feelings that I'm"
      },
      {
        "start": 275200,
        "stop": 275600,
        "text": " having right now. And Linux was like extremely exciting"
      },
      {
        "start": 275600,
        "stop": 276000,
        "text": " for all its possibility and how mature it seemed to me"
      },
      {
        "start": 276000,
        "stop": 276400,
        "text": " considering it's, you know, thousands of people just putting"
      },
      {
        "start": 276400,
        "stop": 276800,
        "text": " their ideas together, which is an amazing feat. And"
      },
      {
        "start": 276800,
        "stop": 277200,
        "text": " I think I'm just full of mixed emotions because learning"
      },
      {
        "start": 277200,
        "stop": 277600,
        "text": " about the backend and the communities and all the hard work that"
      },
      {
        "start": 277600,
        "stop": 278000,
        "text": " goes into making a Linux possible, it's like super exciting and amazing."
      },
      {
        "start": 278000,
        "stop": 278400,
        "text": " It's like fascinating to watch all of that progress. But as a user"
      },
      {
        "start": 278400,
        "stop": 278800,
        "text": " sometimes when I just want to get stuff done, it's like, oh gosh, there's this thing that's"
      },
      {
        "start": 278800,
        "stop": 279200,
        "text": " just keeping me from just getting it done. And I don't know,"
      },
      {
        "start": 279200,
        "stop": 279600,
        "text": " those two don't compute. Yeah. I think"
      },
      {
        "start": 279600,
        "stop": 280000,
        "text": " part of what makes Linux work for me, and I don't know, maybe this is true for you too,"
      },
      {
        "start": 280000,
        "stop": 280400,
        "text": " Wes, is like kind of years of hitting that wall"
      },
      {
        "start": 280400,
        "stop": 280800,
        "text": " figuring out what kind of sustainably works and figuring out what doesn't sustainably work. And then just"
      },
      {
        "start": 280800,
        "stop": 281200,
        "text": " kind of, I don't want to say finding a compromise, but like"
      },
      {
        "start": 281200,
        "stop": 281600,
        "text": " finding the logical conclusion of that."
      },
      {
        "start": 281600,
        "stop": 282000,
        "text": " You have a very practical outlook on the Linux desktop, I think."
      },
      {
        "start": 282000,
        "stop": 282400,
        "text": " You have a very practical set of expectations. I'm curious if you want to share a little bit"
      },
      {
        "start": 282400,
        "stop": 282800,
        "text": " of your philosophy on what your expectations are of a Linux desktop."
      },
      {
        "start": 282800,
        "stop": 283200,
        "text": " I mean, I guess you, Tiny in our matrix check, kind of puts it,"
      },
      {
        "start": 283200,
        "stop": 283600,
        "text": " there are no solutions, only trade-offs. And the more time you're in an environment,"
      },
      {
        "start": 283600,
        "stop": 284000,
        "text": " the more it sticks out. And that's just it. You've got to find,"
      },
      {
        "start": 284000,
        "stop": 284400,
        "text": " it's sort of an optimization problem to find the trade-offs that work for you. And some"
      },
      {
        "start": 284400,
        "stop": 284800,
        "text": " people, like Chris, I think you're bothered when you notice"
      },
      {
        "start": 284800,
        "stop": 285200,
        "text": " performance degradation. And I don't love that. I notice it too, but"
      },
      {
        "start": 285200,
        "stop": 285600,
        "text": " to a lesser degree than you. So like my acceptable trade-offs are"
      },
      {
        "start": 285600,
        "stop": 286000,
        "text": " just going to be different in that regard. And I really value having"
      },
      {
        "start": 286000,
        "stop": 286400,
        "text": " the customizability, the ability to just sort of pop under the hood and"
      },
      {
        "start": 286400,
        "stop": 286800,
        "text": " break stuff or change stuff or just override the system for a little bit when I really need to go get this"
      },
      {
        "start": 286800,
        "stop": 287200,
        "text": " weird task done. Some people don't care about that at all and never want to do that."
      },
      {
        "start": 287200,
        "stop": 287600,
        "text": " And so we're just going to be on very different spectrums. And then there's"
      },
      {
        "start": 287600,
        "stop": 288000,
        "text": " a little bit, and I think there's some folks in the community that do this, some folks"
      },
      {
        "start": 288000,
        "stop": 288400,
        "text": " don't want to do that, and where you fall on this decision is a very personal thing."
      },
      {
        "start": 288400,
        "stop": 288800,
        "text": " But how much do you invest, how much do you rely"
      },
      {
        "start": 288800,
        "stop": 289200,
        "text": " on some of the stuff that commercial software and operating systems are better at"
      },
      {
        "start": 289200,
        "stop": 289600,
        "text": " providing? So like, I use Plex,"
      },
      {
        "start": 289600,
        "stop": 290000,
        "text": " I have Plex, I have a share for Plex because there's people in my life that that's their primary way to consume"
      },
      {
        "start": 290000,
        "stop": 290400,
        "text": " stuff. But I, not because I don't value Plex or think that it's useful software, of course"
      },
      {
        "start": 290400,
        "stop": 290800,
        "text": " it is, but I find that if I don't commit to all the things"
      },
      {
        "start": 290800,
        "stop": 291200,
        "text": " that Plex offers, I don't have a lot of problems with Jellyfin. Now if I was using"
      },
      {
        "start": 291200,
        "stop": 291600,
        "text": " Plex all the time and trying to switch that workflow to Jellyfin, I think it would go pretty poorly. But"
      },
      {
        "start": 291600,
        "stop": 292000,
        "text": " when I'm just like, I expect this set because that's what I get in this tool,"
      },
      {
        "start": 292000,
        "stop": 292400,
        "text": " at least for me, and really my needs are much simpler than folks with families"
      },
      {
        "start": 292400,
        "stop": 292800,
        "text": " that they're supporting or multiple different friend groups that are all watching off your same thing, but"
      },
      {
        "start": 292800,
        "stop": 293200,
        "text": " you know, it works for me. You adapt. You adapt to what it provides. That's a great"
      },
      {
        "start": 293200,
        "stop": 293600,
        "text": " way to put it. And it just takes a while. It takes"
      },
      {
        "start": 293600,
        "stop": 294000,
        "text": " exposure, right? It takes exposure."
      },
      {
        "start": 294000,
        "stop": 294400,
        "text": " And as you say, right, you learn some things seem like they should be really simple to"
      },
      {
        "start": 294400,
        "stop": 294800,
        "text": " solve, and it's not until you've sort of like read through the bug reports and realized that"
      },
      {
        "start": 294800,
        "stop": 295200,
        "text": " oh no, this actually, this little subsystem here, they could make that tweak and it would fix"
      },
      {
        "start": 295200,
        "stop": 295600,
        "text": " my issue, but it would break all these other things or cause complications for use cases I had"
      },
      {
        "start": 295600,
        "stop": 296000,
        "text": " never even considered before. And it's like, I don't know how to make that tradeoff, so I kind of get that"
      },
      {
        "start": 296000,
        "stop": 296400,
        "text": " they don't maybe know how either. And then there's also"
      },
      {
        "start": 296400,
        "stop": 296800,
        "text": " kind of this whole like, if you zoom out and you take the 50,000 foot"
      },
      {
        "start": 296800,
        "stop": 297200,
        "text": " view and you look at like the multi-decade trends,"
      },
      {
        "start": 297200,
        "stop": 297600,
        "text": " sometimes you take the L today so that way"
      },
      {
        "start": 297600,
        "stop": 298000,
        "text": " you don't get rugged in 5 to 10 years. Do you know what I mean, Brent? Like it's sort of like"
      },
      {
        "start": 298000,
        "stop": 298400,
        "text": " you kind of learn and adopt. I think you've done this"
      },
      {
        "start": 298400,
        "stop": 298800,
        "text": " with photo management tools. You've figured out how to work with the open source"
      },
      {
        "start": 298800,
        "stop": 299200,
        "text": " free software photo management tools, and you maybe had to"
      },
      {
        "start": 299200,
        "stop": 299600,
        "text": " adapt your workflow a little bit from what the commercial tools like from Adobe offer, but you're"
      },
      {
        "start": 299600,
        "stop": 300000,
        "text": " never going to get rugged, right? You're never going to get surprised, you're never going to launch"
      },
      {
        "start": 300000,
        "stop": 300400,
        "text": " Darktable or whatever it is you use, and get an error message that your subscription is"
      },
      {
        "start": 300400,
        "stop": 300800,
        "text": " expired, and so you adapt. Yeah, I think you totally hit it there."
      },
      {
        "start": 300800,
        "stop": 301200,
        "text": " That was the main motivation for me in my photography workflow way back when. I was like"
      },
      {
        "start": 301200,
        "stop": 301600,
        "text": " okay, well maybe I'm losing a feature or two, and maybe I won't have this fancy"
      },
      {
        "start": 301600,
        "stop": 302000,
        "text": " new AI feature they're talking about, but touching on Wes's point, like I never"
      },
      {
        "start": 302000,
        "stop": 302400,
        "text": " had that, so I never knew what I was missing. And actually, it turns out"
      },
      {
        "start": 302400,
        "stop": 302800,
        "text": " Darktable does a heck of a lot more than Lightroom can"
      },
      {
        "start": 302800,
        "stop": 303200,
        "text": " even do these days. And so I think you're right, like"
      },
      {
        "start": 303200,
        "stop": 303600,
        "text": " taking the long view five years down the road actually, this is a really great situation"
      },
      {
        "start": 303600,
        "stop": 304000,
        "text": " for photo workflow stuff now. And it"
      },
      {
        "start": 304000,
        "stop": 304400,
        "text": " yeah, I think that's a really good point. One other thing I'm thinking about"
      },
      {
        "start": 304400,
        "stop": 304800,
        "text": " is, I wonder if our kind of discovering"
      },
      {
        "start": 304800,
        "stop": 305200,
        "text": " many different distributions in the last year and a half plus"
      },
      {
        "start": 305200,
        "stop": 305600,
        "text": " has just got me thinking like, some distributions are really good at a particular"
      },
      {
        "start": 305600,
        "stop": 306000,
        "text": " subset of problems. And that I've"
      },
      {
        "start": 306000,
        "stop": 306400,
        "text": " kind of picked up on each distribution's top quality"
      },
      {
        "start": 306400,
        "stop": 306800,
        "text": " and I just want all those squeezed into one. That's not a thing."
      },
      {
        "start": 306800,
        "stop": 307200,
        "text": " That's just not a thing. Yeah, that is the distro"
      },
      {
        "start": 307200,
        "stop": 307600,
        "text": " hoppers, I think dilemma right there. You've nailed it."
      },
      {
        "start": 307600,
        "stop": 308000,
        "text": " It's hard I think too to properly, I don't know, especially when"
      },
      {
        "start": 308000,
        "stop": 308400,
        "text": " you both use a computer for fun, for play, and for discovery and all"
      },
      {
        "start": 308400,
        "stop": 308800,
        "text": " those things, but also for work. I think it can be hard to commit as"
      },
      {
        "start": 308800,
        "stop": 309200,
        "text": " much as sometimes you might need to to get an optimal experience to be willing to totally break"
      },
      {
        "start": 309200,
        "stop": 309600,
        "text": " apart your workflow to properly explore some new system. So it's like if you"
      },
      {
        "start": 309600,
        "stop": 310000,
        "text": " I think maybe sometimes for Plasma users this can be particularly hard because there's"
      },
      {
        "start": 310000,
        "stop": 310400,
        "text": " so many different ways you can use that desktop environment. You get locked in. If you've made yourself a"
      },
      {
        "start": 310400,
        "stop": 310800,
        "text": " bespoke thing which is great and part of why it's awesome to use and then you're like, well some of these"
      },
      {
        "start": 310800,
        "stop": 311200,
        "text": " other systems, there's no concept in here that can even map onto the way that I want to use"
      },
      {
        "start": 311200,
        "stop": 311600,
        "text": " this system. Or I see it a lot with programming language paradigms."
      },
      {
        "start": 311600,
        "stop": 312000,
        "text": " Not that they're better or worse, but some folks will just be like, that doesn't make sense to me. I'm not willing to explore that"
      },
      {
        "start": 312000,
        "stop": 312400,
        "text": " just because they've never, that's not a type of workflow that they've ever explored so there's not a little"
      },
      {
        "start": 312400,
        "stop": 312800,
        "text": " seed in their brain for it. And you and I both know Brent's crazy. He's got like"
      },
      {
        "start": 312800,
        "stop": 313200,
        "text": " 60 windows open on one desktop. He's not using the virtual desktop."
      },
      {
        "start": 313200,
        "stop": 313600,
        "text": " I wasn't going to go with him. I know, I know you were very, very, very politely trying to call out Brent for his"
      },
      {
        "start": 313600,
        "stop": 314000,
        "text": " crazy work style. And it is true."
      },
      {
        "start": 314000,
        "stop": 314400,
        "text": " Well, that gets me to another question which is, like, you've both noticed that I tend to be"
      },
      {
        "start": 314400,
        "stop": 314800,
        "text": " a one machine user. Like I have a laptop"
      },
      {
        "start": 314800,
        "stop": 315200,
        "text": " One monitor, one machine, yeah. One desktop. You know, at least I have a second"
      },
      {
        "start": 315200,
        "stop": 315600,
        "text": " actually I don't because this laptop doesn't connect to it yet."
      },
      {
        "start": 315600,
        "stop": 316000,
        "text": " But because I travel so much, it's nice to have all of those tools"
      },
      {
        "start": 316000,
        "stop": 316400,
        "text": " always in my bag. But for you, Chris, I know you have the"
      },
      {
        "start": 316400,
        "stop": 316800,
        "text": " office upstairs, you've got, you know, a laptop or two that you have in Jupes"
      },
      {
        "start": 316800,
        "stop": 317200,
        "text": " and they all serve a little bit of a different purpose. Almost like when you're in a certain"
      },
      {
        "start": 317200,
        "stop": 317600,
        "text": " mindset, you use a machine and when you're in a, like, a more, I don't know"
      },
      {
        "start": 317600,
        "stop": 318000,
        "text": " gaming mindset, you use a different machine. And so I wonder if maybe"
      },
      {
        "start": 318000,
        "stop": 318400,
        "text": " there's a way I can change my workflow in that respect. Maybe in a"
      },
      {
        "start": 318400,
        "stop": 318800,
        "text": " more physical way and have different systems for different purposes."
      },
      {
        "start": 318800,
        "stop": 319200,
        "text": " Right. A podcasting machine, a work machine, a play machine kind of thing."
      },
      {
        "start": 319200,
        "stop": 319600,
        "text": " I think we forget in our modern era, Linux is pretty darn"
      },
      {
        "start": 319600,
        "stop": 320000,
        "text": " good at tool booting. Like, it's super easy. You can share home"
      },
      {
        "start": 320000,
        "stop": 320400,
        "text": " partitions or share some, like, data volume that, you know, you mount between all of them or"
      },
      {
        "start": 320400,
        "stop": 320800,
        "text": " Yeah, that's an interesting idea. Plus containers and VMs, you know, all the things."
      },
      {
        "start": 320800,
        "stop": 321200,
        "text": " I think you've got to be considering, you must have thought, like, is Nix, you know, because you see"
      },
      {
        "start": 321200,
        "stop": 321600,
        "text": " how much Wes and I are loving Nix these days. You've got to be thinking about it, right? You must be."
      },
      {
        "start": 321600,
        "stop": 322000,
        "text": " Well, especially that you know that I hate resetting"
      },
      {
        "start": 322000,
        "stop": 322400,
        "text": " everything up on my laptops because I guess I'm particular about certain"
      },
      {
        "start": 322400,
        "stop": 322800,
        "text": " things. Who, you? No, no. And so I know"
      },
      {
        "start": 322800,
        "stop": 323200,
        "text": " Nix is an answer to all of this, but I feel like"
      },
      {
        "start": 323200,
        "stop": 323600,
        "text": " that's just kind of boring for the podcast because you guys have already, Chris, especially,"
      },
      {
        "start": 323600,
        "stop": 324000,
        "text": " you already did that. So I feel like, I don't know, I want to keep my feet wet"
      },
      {
        "start": 324000,
        "stop": 324400,
        "text": " into the other distributions just because there's a lot of potential there."
      },
      {
        "start": 324400,
        "stop": 324800,
        "text": " Yeah, there's a bit of a content element to it. He's a micro"
      },
      {
        "start": 324800,
        "stop": 325200,
        "text": " OS guy. I feel like what we need"
      },
      {
        "start": 325200,
        "stop": 325600,
        "text": " is, like, we should just have, like, an afternoon or an evening where we jump on a call and we all just talk"
      },
      {
        "start": 325600,
        "stop": 326000,
        "text": " about our setups and then we all just kind of help, you know, figure it, dial it in."
      },
      {
        "start": 326000,
        "stop": 326400,
        "text": " That's what you need. Because I know you're suffering, too. And we talk about it on the show is from an"
      },
      {
        "start": 326400,
        "stop": 326800,
        "text": " abstract standpoint, but you really are struggling with the workflow and you're not working as optimally as you could be."
      },
      {
        "start": 326800,
        "stop": 327200,
        "text": " On your laptop. You know, we got you this nice fancy laptop. We want you, we"
      },
      {
        "start": 327200,
        "stop": 327600,
        "text": " want it to work well for you. So it's worth, I think we'll get there."
      },
      {
        "start": 327600,
        "stop": 328000,
        "text": " You are in a period of transition right now. You're just using an entirely different"
      },
      {
        "start": 328000,
        "stop": 328400,
        "text": " stack, a slightly different version of Plasma, different version of Qt,"
      },
      {
        "start": 328400,
        "stop": 328800,
        "text": " different version of the kernel, probably on X11, right?"
      },
      {
        "start": 328800,
        "stop": 329200,
        "text": " And now we've moved on. It's the Linux 6 era. We've got Wayland. We've got,"
      },
      {
        "start": 329200,
        "stop": 329600,
        "text": " it's towards the end of the 5 series of Plasma. It is"
      },
      {
        "start": 329600,
        "stop": 330000,
        "text": " a different generation of software and you're trying to build a workflow around that from scratch right now."
      },
      {
        "start": 330000,
        "stop": 330400,
        "text": " Yeah, you're right. Yeah, there's been some pains there. Wayland especially, I will"
      },
      {
        "start": 330400,
        "stop": 330800,
        "text": " say. But I'm optimistic. What if we just get you like Kubuntu 12.04"
      },
      {
        "start": 330800,
        "stop": 331200,
        "text": " or something? Can we just see how that does? I mean, you know, 12.04 is solid."
      },
      {
        "start": 331200,
        "stop": 331600,
        "text": " I like 12.04 a lot. Can we get Flatpak on that? No."
      },
      {
        "start": 331600,
        "stop": 332000,
        "text": " Maybe Snaps, though. Maybe. Maybe. You know,"
      },
      {
        "start": 332000,
        "stop": 332400,
        "text": " Wes and I have been thinking about trying Windows 11 for a week and just giving that a go."
      },
      {
        "start": 332400,
        "stop": 332800,
        "text": " Trying to get WSL 2 and a package manager and seeing what it's like to live in Windows 11"
      },
      {
        "start": 332800,
        "stop": 333200,
        "text": " for a week. I think it's going to happen. You should join us, though, Brent."
      },
      {
        "start": 333200,
        "stop": 333600,
        "text": " Yeah, alright. I'm in. Totally wipe the dev one. And that way, whatever next distro you get,"
      },
      {
        "start": 333600,
        "stop": 334000,
        "text": " it's like a fresh start after you get that feeling of wiping away windows. You always feel way better wiping"
      },
      {
        "start": 334000,
        "stop": 334400,
        "text": " windows. Yeah, yeah. Yeah, nothing makes you appreciate Linux"
      },
      {
        "start": 334400,
        "stop": 334800,
        "text": " like going to a nice corporate meeting and installing Windows, you know, sitting down and"
      },
      {
        "start": 334800,
        "stop": 335200,
        "text": " really getting your arms around the issue. Oh, we can have like, you know, hanging out for our"
      },
      {
        "start": 335200,
        "stop": 335600,
        "text": " Patch Tuesdays. Yeah."
      },
      {
        "start": 335600,
        "stop": 336000,
        "text": " Little patch party. Please, Microsoft, give me my updates."
      },
      {
        "start": 336000,
        "stop": 336400,
        "text": " Please, can I have them on this Tuesday? The blessed Tuesday."
      },
      {
        "start": 336400,
        "stop": 336800,
        "text": " I wanted to follow up on troubleshooting my son's laptop. He had Fedora 37."
      },
      {
        "start": 336800,
        "stop": 337200,
        "text": " Or he had Fedora 36, I should say. Yeah, not even updating was, right?"
      },
      {
        "start": 337200,
        "stop": 337600,
        "text": " It was, it was, my primary problems was it was hanging at shutdown."
      },
      {
        "start": 337600,
        "stop": 338000,
        "text": " It wasn't sleeping when I closed the lid and his Nvidia driver broke."
      },
      {
        "start": 338000,
        "stop": 338400,
        "text": " And I continued to troubleshoot those issues and I was not really able to resolve them as much."
      },
      {
        "start": 338400,
        "stop": 338800,
        "text": " I tried to turn off all of the KVM stuff and it still hung at shutdown. Only"
      },
      {
        "start": 338800,
        "stop": 339200,
        "text": " after I disabled the KVM stuff, it would hang at shutdown but not let me clear"
      },
      {
        "start": 339200,
        "stop": 339600,
        "text": " the splash so I couldn't actually see the console to see what was hanging."
      },
      {
        "start": 339600,
        "stop": 340000,
        "text": " So it actually got worse. And then I didn't get the Nvidia driver working, which sucks."
      },
      {
        "start": 340000,
        "stop": 340400,
        "text": " So I decided, you know, I'd do the right thing and just bail and try"
      },
      {
        "start": 340400,
        "stop": 340800,
        "text": " to upgrade him to Fedora 37. But unfortunately, that also"
      },
      {
        "start": 340800,
        "stop": 341200,
        "text": " failed. The first thing I did, because I was feeling kind of lazy and I wanted it to work, I guess I was"
      },
      {
        "start": 341200,
        "stop": 341600,
        "text": " feeling optimistic, is I tried the GUI update, you know? Software Center said, \"Hey bro, you got an"
      },
      {
        "start": 341600,
        "stop": 342000,
        "text": " update.\" So I hit the old download button and after downloading on Starlink"
      },
      {
        "start": 342000,
        "stop": 342400,
        "text": " for a while, during peak time, I got an error message about some 32-bit software"
      },
      {
        "start": 342400,
        "stop": 342800,
        "text": " that ain't gonna work on my 64-bit system. Okay."
      },
      {
        "start": 342800,
        "stop": 343200,
        "text": " I don't know why he has 32-bit libraries. I know he has Wine installed. And I know"
      },
      {
        "start": 343200,
        "stop": 343600,
        "text": " he has some old Wine games. Dang it, Steam. Right? It's probably something"
      },
      {
        "start": 343600,
        "stop": 344000,
        "text": " to do with that. So I decided, should have done it like this in the first place."
      },
      {
        "start": 344000,
        "stop": 344400,
        "text": " I'll drop to the command line. And I'll install, make sure the DNF upgrade plugin"
      },
      {
        "start": 344400,
        "stop": 344800,
        "text": " is all set up, do all that kind of stuff. I ran that and"
      },
      {
        "start": 344800,
        "stop": 345200,
        "text": " I got the pre-upgrade error, which to Fedora's credit,"
      },
      {
        "start": 345200,
        "stop": 345600,
        "text": " it checks this stuff before it upgrades your system. It lets you"
      },
      {
        "start": 345600,
        "stop": 346000,
        "text": " know there's gonna be problems. So before anything gets wrecked, it warns you."
      },
      {
        "start": 346000,
        "stop": 346400,
        "text": " And it came up with four different problems I had to solve. And it"
      },
      {
        "start": 346400,
        "stop": 346800,
        "text": " literally lists them out as problem one, problem two, problem three, problem four."
      },
      {
        "start": 346800,
        "stop": 347200,
        "text": " And it tells me problem one is Java latest open"
      },
      {
        "start": 347200,
        "stop": 347600,
        "text": " JDK has an inferior architecture"
      },
      {
        "start": 347600,
        "stop": 348000,
        "text": " which is i686. Problem two is Java latest"
      },
      {
        "start": 348000,
        "stop": 348400,
        "text": " open JDK development. And then problem three is Java latest"
      },
      {
        "start": 348400,
        "stop": 348800,
        "text": " open JDK headless. And problem four is actually MLocate."
      },
      {
        "start": 348800,
        "stop": 349200,
        "text": " Just kind of randomly, God I love MLocate. But anyways."
      },
      {
        "start": 349200,
        "stop": 349600,
        "text": " If you weren't so hooked on being able to find your files again, you know, this wouldn't be happening to you."
      },
      {
        "start": 349600,
        "stop": 350000,
        "text": " I was talking to you about this, Wes. I was like, I don't really understand why this is"
      },
      {
        "start": 350000,
        "stop": 350400,
        "text": " happening. He installed all of these from Fedora repositories."
      },
      {
        "start": 350400,
        "stop": 350800,
        "text": " I don't understand why it's having a problem. And then he came home and I was"
      },
      {
        "start": 350800,
        "stop": 351200,
        "text": " asking him about it and he's like, no, it's something called Copper? And I'm like, oh."
      },
      {
        "start": 351200,
        "stop": 351600,
        "text": " Okay. Alright. And then you're like,"
      },
      {
        "start": 351600,
        "stop": 352000,
        "text": " sorry Dylan, you've avoided your dad warranty. You gotta fix this."
      },
      {
        "start": 352000,
        "stop": 352400,
        "text": " And he kind of did. I was like, listen man, here's what's going to happen. If I upgrade, it's going to remove these packages"
      },
      {
        "start": 352400,
        "stop": 352800,
        "text": " and it's going to break Minecraft. So he's like, no, don't upgrade."
      },
      {
        "start": 352800,
        "stop": 353200,
        "text": " Go a different route. Do not proceed. So I bailed and I did not"
      },
      {
        "start": 353200,
        "stop": 353600,
        "text": " do the upgrade for him. So now he kind of still has the same problem. Like his system"
      },
      {
        "start": 353600,
        "stop": 354000,
        "text": " doesn't shut down properly. He doesn't have an Nvidia graphics driver."
      },
      {
        "start": 354000,
        "stop": 354400,
        "text": " He doesn't sleep when he closes the lid."
      },
      {
        "start": 354400,
        "stop": 354800,
        "text": " I'm frustrated because my daughters are on elementary OS"
      },
      {
        "start": 354800,
        "stop": 355200,
        "text": " and my youngest daughter actually has my son's first"
      },
      {
        "start": 355200,
        "stop": 355600,
        "text": " or second computer actually. And it still has the original elementary OS"
      },
      {
        "start": 355600,
        "stop": 356000,
        "text": " installed. It's based on 1804 and it's working just fine."
      },
      {
        "start": 356000,
        "stop": 356400,
        "text": " I did the updates. I can install flat packs."
      },
      {
        "start": 356400,
        "stop": 356800,
        "text": " It's just fine. And I looked at this and I thought,"
      },
      {
        "start": 356800,
        "stop": 357200,
        "text": " you know, what if I"
      },
      {
        "start": 357200,
        "stop": 357600,
        "text": " just pulled the old maneuver of a base Nix install"
      },
      {
        "start": 357600,
        "stop": 358000,
        "text": " that I updated once every few months and they just kept everything"
      },
      {
        "start": 358000,
        "stop": 358400,
        "text": " installed via flat pack. And I don't even mess with this anymore."
      },
      {
        "start": 358400,
        "stop": 358800,
        "text": " So that's on my radar. We'll see. I don't know. I'm really kind of disappointed. I'm really struggling."
      },
      {
        "start": 358800,
        "stop": 359200,
        "text": " The Fedora thing for family members just hasn't really worked out. There seems to be"
      },
      {
        "start": 359200,
        "stop": 359600,
        "text": " like... Let me put on my"
      },
      {
        "start": 359600,
        "stop": 360000,
        "text": " cynical Linux user hat again. Just my Fedora for family plan"
      },
      {
        "start": 360000,
        "stop": 360400,
        "text": " didn't work out. Seems obvious. I was... Not really."
      },
      {
        "start": 360400,
        "stop": 360800,
        "text": " Because recently it's been so good. It has. And the upgrades have been so solid. This is the first time"
      },
      {
        "start": 360800,
        "stop": 361200,
        "text": " I've ever had an upgrade not working. And you had your whole... I guess you didn't really wait."
      },
      {
        "start": 361200,
        "stop": 361600,
        "text": " You didn't follow your wait for that release to just about be out of support and then"
      },
      {
        "start": 361600,
        "stop": 362000,
        "text": " go to the next one. I was gonna. But then when I couldn't get anything working I thought,"
      },
      {
        "start": 362000,
        "stop": 362400,
        "text": " well maybe if I just rebase on 37 and start over, maybe I can fix"
      },
      {
        "start": 362400,
        "stop": 362800,
        "text": " some of this stuff. Or maybe some of this is just gonna get solved. I know."
      },
      {
        "start": 362800,
        "stop": 363200,
        "text": " So it has not really worked out for me."
      },
      {
        "start": 363200,
        "stop": 363600,
        "text": " And I don't know what I'm gonna do. Maybe I'll go back to an Ubuntu base. Maybe I'll go to a Nix"
      },
      {
        "start": 363600,
        "stop": 364000,
        "text": " base. I'd be curious to know what you out there, listener, are doing for your family members."
      },
      {
        "start": 364000,
        "stop": 364400,
        "text": " And I got a couple of boosts on the topics. We got"
      },
      {
        "start": 364400,
        "stop": 364800,
        "text": " 2,500 sats from The Musso. He says, \"Hey Chris,"
      },
      {
        "start": 364800,
        "stop": 365200,
        "text": " I'm wondering whether you considered using Fedora Silverblue on your son's machine."
      },
      {
        "start": 365200,
        "stop": 365600,
        "text": " It is possible to install the NVIDIA drivers with Silverblue from what I've read."
      },
      {
        "start": 365600,
        "stop": 366000,
        "text": " And it'd be interesting to see what the problem he's experiencing if they're reproducible in the"
      },
      {
        "start": 366000,
        "stop": 366400,
        "text": " Silverblue environment. Does that make more sense"
      },
      {
        "start": 366400,
        "stop": 366800,
        "text": " than say Nix? Depends on how much you want the"
      },
      {
        "start": 366800,
        "stop": 367200,
        "text": " Fedora stuff I guess. You know, like if RPMs are in your wheelhouse"
      },
      {
        "start": 367200,
        "stop": 367600,
        "text": " you like RPM OS tree, you want, you know, you like what Fedora's got, you want"
      },
      {
        "start": 367600,
        "stop": 368000,
        "text": " access to that kind of stuff. I don't know if it is providing me anything I need"
      },
      {
        "start": 368000,
        "stop": 368400,
        "text": " anymore. If I were to switch to Nix. Cause you're probably gonna be like doing flatbacks for"
      },
      {
        "start": 368400,
        "stop": 368800,
        "text": " stuff in both cases, right? Both systems run flatback"
      },
      {
        "start": 368800,
        "stop": 369200,
        "text": " and he's got an AMD GPU which means out of the box on Fedora he wouldn't get"
      },
      {
        "start": 369200,
        "stop": 369600,
        "text": " hardware accelerated playback. I'd have to fix that but I'm not even sure if RPM Fusion"
      },
      {
        "start": 369600,
        "stop": 370000,
        "text": " has an official guide yet still. I'm not sure."
      },
      {
        "start": 370000,
        "stop": 370400,
        "text": " You know that's actually kind of a fun little challenge. Dylan,"
      },
      {
        "start": 370400,
        "stop": 370800,
        "text": " go watch a Twitch stream. Figure it out. Figure it out, yeah. We got 10,000 sats"
      },
      {
        "start": 370800,
        "stop": 371200,
        "text": " from Martin Deboer. He says, \"Hey Chris, regarding"
      },
      {
        "start": 371200,
        "stop": 371600,
        "text": " the topic of your son's laptop on Fedora, I use OpenSUSE."
      },
      {
        "start": 371600,
        "stop": 372000,
        "text": " I support my mom who uses OpenSUSE now and she's used it for years and"
      },
      {
        "start": 372000,
        "stop": 372400,
        "text": " loves it. She still finds problems that I just haven't encountered though."
      },
      {
        "start": 372400,
        "stop": 372800,
        "text": " With OpenSUSE Leap, which is better for Nvidia, you need to add"
      },
      {
        "start": 372800,
        "stop": 373200,
        "text": " the Pac-Man repository. FlatHub is already enabled out of the box and OpenSUSE at community.org"
      },
      {
        "start": 373200,
        "stop": 373600,
        "text": " will let you easily install your codecs. Using software."
      },
      {
        "start": 373600,
        "stop": 374000,
        "text": " opensuse.org you'll find all the other RPM packages. SUSE"
      },
      {
        "start": 374000,
        "stop": 374400,
        "text": " gnome and kdm-militations are also very good.\""
      },
      {
        "start": 374400,
        "stop": 374800,
        "text": " Too many options. Too many options."
      },
      {
        "start": 374800,
        "stop": 375200,
        "text": " We should make Brent try out OpenSUSE. We need a spreadsheet or something."
      },
      {
        "start": 375200,
        "stop": 375600,
        "text": " Think about poor Nev. Brent still hasn't run Gen 2."
      },
      {
        "start": 375600,
        "stop": 376000,
        "text": " That's true. It is a unique experience. In the show notes,"
      },
      {
        "start": 376000,
        "stop": 376400,
        "text": " George Castro wrote up a great post comparing OpenSUSE's"
      },
      {
        "start": 376400,
        "stop": 376800,
        "text": " micro OS with Fedora Silverblue 37."
      },
      {
        "start": 376800,
        "stop": 377200,
        "text": " So we'll throw that in the show notes for you. See what you think."
      },
      {
        "start": 377200,
        "stop": 377600,
        "text": " And then we have one more thing to update everybody on."
      },
      {
        "start": 377600,
        "stop": 378000,
        "text": " It has arrived. It is here. It is still in box, but the new Thalio"
      },
      {
        "start": 378000,
        "stop": 378400,
        "text": " that's going to replace our Linux OBS machine has"
      },
      {
        "start": 378400,
        "stop": 378800,
        "text": " arrived and I wanted to share the build with you all."
      },
      {
        "start": 378800,
        "stop": 379200,
        "text": " Talk a little bit about what we have planned and what you can"
      },
      {
        "start": 379200,
        "stop": 379600,
        "text": " expect. So we have a machine here in studio that"
      },
      {
        "start": 379600,
        "stop": 380000,
        "text": " is responsible for running OBS and records our member streams and"
      },
      {
        "start": 380000,
        "stop": 380400,
        "text": " all that kind of stuff. It's pretty busy, actually. When you really combine"
      },
      {
        "start": 380400,
        "stop": 380800,
        "text": " all the stuff it's doing, it actually manages to tax the system pretty decently, plus"
      },
      {
        "start": 380800,
        "stop": 381200,
        "text": " OBS has a pretty high set of requirements itself, and it has been"
      },
      {
        "start": 381200,
        "stop": 381600,
        "text": " dying. In fact, this morning, before the stream started, I spent about"
      },
      {
        "start": 381600,
        "stop": 382000,
        "text": " 30 minutes just trying to get the damn thing working"
      },
      {
        "start": 382000,
        "stop": 382400,
        "text": " at all. Did you try the Eagle Strike?"
      },
      {
        "start": 382400,
        "stop": 382800,
        "text": " Brent, how many times do I have to tell you? It's the Hawk Strike!"
      },
      {
        "start": 382800,
        "stop": 383200,
        "text": " You come at it like a hawk!"
      },
      {
        "start": 383200,
        "stop": 383600,
        "text": " You gotta make a beak in your hand and come at it like a hawk."
      },
      {
        "start": 383600,
        "stop": 384000,
        "text": " The best part is you're using the sound clip that everyone thinks is an eagle because that's what they do in showbiz, right?"
      },
      {
        "start": 384000,
        "stop": 384400,
        "text": " But deep! It is actually a hawk."
      },
      {
        "start": 384400,
        "stop": 384800,
        "text": " Okay, a little update on our Shuffle Cake. So someone"
      },
      {
        "start": 384800,
        "stop": 385200,
        "text": " don't know who put a little bug in the kernel module."
      },
      {
        "start": 385200,
        "stop": 385600,
        "text": " So any time someone tried to load it, it would just automatically panic."
      },
      {
        "start": 385600,
        "stop": 386000,
        "text": " At least for the moment, I cleared that up, got a fresh one built"
      },
      {
        "start": 386000,
        "stop": 386400,
        "text": " and loaded. How did you figure that out? Well, I noticed that it"
      },
      {
        "start": 386400,
        "stop": 386800,
        "text": " immediately panicked after I tried loading the module. I was like, \"The module's not loaded! Someone loaded it earlier! They have it now!"
      },
      {
        "start": 386800,
        "stop": 387200,
        "text": " I'll just give a little help here and load it!\" And then it printed a fun little message."
      },
      {
        "start": 387200,
        "stop": 387600,
        "text": " Oh yeah? You little hackers out there."
      },
      {
        "start": 387600,
        "stop": 388000,
        "text": " Alright, so here is the Thaleo that I"
      },
      {
        "start": 388000,
        "stop": 388400,
        "text": " got into the studio. I know this is a weird thing to say, but I'm actually"
      },
      {
        "start": 388400,
        "stop": 388800,
        "text": " proud that it's an all Intel build. Stick with me for a second."
      },
      {
        "start": 388800,
        "stop": 389200,
        "text": " I was going to do a Ryzen system, but the 13th gen Intels"
      },
      {
        "start": 389200,
        "stop": 389600,
        "text": " came out and it just felt like the way to go when we're"
      },
      {
        "start": 389600,
        "stop": 390000,
        "text": " also combining it. Oh, it's the 12th gen! I meant to get a 13th gen. I wonder if that's a"
      },
      {
        "start": 390000,
        "stop": 390400,
        "text": " typo on the specs. We'll find out. But we're going to"
      },
      {
        "start": 390400,
        "stop": 390800,
        "text": " pair that with the Arc GPU that Nev sent in and"
      },
      {
        "start": 390800,
        "stop": 391200,
        "text": " see how that combination works on Linux. We've got 32 gigs of"
      },
      {
        "start": 391200,
        "stop": 391600,
        "text": " DDR RAM. We have a 500 gigabyte PCI Gen 4"
      },
      {
        "start": 391600,
        "stop": 392000,
        "text": " NVMe disk in there, as well as a 2 terabyte SSD"
      },
      {
        "start": 392000,
        "stop": 392400,
        "text": " that will be for the OBS recordings. And the whole thing,"
      },
      {
        "start": 392400,
        "stop": 392800,
        "text": " which is supposed to be 13th gen. Oh yeah, okay, there it is."
      },
      {
        "start": 392800,
        "stop": 393200,
        "text": " Down here on the specs. It has the upgrade to the 13th gen, and I went with an"
      },
      {
        "start": 393200,
        "stop": 393600,
        "text": " i5. I decided to go with an i5 on this build."
      },
      {
        "start": 393600,
        "stop": 394000,
        "text": " An i5 13600K."
      },
      {
        "start": 394000,
        "stop": 394400,
        "text": " That's up to 5.1 gigahertz. 14 physical cores."
      },
      {
        "start": 394400,
        "stop": 394800,
        "text": " 20 threads. And it's a 13th gen Intel. I think that's going to be plenty"
      },
      {
        "start": 394800,
        "stop": 395200,
        "text": " for an OBS machine. But here's the thing I really like."
      },
      {
        "start": 395200,
        "stop": 395600,
        "text": " We managed to spec this whole thing out like a killer live streaming"
      },
      {
        "start": 395600,
        "stop": 396000,
        "text": " OBS machine for $1,977."
      },
      {
        "start": 396000,
        "stop": 396400,
        "text": " So for under two grand, we got ourselves a killer"
      },
      {
        "start": 396400,
        "stop": 396800,
        "text": " Thalia workstation. I'm really looking forward to trying this thing out."
      },
      {
        "start": 396800,
        "stop": 397200,
        "text": " It's in the box still. So we haven't even done a build. But I think our intentions"
      },
      {
        "start": 397200,
        "stop": 397600,
        "text": " they're not going to surprise you. Our plans"
      },
      {
        "start": 397600,
        "stop": 398000,
        "text": " slide the Arc GPU in there, and then guess what?"
      },
      {
        "start": 398000,
        "stop": 398400,
        "text": " We're going to load Nix OS. We're going to try Nix OS and OBS as a live streaming system."
      },
      {
        "start": 398400,
        "stop": 398800,
        "text": " I don't know how that's going to work"
      },
      {
        "start": 398800,
        "stop": 399200,
        "text": " with OBS plugins and things like the virtual camera and all of that, but"
      },
      {
        "start": 399200,
        "stop": 399600,
        "text": " there's only one way to find out, and we'll report back here how it all"
      },
      {
        "start": 399600,
        "stop": 400000,
        "text": " worked out."
      },
      {
        "start": 400000,
        "stop": 400400,
        "text": " bitwarden.com/linux. Go get started with a free trial for yourself"
      },
      {
        "start": 400400,
        "stop": 400800,
        "text": " or for a team at bitwarden.com/linux."
      },
      {
        "start": 400800,
        "stop": 401200,
        "text": " Bitwarden is just quite simply the easiest way to store, share"
      },
      {
        "start": 401200,
        "stop": 401600,
        "text": " and sync sensitive data. I also kind of just want to put the word out there that this could"
      },
      {
        "start": 401600,
        "stop": 402000,
        "text": " be a great option for open source projects as well that have multiple members on a team."
      },
      {
        "start": 402000,
        "stop": 402400,
        "text": " And Bitwarden itself is open source. It's trusted by millions of us"
      },
      {
        "start": 402400,
        "stop": 402800,
        "text": " in the community, teams, organizations, just worldwide. People"
      },
      {
        "start": 402800,
        "stop": 403200,
        "text": " use it for secure password storage, and two factor"
      },
      {
        "start": 403200,
        "stop": 403600,
        "text": " I also use it for longer keys for certain services that need very"
      },
      {
        "start": 403600,
        "stop": 404000,
        "text": " long keys. It's what Wes and I used to manage our password for years now."
      },
      {
        "start": 404000,
        "stop": 404400,
        "text": " Wes got ahead of it before me. He honestly got on the Bitwarden train a little before I did."
      },
      {
        "start": 404400,
        "stop": 404800,
        "text": " But a couple years ago I realized which way the things in the password manager space"
      },
      {
        "start": 404800,
        "stop": 405200,
        "text": " were going and decided to switch to Bitwarden. And throughout that time it's just gotten"
      },
      {
        "start": 405200,
        "stop": 405600,
        "text": " better and better. The mobile experience is so slick now, it makes"
      },
      {
        "start": 405600,
        "stop": 406000,
        "text": " it exceedingly easy to use safe, secure passwords, user names"
      },
      {
        "start": 406000,
        "stop": 406400,
        "text": " and unique email addresses for every"
      },
      {
        "start": 406400,
        "stop": 406800,
        "text": " website, app and service you use. I think you're really going to"
      },
      {
        "start": 406800,
        "stop": 407200,
        "text": " love it. I recommend it. If you already have a password manager in your life, perhaps you're already using Bitwarden."
      },
      {
        "start": 407200,
        "stop": 407600,
        "text": " Because after all, you're probably savvy. Maybe you know a friend"
      },
      {
        "start": 407600,
        "stop": 408000,
        "text": " or a family member. Maybe it's a group you work with that could use"
      },
      {
        "start": 408000,
        "stop": 408400,
        "text": " better password management practices. Send them to Bitwarden.com/Linux."
      },
      {
        "start": 408400,
        "stop": 408800,
        "text": " It's really straightforward and it's probably"
      },
      {
        "start": 408800,
        "stop": 409200,
        "text": " in my opinion the number one thing they could do to improve their security online."
      },
      {
        "start": 409200,
        "stop": 409600,
        "text": " If you look at how people get taken advantage of, it's when they're using the same"
      },
      {
        "start": 409600,
        "stop": 410000,
        "text": " username and password everywhere. Sometimes those password databases leak, sometimes they"
      },
      {
        "start": 410000,
        "stop": 410400,
        "text": " get phished and they just have those credentials and they can use them anywhere. The consequences"
      },
      {
        "start": 410400,
        "stop": 410800,
        "text": " can be pretty dramatic, especially with online banking."
      },
      {
        "start": 410800,
        "stop": 411200,
        "text": " So send them to Bitwarden.com/Linux. Have them check it out and then you'll know"
      },
      {
        "start": 411200,
        "stop": 411600,
        "text": " they'll be taken care of. They've got a great active community, a forum and"
      },
      {
        "start": 411600,
        "stop": 412000,
        "text": " a Reddit too, so if you yourself ever need problems and you prefer to do the DIY troubleshooting"
      },
      {
        "start": 412000,
        "stop": 412400,
        "text": " method, there's a lot of resources as well. So it all starts"
      },
      {
        "start": 412400,
        "stop": 412800,
        "text": " for yourself, for a team or an enterprise at Bitwarden.com/Linux."
      },
      {
        "start": 412800,
        "stop": 413200,
        "text": " One more time, support the show by going to Bitwarden.com/Linux."
      },
      {
        "start": 413600,
        "stop": 414000,
        "text": " We got some amazing feedback again this week. Thank you everyone who wrote in."
      },
      {
        "start": 414000,
        "stop": 414400,
        "text": " Sam has some tips for me on desktops."
      },
      {
        "start": 414400,
        "stop": 414800,
        "text": " He says, \"Do you want a rolling distro? Up-to-date, well-curated packages?"
      },
      {
        "start": 414800,
        "stop": 415200,
        "text": " Excellent support for everything you can imagine? Root on ZFS,"
      },
      {
        "start": 415200,
        "stop": 415600,
        "text": " Nvidia Linux, Surface devices, Snap, Flatpacks, you just name it."
      },
      {
        "start": 415600,
        "stop": 416000,
        "text": " A rock stable OS? A plethora of packages? An OS"
      },
      {
        "start": 416000,
        "stop": 416400,
        "text": " usable by regular users? Well, time for Debian testing."
      },
      {
        "start": 416400,
        "stop": 416800,
        "text": " Seriously, they bridge the UI gap now with Gnome 43 with nice"
      },
      {
        "start": 416800,
        "stop": 417200,
        "text": " fonts and all that. Everything else got broken for me to one extent or"
      },
      {
        "start": 417200,
        "stop": 417600,
        "text": " another over the past few years and it made me sad. Like,"
      },
      {
        "start": 417600,
        "stop": 418000,
        "text": " sort of like we're slipping backwards with Linux desktop until I tried Debian"
      },
      {
        "start": 418000,
        "stop": 418400,
        "text": " testing after I failed a Manjaro experiment. I couldn't be"
      },
      {
        "start": 418400,
        "stop": 418800,
        "text": " happier and it does everything you can possibly want and does it really well."
      },
      {
        "start": 418800,
        "stop": 419200,
        "text": " I run it on a Surface Book 2 that I purchased to run Linux and"
      },
      {
        "start": 419200,
        "stop": 419600,
        "text": " it's great. Kudos to Debian and making a rock"
      },
      {
        "start": 419600,
        "stop": 420000,
        "text": " solid Linux distribution for two decades and the most capable distro of"
      },
      {
        "start": 420000,
        "stop": 420400,
        "text": " 2022 for me. You should revisit it and report it on the show. It"
      },
      {
        "start": 420400,
        "stop": 420800,
        "text": " is really that good. Wow. What struck me"
      },
      {
        "start": 420800,
        "stop": 421200,
        "text": " in there is it sounds like you kind of had a crisis of Linux faith and Debian"
      },
      {
        "start": 421200,
        "stop": 421600,
        "text": " sort of stopped that spiral and I'm wondering if you felt that way"
      },
      {
        "start": 421600,
        "stop": 422000,
        "text": " Brent? Have you felt a little bit of crisis of faith in the Linux desktop at least?"
      },
      {
        "start": 422000,
        "stop": 422400,
        "text": " There's a bit of a crisis happening and I feel like maybe that's just like a coming"
      },
      {
        "start": 422400,
        "stop": 422800,
        "text": " of age for many of us. It's just like you eventually get to that point"
      },
      {
        "start": 422800,
        "stop": 423200,
        "text": " and it's nice to hear that users and listeners"
      },
      {
        "start": 423200,
        "stop": 423600,
        "text": " are getting past that because I was really worried I'd just stick here and suffer for many years."
      },
      {
        "start": 423600,
        "stop": 424000,
        "text": " But it sounds like there's light at the end of that tunnel. I mean,"
      },
      {
        "start": 424000,
        "stop": 424400,
        "text": " don't get us wrong. There's definitely some suffering. It's just manageable suffering"
      },
      {
        "start": 424400,
        "stop": 424800,
        "text": " perhaps. Milton also wrote in and"
      },
      {
        "start": 424800,
        "stop": 425200,
        "text": " suggests that I run Manjaro with Plasma"
      },
      {
        "start": 425200,
        "stop": 425600,
        "text": " which has been very stable until recently with Plasma 5"
      },
      {
        "start": 425600,
        "stop": 426000,
        "text": " 2 5 and some instability has continued with"
      },
      {
        "start": 426000,
        "stop": 426400,
        "text": " 5 2 6 2 similar to Brent's experience on Fedora 37. There have been"
      },
      {
        "start": 426400,
        "stop": 426800,
        "text": " application hangs in particular with evolution crashes with Libre Office."
      },
      {
        "start": 426800,
        "stop": 427200,
        "text": " I suspect K win is likely the culprit. Hopefully the"
      },
      {
        "start": 427200,
        "stop": 427600,
        "text": " KD team will resolve those soon. It is seriously disappointing that Linux"
      },
      {
        "start": 427600,
        "stop": 428000,
        "text": " distributions cannot produce a stable system which could be upgraded and run"
      },
      {
        "start": 428000,
        "stop": 428400,
        "text": " for many years without a degradation over time. I too"
      },
      {
        "start": 428400,
        "stop": 428800,
        "text": " experienced such issues on Ubuntu flavors and ultimately found Manjaro"
      },
      {
        "start": 428800,
        "stop": 429200,
        "text": " the most stable. Distro hopping is fun, but I don't have the"
      },
      {
        "start": 429200,
        "stop": 429600,
        "text": " time or energy to continually build my laptop every few months."
      },
      {
        "start": 429600,
        "stop": 430000,
        "text": " For sustained Linux growth and adoption, there needs to be a concerted effort"
      },
      {
        "start": 430000,
        "stop": 430400,
        "text": " to uncover and fix the underlying issues with Linux stability"
      },
      {
        "start": 430400,
        "stop": 430800,
        "text": " and correct them. It would benefit all of us."
      },
      {
        "start": 431000,
        "stop": 431400,
        "text": " We use these distributions for so many different things."
      },
      {
        "start": 431400,
        "stop": 431800,
        "text": " I think it's fairly rare that your basic operations"
      },
      {
        "start": 431800,
        "stop": 432200,
        "text": " like I can pull up my Firefox, I can go to my social media"
      },
      {
        "start": 432200,
        "stop": 432600,
        "text": " platform of choice in my web browser, that kind of thing is usually broken."
      },
      {
        "start": 432600,
        "stop": 433000,
        "text": " But there's no, not that there aren't people helping direct this stuff, obviously"
      },
      {
        "start": 433000,
        "stop": 433400,
        "text": " there are. But maybe not in the same way that an Apple has"
      },
      {
        "start": 433400,
        "stop": 433800,
        "text": " various product managers who are insistent that like, \"No, we are marketing and solving"
      },
      {
        "start": 433800,
        "stop": 434200,
        "text": " for these workflows and they must be rock solid before we're even going to think about releasing them.\""
      },
      {
        "start": 434200,
        "stop": 434600,
        "text": " That kind of stuff, I don't know, it doesn't always happen. Not that it never happens in Linux"
      },
      {
        "start": 434600,
        "stop": 435000,
        "text": " but that can vary and now you put emphasis over here on this quadrant"
      },
      {
        "start": 435000,
        "stop": 435400,
        "text": " and suddenly Brent's niche use case over here is not getting tested as much."
      },
      {
        "start": 435400,
        "stop": 435800,
        "text": " You know where it does happen, and maybe this is actually worth saying, because"
      },
      {
        "start": 435800,
        "stop": 436200,
        "text": " we've been talking about being cynical and all of that. Real beauty and"
      },
      {
        "start": 436200,
        "stop": 436600,
        "text": " elegance happens low down and just low level"
      },
      {
        "start": 436600,
        "stop": 437000,
        "text": " and all of a sudden one day a problem you've had in Linux for"
      },
      {
        "start": 437000,
        "stop": 437400,
        "text": " years is just solved. Like that's, work is being done"
      },
      {
        "start": 437400,
        "stop": 437800,
        "text": " right now for the Nvidia driver. To just one day, Linux users are going to just install"
      },
      {
        "start": 437800,
        "stop": 438200,
        "text": " Linux and have fully accelerated Nvidia drivers without having"
      },
      {
        "start": 438200,
        "stop": 438600,
        "text": " to do any other work. It's just kind of like this remarkable aspect"
      },
      {
        "start": 438600,
        "stop": 439000,
        "text": " of the development. Or they solve something in the kernel deep down inside"
      },
      {
        "start": 439000,
        "stop": 439400,
        "text": " that now just automatically does something when you boot your system."
      },
      {
        "start": 439400,
        "stop": 439800,
        "text": " You know, there's just these things that have happened over time that"
      },
      {
        "start": 439800,
        "stop": 440200,
        "text": " have been these major blockers that"
      },
      {
        "start": 440200,
        "stop": 440600,
        "text": " eventually once they're solved in Linux, they're solved in such an elegant way"
      },
      {
        "start": 440600,
        "stop": 441000,
        "text": " that you never even really knew it was an issue. And it's coming, it's happening"
      },
      {
        "start": 441000,
        "stop": 441400,
        "text": " we're just, you know, you're kind of running up against some of those right now. And so I think it's worth"
      },
      {
        "start": 441400,
        "stop": 441800,
        "text": " mentioning that because we've been very cynical this episode, but there is the flip side of"
      },
      {
        "start": 441800,
        "stop": 442200,
        "text": " once those problems are solved, and amazingly so many of them do get solved,"
      },
      {
        "start": 442200,
        "stop": 442600,
        "text": " they're solved in a way where they never felt like it was an issue to begin with."
      },
      {
        "start": 442600,
        "stop": 443000,
        "text": " They really, you know, they nail it. I'd also like to say that"
      },
      {
        "start": 443000,
        "stop": 443400,
        "text": " just because there are a few little things that I'm running into that are kind of annoying on the surface"
      },
      {
        "start": 443400,
        "stop": 443800,
        "text": " I still am completely in love with Linux and the Linux desktop"
      },
      {
        "start": 443800,
        "stop": 444200,
        "text": " and the way everything works and how hard everybody works and stuff. So"
      },
      {
        "start": 444200,
        "stop": 444600,
        "text": " I don't want that to be lost in all of this. I feel like it's just"
      },
      {
        "start": 444600,
        "stop": 445000,
        "text": " part of the journey that we're exploring and certainly I think there's going to be some"
      },
      {
        "start": 445000,
        "stop": 445400,
        "text": " good news down the road."
      },
      {
        "start": 445400,
        "stop": 445800,
        "text": " And now it is time for the boost. I wanted to move to"
      },
      {
        "start": 445800,
        "stop": 446200,
        "text": " the boost because we have a lot to get to and there's just so many great boosts."
      },
      {
        "start": 446200,
        "stop": 446600,
        "text": " And Gene Bean is a consistent booster with some great thoughts."
      },
      {
        "start": 446600,
        "stop": 447000,
        "text": " And he sent in a sat stream of thoughts and he started with 1024"
      },
      {
        "start": 447000,
        "stop": 447400,
        "text": " sats. He said Fedora 36 drove me to try out"
      },
      {
        "start": 447400,
        "stop": 447800,
        "text": " Pop!OS. 34 and 35 were nice, but"
      },
      {
        "start": 447800,
        "stop": 448200,
        "text": " 36 just wasn't stable. So there"
      },
      {
        "start": 448200,
        "stop": 448600,
        "text": " you go, right? Like different people, different things work. Gene Bean"
      },
      {
        "start": 448600,
        "stop": 449000,
        "text": " like I said, it's going to be a stream of thoughts, sent in a follow up boost for an elite set of sats."
      },
      {
        "start": 449000,
        "stop": 449400,
        "text": " Regarding Ubuntu ZFS at all, I really wish"
      },
      {
        "start": 449400,
        "stop": 449800,
        "text": " everyone would just build on the butterfS work OpenSUSE has done."
      },
      {
        "start": 449800,
        "stop": 450200,
        "text": " There are plugins to take snaps and generate grub entries like OpenSUSE does."
      },
      {
        "start": 450200,
        "stop": 450600,
        "text": " In other distros it would just be really handy to have that out of the box. The experience"
      },
      {
        "start": 450600,
        "stop": 451000,
        "text": " is not nearly as good. I agree guys."
      },
      {
        "start": 451000,
        "stop": 451400,
        "text": " Like why the hell hasn't the good work that OpenSUSE"
      },
      {
        "start": 451400,
        "stop": 451800,
        "text": " has done, why hasn't that really been acknowledged and moved over to other distros? Why aren't the"
      },
      {
        "start": 451800,
        "stop": 452200,
        "text": " Fedora folks working on that? What's going on there guys?"
      },
      {
        "start": 452200,
        "stop": 452600,
        "text": " I wonder if there's some amount, I don't know. Admittedly we didn't use it"
      },
      {
        "start": 452600,
        "stop": 453000,
        "text": " enough in Anger I think to really fully appreciate it and we haven't run"
      },
      {
        "start": 453000,
        "stop": 453400,
        "text": " like a rock solid SUSE setup over multiple years"
      },
      {
        "start": 453400,
        "stop": 453800,
        "text": " or multiple upgrades or really super in production. Compared to some of the"
      },
      {
        "start": 453800,
        "stop": 454200,
        "text": " stuff like some of the early ZSYS work and some of the other like the FreeBSD boot system"
      },
      {
        "start": 454200,
        "stop": 454600,
        "text": " I did not find Snapper as intuitive when we had it in the"
      },
      {
        "start": 454600,
        "stop": 455000,
        "text": " Arch setup as I kind of expected. And again I'm not saying, I'm sure if I"
      },
      {
        "start": 455000,
        "stop": 455400,
        "text": " spent more time learning it and operating it I would think better of it. And I don't think poorly of it."
      },
      {
        "start": 455400,
        "stop": 455800,
        "text": " It wasn't quite that like, oh my god suddenly my system feels resilient and I can roll"
      },
      {
        "start": 455800,
        "stop": 456200,
        "text": " back with ease and I understand how this works."
      },
      {
        "start": 456200,
        "stop": 456600,
        "text": " So I wonder if maybe there's aspects of it that are harder to"
      },
      {
        "start": 456600,
        "stop": 457000,
        "text": " you know, you gotta be willing to redo how you set up your system to make it"
      },
      {
        "start": 457000,
        "stop": 457400,
        "text": " play nice. We had to follow some guides to be like, well how do I get all my Bunnar Fests laid out the right way"
      },
      {
        "start": 457400,
        "stop": 457800,
        "text": " to be friendly with Snapper and if that doesn't jive with how an installation"
      },
      {
        "start": 457800,
        "stop": 458200,
        "text": " team's already doing it or how users have it installed in practice from old installations."
      },
      {
        "start": 458200,
        "stop": 458600,
        "text": " You gotta be willing to lay it back out differently. Yeah there was that."
      },
      {
        "start": 458600,
        "stop": 459000,
        "text": " The game continues and wonders with 1024Sats"
      },
      {
        "start": 459000,
        "stop": 459400,
        "text": " Have any of us really had any experience with Session instead of Signal?"
      },
      {
        "start": 459400,
        "stop": 459800,
        "text": " I'm a Telegram user, Brent I know you use Signal a bit, have you ever tried out"
      },
      {
        "start": 459800,
        "stop": 460200,
        "text": " Session messenger? I would say I use Signal a lot actually, the only reason I use"
      },
      {
        "start": 460200,
        "stop": 460600,
        "text": " Telegram is because of you, thank you very much. Which Telegram has been"
      },
      {
        "start": 460600,
        "stop": 461000,
        "text": " great to be honest, our community is there and it's been awesome. You know that's how I got started"
      },
      {
        "start": 461000,
        "stop": 461400,
        "text": " too, the JB fun, they sucked me in. Well if you guys remember now"
      },
      {
        "start": 461400,
        "stop": 461800,
        "text": " Brent it was a little bit before your time, but Wes if you might remember we were on Viber."
      },
      {
        "start": 461800,
        "stop": 462200,
        "text": " Yeah! Right! And it was, we needed something that could handle Linux"
      },
      {
        "start": 462200,
        "stop": 462600,
        "text": " Fest. And so Viber wasn't doing it anymore for us, we switched"
      },
      {
        "start": 462600,
        "stop": 463000,
        "text": " to Telegram for Linux Fest and it just, it just kind of"
      },
      {
        "start": 463000,
        "stop": 463400,
        "text": " went from there. Now all my family's on there, look what happened. Yeah yeah I got tons of family on Telegram"
      },
      {
        "start": 463400,
        "stop": 463800,
        "text": " yeah. I know I'm totally hooked. So that's why"
      },
      {
        "start": 463800,
        "stop": 464200,
        "text": " I've not tried out Session myself because of that. I've certainly read about Session and it"
      },
      {
        "start": 464200,
        "stop": 464600,
        "text": " just kind of I think came to me at the time where Signal and"
      },
      {
        "start": 464600,
        "stop": 465000,
        "text": " also Telegram were solving the problems that Session were solving. I forget the"
      },
      {
        "start": 465000,
        "stop": 465400,
        "text": " specifics but I remember thinking well Signal at the time, and this was"
      },
      {
        "start": 465400,
        "stop": 465800,
        "text": " probably three years ago I would say,"
      },
      {
        "start": 465800,
        "stop": 466200,
        "text": " at the time was just, felt more mature and felt like it had a larger"
      },
      {
        "start": 466200,
        "stop": 466600,
        "text": " network of folks using it and just had a better reputation at the time."
      },
      {
        "start": 466600,
        "stop": 467000,
        "text": " Session was kind of new, but I'd be curious to hear where Session is coming at that time."
      },
      {
        "start": 467000,
        "stop": 467400,
        "text": " I think Gene Bean is thinking along my line of thoughts. Another set of"
      },
      {
        "start": 467400,
        "stop": 467800,
        "text": " 1024Sats. I love Matrix too. FluffyChat is a nice"
      },
      {
        "start": 467800,
        "stop": 468200,
        "text": " chat interface for Matrix and I really have been thinking about a small"
      },
      {
        "start": 468200,
        "stop": 468600,
        "text": " scale, maybe it's Dendrite, a small scale Matrix server"
      },
      {
        "start": 468600,
        "stop": 469000,
        "text": " that I run on my Odroid and then I just set up my kids"
      },
      {
        "start": 469000,
        "stop": 469400,
        "text": " and my wife with FluffyChat and I just set it up for them"
      },
      {
        "start": 469400,
        "stop": 469800,
        "text": " and maybe we just all use FluffyChat and I don't know."
      },
      {
        "start": 469800,
        "stop": 470200,
        "text": " That could work pretty well. That could pretty, I mean the only"
      },
      {
        "start": 470200,
        "stop": 470600,
        "text": " downside there right, is now I'm responsible for maintaining"
      },
      {
        "start": 470600,
        "stop": 471000,
        "text": " the server that makes it possible for my family to chat."
      },
      {
        "start": 471000,
        "stop": 471400,
        "text": " That's a lot. That's a lot. Don't love it. But if you're kind of"
      },
      {
        "start": 471400,
        "stop": 471800,
        "text": " getting annoyed with them and you just don't have, you need to be, oh server maintenance, sorry"
      },
      {
        "start": 471800,
        "stop": 472200,
        "text": " team. It's down. Sorry about that everybody. And then Gene Bean"
      },
      {
        "start": 472200,
        "stop": 472600,
        "text": " continued with a row of 6,666Sats, which sound"
      },
      {
        "start": 472600,
        "stop": 473000,
        "text": " ominous when you ask me. And he writes, respect should be earned."
      },
      {
        "start": 473000,
        "stop": 473400,
        "text": " I hate how accurate Neil is, but I believe in regards to legal issues"
      },
      {
        "start": 473400,
        "stop": 473800,
        "text": " and maintaining about bankruptcy, it is going to be a problem."
      },
      {
        "start": 473800,
        "stop": 474200,
        "text": " Deckbot comes in with 1,100"
      },
      {
        "start": 474200,
        "stop": 474600,
        "text": " Sats live as we're recording. Using all"
      },
      {
        "start": 474600,
        "stop": 475000,
        "text": " my Sats from Fountain to pair Brent and the other Canadian, Alan Jude."
      },
      {
        "start": 475000,
        "stop": 475400,
        "text": " He says Brent, go give free BSD a go."
      },
      {
        "start": 475400,
        "stop": 475800,
        "text": " You know that's come up a few times and I think you were"
      },
      {
        "start": 475800,
        "stop": 476200,
        "text": " both thinking of putting that on my dev1 before I got it."
      },
      {
        "start": 476200,
        "stop": 476600,
        "text": " I don't think that went so well right? Yeah the"
      },
      {
        "start": 476600,
        "stop": 477000,
        "text": " issue there really is just simply you have nice"
      },
      {
        "start": 477000,
        "stop": 477400,
        "text": " new hardware and free BSD is old, busted and doesn't have"
      },
      {
        "start": 477400,
        "stop": 477800,
        "text": " nice new hardware support. Now if you got old, crappy hardware, you could totally run"
      },
      {
        "start": 477800,
        "stop": 478200,
        "text": " free BSD just fine. Well I have plenty of that laying around. Yeah, me too."
      },
      {
        "start": 478200,
        "stop": 478600,
        "text": " Me too. I agree. So yeah"
      },
      {
        "start": 478600,
        "stop": 479000,
        "text": " there's, I mean maybe there's something there for it, but yeah, nay. I say"
      },
      {
        "start": 479000,
        "stop": 479400,
        "text": " nay. The Golden Dragon coming in from a, I mean it's been"
      },
      {
        "start": 479400,
        "stop": 479800,
        "text": " weeks coming in from a long break with 2,222 Sats."
      },
      {
        "start": 479800,
        "stop": 480200,
        "text": " And as our show"
      },
      {
        "start": 480200,
        "stop": 480600,
        "text": " mascot, I would hope he'd boost it more often to maintain that status. This is a long time no boost on the subject"
      },
      {
        "start": 480600,
        "stop": 481000,
        "text": " of Fedora. Well guys, this is why I had to stop using Fedora."
      },
      {
        "start": 481000,
        "stop": 481400,
        "text": " The lawyers at IBM and the usability of Gnome"
      },
      {
        "start": 481400,
        "stop": 481800,
        "text": " combined. It's wild to me that Fedora gets jerked around"
      },
      {
        "start": 481800,
        "stop": 482200,
        "text": " and then gimped because IBM wants everything to be on the up and up."
      },
      {
        "start": 482200,
        "stop": 482600,
        "text": " Maybe it is time to fork."
      },
      {
        "start": 482600,
        "stop": 483000,
        "text": " Oof, the champagne that John A. brought in has hit me. It's hard to get through these"
      },
      {
        "start": 483000,
        "stop": 483400,
        "text": " boosts now. Alright, so I said something as"
      },
      {
        "start": 483400,
        "stop": 483800,
        "text": " kind of an off the cuff burn and I said IBM's"
      },
      {
        "start": 483800,
        "stop": 484200,
        "text": " lawyers last week. I didn't actually mean IBM's"
      },
      {
        "start": 484200,
        "stop": 484600,
        "text": " lawyers are making decisions for Fedora. It was hyperbole."
      },
      {
        "start": 484600,
        "stop": 485000,
        "text": " From what I know from people who still are involved at"
      },
      {
        "start": 485000,
        "stop": 485400,
        "text": " Red Hat, the legal team that manages that stuff and works with Fedora is the"
      },
      {
        "start": 485400,
        "stop": 485800,
        "text": " same legal team that was there before acquisition. So"
      },
      {
        "start": 485800,
        "stop": 486200,
        "text": " I want to make that clear. I've heard that from multiple sources."
      },
      {
        "start": 486200,
        "stop": 486600,
        "text": " I was joking. That said,"
      },
      {
        "start": 486600,
        "stop": 487000,
        "text": " one thing that I wanted to bring up, and I'd love to see continued"
      },
      {
        "start": 487000,
        "stop": 487400,
        "text": " discussion, because I think it allows the Fedora"
      },
      {
        "start": 487400,
        "stop": 487800,
        "text": " project to talk about this issue without exposing themselves to too much"
      },
      {
        "start": 487800,
        "stop": 488200,
        "text": " potential legal trouble, and that is, why is it okay for us"
      },
      {
        "start": 488200,
        "stop": 488600,
        "text": " to have unfiltered flat hub, but not unfiltered"
      },
      {
        "start": 488600,
        "stop": 489000,
        "text": " RPM fusion? I think I know why. I think I know the reason."
      },
      {
        "start": 489000,
        "stop": 489400,
        "text": " But I think the Fedora project should probably articulate that reason"
      },
      {
        "start": 489400,
        "stop": 489800,
        "text": " to the public, because I think it would give insight to the public"
      },
      {
        "start": 489800,
        "stop": 490200,
        "text": " as to how things work without having to expose themselves to specifics"
      },
      {
        "start": 490200,
        "stop": 490600,
        "text": " that might actually get them in legal trouble. That's all I can say on this matter."
      },
      {
        "start": 490600,
        "stop": 491000,
        "text": " But there is better communication that could be happening here between"
      },
      {
        "start": 491000,
        "stop": 491400,
        "text": " Fedora and the community. Instead of just telling us tough luck, the lawyers"
      },
      {
        "start": 491400,
        "stop": 491800,
        "text": " tell us it has to be this way, and we can't tell you why. I think what"
      },
      {
        "start": 491800,
        "stop": 492200,
        "text": " has to happen here is the onus is now on the Fedora project to communicate as much"
      },
      {
        "start": 492200,
        "stop": 492600,
        "text": " information as they can without getting themselves in trouble. And if that means writing a blog post"
      },
      {
        "start": 492600,
        "stop": 493000,
        "text": " and running it past the lawyers first, and then modifying it based on their suggestions, then"
      },
      {
        "start": 493000,
        "stop": 493400,
        "text": " for god's sake do it. Because right now, the project looks handicapped."
      },
      {
        "start": 493400,
        "stop": 493800,
        "text": " It looks gimped. It looks like it is under the control of lawyers. It looks like"
      },
      {
        "start": 493800,
        "stop": 494200,
        "text": " anything cool you do is eventually going to get overridden by lawyers."
      },
      {
        "start": 494200,
        "stop": 494600,
        "text": " And that isn't the truth. That is not reality."
      },
      {
        "start": 494600,
        "stop": 495000,
        "text": " So meet us halfway. Explain to the people. That's all."
      },
      {
        "start": 495000,
        "stop": 495400,
        "text": " And if you, I think, started with \"Why RPM Fusion Bad?"
      },
      {
        "start": 495400,
        "stop": 495800,
        "text": " Flathead Good?\" I think if you just kind of explored"
      },
      {
        "start": 495800,
        "stop": 496200,
        "text": " that particular question, I think you could give a lot of us in the community an explanation"
      },
      {
        "start": 496200,
        "stop": 496600,
        "text": " that people could understand. Yeah, maybe like some"
      },
      {
        "start": 496600,
        "stop": 497000,
        "text": " expectation setting, just so we know where to expect the boundaries to be for future things."
      },
      {
        "start": 497000,
        "stop": 497400,
        "text": " Obviously, we still love Fedora. There's nothing there. We just want to"
      },
      {
        "start": 497400,
        "stop": 497800,
        "text": " know what we should expect from it going forward, and where the card rails are."
      },
      {
        "start": 497800,
        "stop": 498200,
        "text": " BitcoinLizard boosted in with 25,000 sats, which is"
      },
      {
        "start": 498200,
        "stop": 498600,
        "text": " technically a baller boost for this episode. Hey, hey!"
      },
      {
        "start": 498600,
        "stop": 498800,
        "text": " [music]"
      },
      {
        "start": 498800,
        "stop": 499200,
        "text": " And I have to say, this is probably the boost of the week that moved"
      },
      {
        "start": 499200,
        "stop": 499600,
        "text": " the needle the most for me. Hadn't really thought about this very much."
      },
      {
        "start": 499600,
        "stop": 500000,
        "text": " And I really appreciate this, because this was kind of, I think, the issue that was"
      },
      {
        "start": 500000,
        "stop": 500400,
        "text": " rattling around in the back of my mind, and I had not put words to it. BitcoinLizard writes,"
      },
      {
        "start": 500400,
        "stop": 500800,
        "text": " \"I have run a single user Mastodon instance for a year."
      },
      {
        "start": 500800,
        "stop": 501200,
        "text": " It is not for the faint of heart. It is much more"
      },
      {
        "start": 501200,
        "stop": 501600,
        "text": " difficult than a family matrix Synapse server.\" Which, that"
      },
      {
        "start": 501600,
        "stop": 502000,
        "text": " tells you something, because Synapse isn't necessarily easy. Mastodon"
      },
      {
        "start": 502000,
        "stop": 502400,
        "text": " needs to improve on its cache management. Seemingly, the"
      },
      {
        "start": 502400,
        "stop": 502800,
        "text": " storage will grow forever. I agree with your idea to just start with JB staff,"
      },
      {
        "start": 502800,
        "stop": 503200,
        "text": " and then maybe grow later. That definitely seems like the way to do it if we're"
      },
      {
        "start": 503200,
        "stop": 503600,
        "text": " going to do it. I don't know that we have to do Mastodon either, right?"
      },
      {
        "start": 503600,
        "stop": 504000,
        "text": " Like, as we were saying earlier, part of the fun is"
      },
      {
        "start": 504000,
        "stop": 504400,
        "text": " ActivityPub itself. So, I mean, maybe we want to try Mastodon just to"
      },
      {
        "start": 504400,
        "stop": 504800,
        "text": " be where everyone else is going, but maybe we want to find some other"
      },
      {
        "start": 504800,
        "stop": 505200,
        "text": " client we work better that's easier to host, or has other features. I know there's forks"
      },
      {
        "start": 505200,
        "stop": 505600,
        "text": " of Mastodon too now. Doesn't this feel a little bit like"
      },
      {
        "start": 505600,
        "stop": 506000,
        "text": " the Dendrite versus traditional matrix server option, and like if you're"
      },
      {
        "start": 506000,
        "stop": 506400,
        "text": " doing a really big matrix community, it kind of makes sense to use the traditional"
      },
      {
        "start": 506400,
        "stop": 506800,
        "text": " matrix daemon, but if you're going to do something light and lean, it kind of makes sense to use"
      },
      {
        "start": 506800,
        "stop": 507200,
        "text": " Dendrite. Maybe try something else, yeah. I wonder if that isn't the situation here with Mastodon."
      },
      {
        "start": 507200,
        "stop": 507600,
        "text": " Sort of the same thing. Alright, we got a live boost. Are you ready for this gentleman?"
      },
      {
        "start": 507600,
        "stop": 508000,
        "text": " No, I can't be. It's live. Big old baller boost coming in!"
      },
      {
        "start": 508000,
        "stop": 508400,
        "text": " \"Hey rich lifestyle!\""
      },
      {
        "start": 508400,
        "stop": 508800,
        "text": " Live boost of 100,000 sats from D3Xbot. Long time listener, first time"
      },
      {
        "start": 508800,
        "stop": 509200,
        "text": " booster. I wanted to pop in and say hi while watching the livestream on Jupiter 2!"
      },
      {
        "start": 509200,
        "stop": 509600,
        "text": " Yes! That is the combo man! It is pronounced"
      },
      {
        "start": 509600,
        "stop": 510000,
        "text": " Dexbot. That's different from the booster who's Dexbot."
      },
      {
        "start": 510000,
        "stop": 510400,
        "text": " Thank you Dexbot. 100,000 sats using Podverse 2, which"
      },
      {
        "start": 510400,
        "stop": 510800,
        "text": " is the GPL3 cross-platform new podcast app. That's very"
      },
      {
        "start": 510800,
        "stop": 511200,
        "text": " awesome to see. Thank you very much. And then Martin De-boer"
      },
      {
        "start": 511200,
        "stop": 511600,
        "text": " boosted in with 18,000 sats."
      },
      {
        "start": 511600,
        "stop": 512000,
        "text": " Keep the change, you filthy animal!"
      },
      {
        "start": 512000,
        "stop": 512400,
        "text": " Hi Chris, Wes, and Brent. I'm a long time listener since 2011. Wow."
      },
      {
        "start": 512400,
        "stop": 512800,
        "text": " That is a long time. That's impressive. Moment of silence for that."
      },
      {
        "start": 512800,
        "stop": 513200,
        "text": " That is respectable. I think that's gotta be roughly the era"
      },
      {
        "start": 513200,
        "stop": 513600,
        "text": " I started listening. Yeah, and that's like pre-two kids maybe?"
      },
      {
        "start": 513600,
        "stop": 514000,
        "text": " Like one kid? I know one kid at least is not that old."
      },
      {
        "start": 514000,
        "stop": 514400,
        "text": " When I hear about listeners that have been listening since before I've had children, that's remarkable."
      },
      {
        "start": 514400,
        "stop": 514800,
        "text": " This is my first boost using Podverse, Albi, and"
      },
      {
        "start": 514800,
        "stop": 515200,
        "text": " BlueWallet. Alright, I think you guys should join"
      },
      {
        "start": 515200,
        "stop": 515600,
        "text": " Mastodon. It fills a different role from Signal, Telegram, and Matrix"
      },
      {
        "start": 515600,
        "stop": 516000,
        "text": " type messages. These platforms are aimed at private or"
      },
      {
        "start": 516000,
        "stop": 516400,
        "text": " group conversation. Mastodon's like Twitter. It's aimed at public"
      },
      {
        "start": 516400,
        "stop": 516800,
        "text": " conversations. You set up your own server for the JB crew, and you then advertise to your"
      },
      {
        "start": 516800,
        "stop": 517200,
        "text": " listeners how to join. Thanks for all your work, and by the way, here's my private address."
      },
      {
        "start": 517200,
        "stop": 517600,
        "text": " That's in there for us, you guys. You know, when somebody sends 18,000"
      },
      {
        "start": 517600,
        "stop": 518000,
        "text": " sats, and they go through the trouble of"
      },
      {
        "start": 518000,
        "stop": 518400,
        "text": " switching to Podverse and setting up Albi and BlueWallet to send me a message,"
      },
      {
        "start": 518400,
        "stop": 518800,
        "text": " I'm going to listen to that message. I think this is something"
      },
      {
        "start": 518800,
        "stop": 519200,
        "text": " we probably need to do. I think this boost puts me"
      },
      {
        "start": 519200,
        "stop": 519600,
        "text": " over the edge. I think we've got to figure out a Mastodon. Because you know what I'm liking is this idea"
      },
      {
        "start": 519600,
        "stop": 520000,
        "text": " that we have the crew, so you know it's us. We have a Jupyter broadcasting"
      },
      {
        "start": 520000,
        "stop": 520400,
        "text": " address. We keep it tight so it's not too much for us to manage, so we can keep it running on the long term."
      },
      {
        "start": 520400,
        "stop": 520800,
        "text": " And maybe we do use it for comment threads or something."
      },
      {
        "start": 520800,
        "stop": 521200,
        "text": " It also solves the old problem. I've been wanting, I've thought about Mastodon and activity up for a long time."
      },
      {
        "start": 521200,
        "stop": 521600,
        "text": " Especially now, these days, right? As what"
      },
      {
        "start": 521600,
        "stop": 522000,
        "text": " little tweeting I do becomes less and less relevant, it solves for us"
      },
      {
        "start": 522000,
        "stop": 522400,
        "text": " at least the problem of what server do we use? Well, we use the one we made."
      },
      {
        "start": 522400,
        "stop": 522800,
        "text": " Of course. Yeah, definitely. That is actually one of my problems with using Mastodon."
      },
      {
        "start": 522800,
        "stop": 523200,
        "text": " I was just thinking, okay, I've got to at least dip my toes in again now during this"
      },
      {
        "start": 523200,
        "stop": 523600,
        "text": " little zeitgeist, right? But what, do I want to make a profile over here to launch it? No!"
      },
      {
        "start": 523600,
        "stop": 524000,
        "text": " And be like, no, I don't really like that home server. It was either I'm going to spin one up for myself"
      },
      {
        "start": 524000,
        "stop": 524400,
        "text": " or maybe we just make a network one. Yeah, I've"
      },
      {
        "start": 524400,
        "stop": 524800,
        "text": " enjoyed the podcasting Mastodon instance. The podcasting 2.0"
      },
      {
        "start": 524800,
        "stop": 525200,
        "text": " community's Mastodon instance because it's very specific. I see someone spun up one for the"
      },
      {
        "start": 525200,
        "stop": 525600,
        "text": " closure community. I thought about that one. But again, I don't know, maybe I want my"
      },
      {
        "start": 525600,
        "stop": 526000,
        "text": " like more social show account on something a little more general. I don't know."
      },
      {
        "start": 526000,
        "stop": 526400,
        "text": " Nothing matters. It's all better. I get that. True Grits boosted in some Enterprise sats."
      },
      {
        "start": 526400,
        "stop": 526800,
        "text": " Make it so. 17.01 to a plus one"
      },
      {
        "start": 526800,
        "stop": 527200,
        "text": " the idea of setting up Mastodon. I'm going to link in the show notes to"
      },
      {
        "start": 527200,
        "stop": 527600,
        "text": " a pretty solid blog post around the issues of"
      },
      {
        "start": 527600,
        "stop": 528000,
        "text": " scaling Mastodon. The blog post written November 14th, 2022."
      },
      {
        "start": 528000,
        "stop": 528400,
        "text": " Scaling Mastodon is impossible."
      },
      {
        "start": 528400,
        "stop": 528800,
        "text": " And I kind of feel like this is the deal with Matrix. Like if I would have known"
      },
      {
        "start": 528800,
        "stop": 529200,
        "text": " what I know now, I would have set up a Matrix server that is just"
      },
      {
        "start": 529200,
        "stop": 529600,
        "text": " limited to the staff at JB. And then I would have had everybody go create a"
      },
      {
        "start": 529600,
        "stop": 530000,
        "text": " Matrix.org account and then join our server. We didn't. We opened it up"
      },
      {
        "start": 530000,
        "stop": 530400,
        "text": " and now we have 4,000 accounts on that server."
      },
      {
        "start": 530400,
        "stop": 530800,
        "text": " We have 4,000 accounts and it's a big server and it's a lot to manage."
      },
      {
        "start": 530800,
        "stop": 531200,
        "text": " But like now I know, right? Like I"
      },
      {
        "start": 531200,
        "stop": 531600,
        "text": " tried PeerTube once and that didn't go very well."
      },
      {
        "start": 531600,
        "stop": 532000,
        "text": " And then I came at PeerTube again and I did what I call the minimum viable PeerTube setup"
      },
      {
        "start": 532000,
        "stop": 532400,
        "text": " where it's very focused, it's very limited. It is part of the Phetorverse technically."
      },
      {
        "start": 532400,
        "stop": 532800,
        "text": " Although I don't think it's Phetorated. It might be technically Phetorated but I don't know."
      },
      {
        "start": 532800,
        "stop": 533200,
        "text": " Maybe not. Like I do see some posts from other people"
      },
      {
        "start": 533200,
        "stop": 533600,
        "text": " on there. So it's in some sort of Phetoration but I don't."
      },
      {
        "start": 533600,
        "stop": 534000,
        "text": " I went for very minimum. Right? And I could see doing something similar with the JB server."
      },
      {
        "start": 534000,
        "stop": 534400,
        "text": " I could see us being kind of connected but overall being pretty"
      },
      {
        "start": 534400,
        "stop": 534800,
        "text": " much on our own little island."
      },
      {
        "start": 534800,
        "stop": 535200,
        "text": " Live boost coming in right now. We got 15,000 sats from user475"
      },
      {
        "start": 535200,
        "stop": 535600,
        "text": " saying Westpaint2024. That's CircusFreak I believe."
      },
      {
        "start": 535600,
        "stop": 536000,
        "text": " I would vote for Westpaint in 2024."
      },
      {
        "start": 536000,
        "stop": 536400,
        "text": " I have to warn you. If you put Wes in charge you'd be surprised. He does have"
      },
      {
        "start": 536400,
        "stop": 536800,
        "text": " a little bit of a dictator in him. -I mean, you know, I like things a certain way."
      },
      {
        "start": 536800,
        "stop": 537200,
        "text": " Now everyone who listens to Jupiter broadcasting shows won't have to change their lifestyle."
      },
      {
        "start": 537200,
        "stop": 537600,
        "text": " So you guys won't be affected. -No, you'll be just grandfathered in."
      },
      {
        "start": 537600,
        "stop": 538000,
        "text": " We'll have to take a few more math classes though. Sorry about that. -We did get"
      },
      {
        "start": 538000,
        "stop": 538400,
        "text": " 25,000 boosts just a couple of seconds later."
      },
      {
        "start": 538400,
        "stop": 538800,
        "text": " Curious concept boosted live while listening."
      },
      {
        "start": 538800,
        "stop": 539200,
        "text": " Hey, really enjoying the livestream. I would love to see the value streaming enabled for the member"
      },
      {
        "start": 539200,
        "stop": 539600,
        "text": " feeds. Long time listener, first time booster. Go podcasting! Yes."
      },
      {
        "start": 539600,
        "stop": 540000,
        "text": " It's on the list. -It is on the list. Wes, what can we say about the"
      },
      {
        "start": 540000,
        "stop": 540400,
        "text": " custom RSS feeds? What update do we have for that? Because I know you and I have been discussing"
      },
      {
        "start": 540400,
        "stop": 540800,
        "text": " a lot. -Yeah, we've got some prototypical work in the"
      },
      {
        "start": 540800,
        "stop": 541200,
        "text": " offing. -There is that, and we're getting pretty serious"
      },
      {
        "start": 541200,
        "stop": 541600,
        "text": " about essentially building a lot of the backend infrastructure we need to move"
      },
      {
        "start": 541600,
        "stop": 542000,
        "text": " off of Fireside 2 in this result. So the results"
      },
      {
        "start": 542000,
        "stop": 542400,
        "text": " may be we end up self-hosting a lot more infrastructure than we expected to enable this."
      },
      {
        "start": 542400,
        "stop": 542800,
        "text": " It's not like the scope is going crazy, but"
      },
      {
        "start": 542800,
        "stop": 543200,
        "text": " when we start talking about what's really involved in generating our own RSS feeds"
      },
      {
        "start": 543200,
        "stop": 543600,
        "text": " we end up with the question of"
      },
      {
        "start": 543600,
        "stop": 544000,
        "text": " what's Fireside doing? And that's what we use today to host our shows."
      },
      {
        "start": 544000,
        "stop": 544400,
        "text": " There's a few different, call them generations of plans, you know?"
      },
      {
        "start": 544400,
        "stop": 544800,
        "text": " Because we've got to keep things A, operating as they are."
      },
      {
        "start": 544800,
        "stop": 545200,
        "text": " B, the shows are the focus. And then C, we want to, you know, test"
      },
      {
        "start": 545200,
        "stop": 545600,
        "text": " the waters out as they make sense and have smooth transitions. Because"
      },
      {
        "start": 545600,
        "stop": 546000,
        "text": " especially with, you know, it's one thing when you have a closed platform and you make updates"
      },
      {
        "start": 546000,
        "stop": 546400,
        "text": " where you can just forcibly tell all your clients they've got to refresh, but"
      },
      {
        "start": 546400,
        "stop": 546800,
        "text": " in a distributed world like podcasting you want to get it right the first time."
      },
      {
        "start": 546800,
        "stop": 547200,
        "text": " Because you never know what system cached what you just put out there. -I would expect"
      },
      {
        "start": 547200,
        "stop": 547600,
        "text": " that we would probably start experimenting with office hours first."
      },
      {
        "start": 547600,
        "stop": 548000,
        "text": " Right? And so if we, you know, want to make"
      },
      {
        "start": 548000,
        "stop": 548400,
        "text": " any radical changes, that's probably where it happens. -Yeah, I think office hours"
      },
      {
        "start": 548400,
        "stop": 548800,
        "text": " and then some of the, as mentioned here, some of the member feeds. You know?"
      },
      {
        "start": 548800,
        "stop": 549200,
        "text": " Folks that obviously appreciate us enough to put up with some of our"
      },
      {
        "start": 549200,
        "stop": 549600,
        "text": " shenanigans. -Running with scissors, as they say."
      },
      {
        "start": 549600,
        "stop": 550000,
        "text": " We've got even more boosts in, Elray boosted in, of our website"
      },
      {
        "start": 550000,
        "stop": 550400,
        "text": " fame. A row of ducks."
      },
      {
        "start": 550400,
        "stop": 550800,
        "text": " He says, \"How about Mastodon for comments on each episode?\""
      },
      {
        "start": 550800,
        "stop": 551200,
        "text": " Links to an article for using Mastodon for comments on a static"
      },
      {
        "start": 551200,
        "stop": 551600,
        "text": " blog. Which, so I think his idea here is to use"
      },
      {
        "start": 551600,
        "stop": 552000,
        "text": " Mastodon for comments on our website, which sounds kind of"
      },
      {
        "start": 552000,
        "stop": 552400,
        "text": " intriguing. Says, \"I've always wanted a comment section for JB episodes.\""
      },
      {
        "start": 552400,
        "stop": 552800,
        "text": " Well, you know who we should ask about that? We should ask Elray about that."
      },
      {
        "start": 552800,
        "stop": 553200,
        "text": " Elray might know. -Yeah, Elray might know. Elray double boosted in"
      },
      {
        "start": 553200,
        "stop": 553600,
        "text": " with another row of ducks. -Double boost?"
      },
      {
        "start": 553600,
        "stop": 554000,
        "text": " I've personally loved the ZSIS"
      },
      {
        "start": 554000,
        "stop": 554400,
        "text": " auto ZSIS snapshotting when I installed the package. I've traveled packages"
      },
      {
        "start": 554400,
        "stop": 554800,
        "text": " out before and took note of auto ZSIS ID, rolled"
      },
      {
        "start": 554800,
        "stop": 555200,
        "text": " back when I didn't like it. Much cleaner than App to Remove. Definitely"
      },
      {
        "start": 555200,
        "stop": 555600,
        "text": " not all rainbows and sunshine though, and feels a bit cludgy"
      },
      {
        "start": 555600,
        "stop": 556000,
        "text": " at times. For me though, I go out of my way to use Ubuntu MATE."
      },
      {
        "start": 556000,
        "stop": 556400,
        "text": " While I do like and prefer KDE and install Kubuntu on top"
      },
      {
        "start": 556400,
        "stop": 556800,
        "text": " because Kubuntu doesn't or didn't have ZFS"
      },
      {
        "start": 556800,
        "stop": 557200,
        "text": " in their installer. -Ah, that kind of makes sense. Don't worry"
      },
      {
        "start": 557200,
        "stop": 557600,
        "text": " about whatever Canonical's deciding to do or not do with ZFS auto setup"
      },
      {
        "start": 557600,
        "stop": 558000,
        "text": " for you, and then as long as you're comfortable with it, you can get Kubuntu"
      },
      {
        "start": 558000,
        "stop": 558400,
        "text": " on top. You can then switch back over to whatever you're..."
      },
      {
        "start": 558400,
        "stop": 558800,
        "text": " With MATE, you've got your baseline. You don't have to worry about ZFS setup. You can set it up"
      },
      {
        "start": 558800,
        "stop": 559200,
        "text": " yourself and then install whatever DE you want on top. Because the spins are"
      },
      {
        "start": 559200,
        "stop": 559600,
        "text": " that, right? You can still get all the back-ends. -And that's pretty much how it works"
      },
      {
        "start": 559600,
        "stop": 560000,
        "text": " for all the other distros anyways. So..."
      },
      {
        "start": 560000,
        "stop": 560400,
        "text": " I have to say El-Ray. I say El-Ray because I have a neighbor named El-Ray. So it's very"
      },
      {
        "start": 560400,
        "stop": 560800,
        "text": " hard because that's how they spell their name too. So it's very hard. But I agree."
      },
      {
        "start": 560800,
        "stop": 561200,
        "text": " I think as long as Canonical continues to ship that kernel module"
      },
      {
        "start": 561200,
        "stop": 561600,
        "text": " and all the software packages you would need in the repo to use that,"
      },
      {
        "start": 561600,
        "stop": 562000,
        "text": " then go with your traditional Kubuntu install. Maybe do"
      },
      {
        "start": 562000,
        "stop": 562400,
        "text": " the real base layout in the installer, and then keep your data"
      },
      {
        "start": 562400,
        "stop": 562800,
        "text": " drive separately and just set that up after the install is complete. Maybe using GParted or using"
      },
      {
        "start": 562800,
        "stop": 563200,
        "text": " the command line tools. Because as long as you have the ZFS packages and the kernel module,"
      },
      {
        "start": 563200,
        "stop": 563600,
        "text": " you're good to go. -Now Chris, do you have any recommendations for what file system you use on your"
      },
      {
        "start": 563600,
        "stop": 564000,
        "text": " root partition? -You know Wes, it probably should be something"
      },
      {
        "start": 564000,
        "stop": 564400,
        "text": " that's free software, that's upstream on the Linux"
      },
      {
        "start": 564400,
        "stop": 564800,
        "text": " kernel, ideally supports compression, maybe snapshots..."
      },
      {
        "start": 564800,
        "stop": 565200,
        "text": " -Oh. -Oh. -Oh. -No, not... I don't want the shadow copies."
      },
      {
        "start": 565200,
        "stop": 565600,
        "text": " I want real snapshots. So Wes, I go with"
      },
      {
        "start": 565600,
        "stop": 566000,
        "text": " Butter. Not Marjorin, I go with Butter FS. That's right, Butter FS."
      },
      {
        "start": 566000,
        "stop": 566400,
        "text": " -It turns out El-Ray triple boosted this week with"
      },
      {
        "start": 566400,
        "stop": 566800,
        "text": " another row of ducks."
      },
      {
        "start": 566800,
        "stop": 567200,
        "text": " [music]"
      },
      {
        "start": 567200,
        "stop": 567600,
        "text": " This one's about the geocaching mixups we've been leading to the last few weeks."
      },
      {
        "start": 567600,
        "stop": 568000,
        "text": " -Who? -Who us? No. We're not tracking stuff"
      },
      {
        "start": 568000,
        "stop": 568400,
        "text": " properly? -I think last week we tried to clear it up. I'm not sure we successfully"
      },
      {
        "start": 568400,
        "stop": 568800,
        "text": " did that. He says, \"I definitely think we need a better way for"
      },
      {
        "start": 568800,
        "stop": 569200,
        "text": " submitting, updating, and displaying geocache info on the website somewhere."
      },
      {
        "start": 569200,
        "stop": 569600,
        "text": " That way listeners can update the info and not have this kind of confusion"
      },
      {
        "start": 569600,
        "stop": 570000,
        "text": " happen again.\" -It does seem clear we need some kind of coordination somewhere."
      },
      {
        "start": 570000,
        "stop": 570400,
        "text": " GitHub repo, website, anywhere? -Yeah, no."
      },
      {
        "start": 570400,
        "stop": 570800,
        "text": " Although there is one part I like. If we were better, if we"
      },
      {
        "start": 570800,
        "stop": 571200,
        "text": " set one specific method, I do like the reveal on air."
      },
      {
        "start": 571200,
        "stop": 571600,
        "text": " -I agree. -There's something about the, like, if someone boosted in"
      },
      {
        "start": 571600,
        "stop": 572000,
        "text": " or emailed in versus... Not that I'm... I love GitHub, but"
      },
      {
        "start": 572000,
        "stop": 572400,
        "text": " sort of a, like, we get to decide when we announce that it's been bad. -That's a"
      },
      {
        "start": 572400,
        "stop": 572800,
        "text": " great point, Wes. -The downside is there might be a little delta between shows, a weak delta, where it's been"
      },
      {
        "start": 572800,
        "stop": 573200,
        "text": " found and someone might be looking for it still. But, it's a trade-off."
      },
      {
        "start": 573200,
        "stop": 573600,
        "text": " First of all, I'm embarrassed. Elray is completely right. This obviously"
      },
      {
        "start": 573600,
        "stop": 574000,
        "text": " should just be something that we have on the website. And I'm still, I'm so used"
      },
      {
        "start": 574000,
        "stop": 574400,
        "text": " to a decade of a website that we hate and don't use, that"
      },
      {
        "start": 574400,
        "stop": 574800,
        "text": " I didn't even think of that. And I apologize because our community has done incredible"
      },
      {
        "start": 574800,
        "stop": 575200,
        "text": " work on a new website, and I'm still wrapping around just my whole noodle"
      },
      {
        "start": 575200,
        "stop": 575600,
        "text": " around the concept that our website's usable. So, we totally should have, like,"
      },
      {
        "start": 575600,
        "stop": 576000,
        "text": " a geocaching spot. However we end up updating the information,"
      },
      {
        "start": 576000,
        "stop": 576400,
        "text": " it, the... -Right, we could have, like, an extent, like, these are the live"
      },
      {
        "start": 576400,
        "stop": 576800,
        "text": " geocaches to go... -Yes! -If you want to go help find a geocache, boom! -Right! -Here's your list of ones"
      },
      {
        "start": 576800,
        "stop": 577200,
        "text": " that are still out in the field. -And, here's how to contact us if you'd like to deploy a"
      },
      {
        "start": 577200,
        "stop": 577600,
        "text": " geocache in your area. And the fact that I didn't"
      },
      {
        "start": 577600,
        "stop": 578000,
        "text": " think of the website as the ultimate destination for that is totally my bad. It's,"
      },
      {
        "start": 578000,
        "stop": 578400,
        "text": " it is just a, it is a bad habit that I'll try to break."
      },
      {
        "start": 578400,
        "stop": 578800,
        "text": " But Wes is right. He brings up a good point. Like, we do need to consider the reveal"
      },
      {
        "start": 578800,
        "stop": 579200,
        "text": " and how we want to do that. So, maybe this is something where we move to office hours."
      },
      {
        "start": 579200,
        "stop": 579600,
        "text": " -Well, I feel like maybe Elray just volunteered to help make this"
      },
      {
        "start": 579600,
        "stop": 580000,
        "text": " a reality. I know I pledged a few weeks ago that I would make it happen, but clearly"
      },
      {
        "start": 580000,
        "stop": 580400,
        "text": " I didn't. And so, we do have an issue open, if anyone's"
      },
      {
        "start": 580400,
        "stop": 580800,
        "text": " interested in helping us with this, that has been, it's many weeks old,"
      },
      {
        "start": 580800,
        "stop": 581200,
        "text": " and there are some amazing ideas on how to accomplish this in there, and I feel like"
      },
      {
        "start": 581200,
        "stop": 581600,
        "text": " maybe that's a great place to start. So, help us out. -Yeah."
      },
      {
        "start": 581600,
        "stop": 582000,
        "text": " -4.12 Linux came in with 10.24 SATs. Great show, gentlemen."
      },
      {
        "start": 582000,
        "stop": 582400,
        "text": " Thank you for all your efforts every single week."
      },
      {
        "start": 582400,
        "stop": 582800,
        "text": " I know it can't be easy. Just know that your efforts every week help boost"
      },
      {
        "start": 582800,
        "stop": 583200,
        "text": " my spirits in those trying times. No matter what life throws at me,"
      },
      {
        "start": 583200,
        "stop": 583600,
        "text": " I know there's always a bright spot each Sunday evening waiting for me and my podcast"
      },
      {
        "start": 583600,
        "stop": 584000,
        "text": " player. I know that your efforts are, and I want you to know that your efforts"
      },
      {
        "start": 584000,
        "stop": 584400,
        "text": " are greatly appreciated onwards towards 500!"
      },
      {
        "start": 584400,
        "stop": 584800,
        "text": " -That is so gosh darn sweet, 4.12. -Yeah, my math"
      },
      {
        "start": 584800,
        "stop": 585200,
        "text": " is like mid or early March. We're hitting episode 500."
      },
      {
        "start": 585200,
        "stop": 585600,
        "text": " -I'm not ready. -And I, like, part of me wants to do like a real extravaganza"
      },
      {
        "start": 585600,
        "stop": 586000,
        "text": " and then like part of me just wants to do a regular old episode."
      },
      {
        "start": 586000,
        "stop": 586400,
        "text": " I don't, part of me doesn't want to make a big deal because I'm aiming for a thousand, so."
      },
      {
        "start": 586400,
        "stop": 586800,
        "text": " -We could do a regular episode and put out like a special"
      },
      {
        "start": 586800,
        "stop": 587200,
        "text": " bonus or something. That's, no, wait, I'm making more work for us. -Yeah, right, right."
      },
      {
        "start": 587200,
        "stop": 587600,
        "text": " -We're gonna take 500 off and just, we'll see you back in 501."
      },
      {
        "start": 587600,
        "stop": 588000,
        "text": " -It's a club show! -We burned it, right? -But you're definitely gonna have like"
      },
      {
        "start": 588000,
        "stop": 588400,
        "text": " a 500 brew series, right? -We should..."
      },
      {
        "start": 588400,
        "stop": 588800,
        "text": " -Or a cider? -Yeah, cider. -Ooh, I'm gonna do that. -I mean,"
      },
      {
        "start": 588800,
        "stop": 589200,
        "text": " a cider would be really nice. I would really, I personally would enjoy"
      },
      {
        "start": 589200,
        "stop": 589600,
        "text": " cider. I'm enjoying some ciders today, let me tell you what."
      },
      {
        "start": 589600,
        "stop": 590000,
        "text": " -Norkal Geek boosts in with 8,080"
      },
      {
        "start": 590000,
        "stop": 590400,
        "text": " sets. -Coming in hot with the boost! -So, impossible"
      },
      {
        "start": 590400,
        "stop": 590800,
        "text": " idea to increase peer-to-peer. JB creates"
      },
      {
        "start": 590800,
        "stop": 591200,
        "text": " a headless peer machine image that can run"
      },
      {
        "start": 591200,
        "stop": 591600,
        "text": " on a Linode. Audience members add the image to their Linode accounts"
      },
      {
        "start": 591600,
        "stop": 592000,
        "text": " and then on a Sunday morning, audience members could spin up a Linode"
      },
      {
        "start": 592000,
        "stop": 592400,
        "text": " using that JB image. Then at the end of the day, just destroy the"
      },
      {
        "start": 592400,
        "stop": 592800,
        "text": " Linode, keep the image. Might cost a few bucks a week to run the instance and store the"
      },
      {
        "start": 592800,
        "stop": 593200,
        "text": " image, but I'd do it. Thoughts? -You know,"
      },
      {
        "start": 593200,
        "stop": 593600,
        "text": " this is clever, especially if we could do like a stack script, because Linode has stack scripts. -Yeah, something we could"
      },
      {
        "start": 593600,
        "stop": 594000,
        "text": " just easily publish on there and be like, here you go, and it's all pre-setup and..."
      },
      {
        "start": 594000,
        "stop": 594400,
        "text": " -The challenge is how? Like, how do you"
      },
      {
        "start": 594400,
        "stop": 594800,
        "text": " get a headless instance to act as a peer"
      },
      {
        "start": 594800,
        "stop": 595200,
        "text": " to a peer-to-stream? Because it's, it is both"
      },
      {
        "start": 595200,
        "stop": 595600,
        "text": " bit torrent, but it is also, there's a WebRTC component as well."
      },
      {
        "start": 595600,
        "stop": 596000,
        "text": " I bet something like Playwright or Selenium, you know, that might"
      },
      {
        "start": 596000,
        "stop": 596400,
        "text": " work. But maybe you could have like a full instance that federates and restreems."
      },
      {
        "start": 596400,
        "stop": 596800,
        "text": " I'm not sure what the options are, we need to do a little more research I think. But, some"
      },
      {
        "start": 596800,
        "stop": 597200,
        "text": " promising tools there, NorCalGeek. Thank you. -Yeah, thank you very much."
      },
      {
        "start": 597200,
        "stop": 597600,
        "text": " -You know, I want to say on that topic that Jack reached out to us as well from the UK"
      },
      {
        "start": 597600,
        "stop": 598000,
        "text": " and offered some hosting on our part, so I think we're going to have to"
      },
      {
        "start": 598000,
        "stop": 598400,
        "text": " figure that out and take them up on that offer. -Yes, yeah, that, now we just"
      },
      {
        "start": 598400,
        "stop": 598800,
        "text": " got to figure out how to add a peer to our peer-to-stream"
      },
      {
        "start": 598800,
        "stop": 599200,
        "text": " headless. And I think one of the other tricky things in there is"
      },
      {
        "start": 599200,
        "stop": 599600,
        "text": " say you have a bit of bandwidth and you have some"
      },
      {
        "start": 599600,
        "stop": 600000,
        "text": " hardware you want to throw at it, how does your machine know when we have a new stream?"
      },
      {
        "start": 600000,
        "stop": 600400,
        "text": " And how do you become a peer to the latest stream? If you want this"
      },
      {
        "start": 600400,
        "stop": 600800,
        "text": " to run 24/7, how do we manage that? And I know PeerTube offers an API"
      },
      {
        "start": 600800,
        "stop": 601200,
        "text": " because we use that for our new website, so maybe there's something there, but I actually"
      },
      {
        "start": 601200,
        "stop": 601600,
        "text": " don't think there's anything built around this right now. -Maybe we need like a little, like a fun"
      },
      {
        "start": 601600,
        "stop": 602000,
        "text": " bootstrap script that sort of like, the tech"
      },
      {
        "start": 602000,
        "stop": 602400,
        "text": " pulls our peer tube, looks for like a live stream, and then gets something going that'll"
      },
      {
        "start": 602400,
        "stop": 602800,
        "text": " just start watching it. I don't know. -I think that actually could be it, Wes."
      },
      {
        "start": 602800,
        "stop": 603200,
        "text": " We just need somebody to create it."
      },
      {
        "start": 603200,
        "stop": 603600,
        "text": " I think this makes Circus Freak the biggest baller of the episode"
      },
      {
        "start": 603600,
        "stop": 604000,
        "text": " because just right now, as we're recording, 40,000 sets coming"
      },
      {
        "start": 604000,
        "stop": 604400,
        "text": " in live! Forget figuring out about what distro to go with."
      },
      {
        "start": 604400,
        "stop": 604800,
        "text": " In 2023, JB needs to create the JB Linux distro."
      },
      {
        "start": 604800,
        "stop": 605200,
        "text": " Fun story, Circus Freak."
      },
      {
        "start": 605200,
        "stop": 605600,
        "text": " That's how Jupiter broadcasting started. That's how we started. Brian"
      },
      {
        "start": 605600,
        "stop": 606000,
        "text": " Lenduke and I were going to create a new desktop OS, don't call it a Linux distro,"
      },
      {
        "start": 606000,
        "stop": 606400,
        "text": " and we were going to call it Jupiter. And we had all these ideas about the design"
      },
      {
        "start": 606400,
        "stop": 606800,
        "text": " and the flow, and we'd probably have some bookmarks in there that when you opened up"
      },
      {
        "start": 606800,
        "stop": 607200,
        "text": " Firefox, it would take you to like our website or whatever. And we were coming"
      },
      {
        "start": 607200,
        "stop": 607600,
        "text": " up with this idea, and we were talking about it on this new podcast"
      },
      {
        "start": 607600,
        "stop": 608000,
        "text": " that we had called the Linux Action Show. -I've heard of that. -Yeah."
      },
      {
        "start": 608000,
        "stop": 608400,
        "text": " And we realized that we were way better at talking about it"
      },
      {
        "start": 608400,
        "stop": 608800,
        "text": " than we were at doing it. -Ain't that the truth."
      },
      {
        "start": 608800,
        "stop": 609200,
        "text": " So we realized maybe we should focus on this podcasting thing"
      },
      {
        "start": 609200,
        "stop": 609600,
        "text": " and let other people do this Linux thing. And then these crazy"
      },
      {
        "start": 609600,
        "stop": 610000,
        "text": " cats came together at this elementary OS project, and their first release"
      },
      {
        "start": 610000,
        "stop": 610400,
        "text": " was called Jupiter. And, well, the rest"
      },
      {
        "start": 610400,
        "stop": 610800,
        "text": " is history. So thank you for the baller boosts, Circus Freak."
      },
      {
        "start": 610800,
        "stop": 611200,
        "text": " We appreciate it. -Deck sword"
      },
      {
        "start": 611200,
        "stop": 611600,
        "text": " boosts in with a prediction boost of 2023 cents."
      },
      {
        "start": 611600,
        "stop": 612000,
        "text": " I predict that by 2025, JB"
      },
      {
        "start": 612000,
        "stop": 612400,
        "text": " is earning as much in boosts as Jupiter.party subs"
      },
      {
        "start": 612400,
        "stop": 612800,
        "text": " per quarter. -In 2025, huh?"
      },
      {
        "start": 612800,
        "stop": 613200,
        "text": " Maybe. -2023 cents, not 2025."
      },
      {
        "start": 613200,
        "stop": 613600,
        "text": " -Well 2023 is because it's a prediction boost."
      },
      {
        "start": 613600,
        "stop": 614000,
        "text": " But it's a prediction for 2025, so it probably should have been 2029."
      },
      {
        "start": 614000,
        "stop": 614400,
        "text": " We'll see. I'm curious about that, really. It's two different"
      },
      {
        "start": 614400,
        "stop": 614800,
        "text": " total business models. The membership system"
      },
      {
        "start": 614800,
        "stop": 615200,
        "text": " does kind of encourage exclusive access, whereas the"
      },
      {
        "start": 615200,
        "stop": 615600,
        "text": " podcasting 2.0 system and the boost kind of encourages"
      },
      {
        "start": 615600,
        "stop": 616000,
        "text": " it's open to everybody, but then you just supply the value you think it's worth."
      },
      {
        "start": 616000,
        "stop": 616400,
        "text": " And both of them seem like they have their roles. Like I can see,"
      },
      {
        "start": 616400,
        "stop": 616800,
        "text": " to me, the memberships seem like the Jupiter party and our"
      },
      {
        "start": 616800,
        "stop": 617200,
        "text": " unplugged core contributors. That's really investing on the ongoing production."
      },
      {
        "start": 617200,
        "stop": 617600,
        "text": " Say like next year, every advertiser walked from the show."
      },
      {
        "start": 617600,
        "stop": 618000,
        "text": " Our members would be what's paying the bill for the show to still get out, right?"
      },
      {
        "start": 618000,
        "stop": 618400,
        "text": " Boosters are coming in thanking us for that particular production, and the"
      },
      {
        "start": 618400,
        "stop": 618800,
        "text": " production itself, right? That's the end result. They're boosting us for the end result."
      },
      {
        "start": 618800,
        "stop": 619200,
        "text": " They're two different things, and I wonder, do they even"
      },
      {
        "start": 619200,
        "stop": 619600,
        "text": " supplant each other? I think the challenge for us going forward is to"
      },
      {
        "start": 619600,
        "stop": 620000,
        "text": " offer the same things for each group. -A consistent, unified"
      },
      {
        "start": 620000,
        "stop": 620400,
        "text": " experience. -Yeah. I think that's probably our 2023"
      },
      {
        "start": 620400,
        "stop": 620800,
        "text": " shrugs. But we're totally up for it. We're here. -Oh, well"
      },
      {
        "start": 620800,
        "stop": 621200,
        "text": " right on topic. Someone that's been doing a lot of work that helps us in our"
      },
      {
        "start": 621200,
        "stop": 621600,
        "text": " schemes here. A boost from Alex Gates, the podcasting"
      },
      {
        "start": 621600,
        "stop": 622000,
        "text": " 2.0 consultant. -Coming in hot with the boost! -9001,"
      },
      {
        "start": 622000,
        "stop": 622400,
        "text": " Satoshi's. Activity pub services"
      },
      {
        "start": 622400,
        "stop": 622800,
        "text": " are just inboxes and outboxes of JSON payloads."
      },
      {
        "start": 622800,
        "stop": 623200,
        "text": " Mastodon specifically tries to pull in everything, media"
      },
      {
        "start": 623200,
        "stop": 623600,
        "text": " included. And now here's where I reveal, it's a double"
      },
      {
        "start": 623600,
        "stop": 624000,
        "text": " boost? We got 10,001 sats."
      },
      {
        "start": 624000,
        "stop": 624400,
        "text": " Linking to an activity pub post in PC20, super easy."
      },
      {
        "start": 624400,
        "stop": 624800,
        "text": " I recommend spending up Pleroma or GoToSocial."
      },
      {
        "start": 624800,
        "stop": 625200,
        "text": " -PC20, PC is actually podcasting 2.0."
      },
      {
        "start": 625200,
        "stop": 625600,
        "text": " So he recommends Pleroma. -Pleroma or GoToSocial"
      },
      {
        "start": 625600,
        "stop": 626000,
        "text": " sounds like Alex is running Pleroma on a one-core Linode, personally."
      },
      {
        "start": 626000,
        "stop": 626400,
        "text": " And again, right, that's the whole activity pub stuff, is run"
      },
      {
        "start": 626400,
        "stop": 626800,
        "text": " whatever client speaks activity pub and then, you know, that'll display the stuff. Now you might have"
      },
      {
        "start": 626800,
        "stop": 627200,
        "text": " different features implemented or experienced or what your timeline, all the things look like."
      },
      {
        "start": 627200,
        "stop": 627600,
        "text": " But you can still interrupt. -Can I tell you, this is me because I'm"
      },
      {
        "start": 627600,
        "stop": 628000,
        "text": " such an asshole, I am inclined to want to load Pleroma"
      },
      {
        "start": 628000,
        "stop": 628400,
        "text": " just simply because everything I've been told so far is like the tool of the alt-right."
      },
      {
        "start": 628400,
        "stop": 628800,
        "text": " And I'm like, alright, I hear this all the time about Bitcoin too and it's"
      },
      {
        "start": 628800,
        "stop": 629200,
        "text": " always bullsh*t. And it's a technology and people can choose"
      },
      {
        "start": 629200,
        "stop": 629600,
        "text": " to use it in different ways. And so I, I almost want"
      },
      {
        "start": 629600,
        "stop": 630000,
        "text": " to run Pleroma just because I want to be counter to the narrative out there that it's"
      },
      {
        "start": 630000,
        "stop": 630400,
        "text": " used for like, whatever. -You and your fun new socialist Pleroma instance."
      },
      {
        "start": 630400,
        "stop": 630800,
        "text": " I'm all about it. -Yeah, exactly. The progressive Pleroma home."
      },
      {
        "start": 630800,
        "stop": 631200,
        "text": " No, I just, I'm contrarian and I don't like ascribing one technology"
      },
      {
        "start": 631200,
        "stop": 631600,
        "text": " as evil or good. And I also,"
      },
      {
        "start": 631600,
        "stop": 632000,
        "text": " again, feel like this might be the dendrite to the core Matrix"
      },
      {
        "start": 632000,
        "stop": 632400,
        "text": " instance. So I'm kind of thinking Pleroma could be what we need for just a"
      },
      {
        "start": 632400,
        "stop": 632800,
        "text": " handful of us. -Could be. Okay, well, another reveal here."
      },
      {
        "start": 632800,
        "stop": 633200,
        "text": " It's a triple boost!"
      },
      {
        "start": 633200,
        "stop": 633600,
        "text": " [music]"
      },
      {
        "start": 633600,
        "stop": 634000,
        "text": " This time, 10,002 sats. And this one, I think, I mean, Alex knows what's"
      },
      {
        "start": 634000,
        "stop": 634400,
        "text": " up generally, but right here. It's best to get your"
      },
      {
        "start": 634400,
        "stop": 634800,
        "text": " activity pub domain now and start the habit of posting."
      },
      {
        "start": 634800,
        "stop": 635200,
        "text": " Massdawn sucks, but its API is becoming the S3"
      },
      {
        "start": 635200,
        "stop": 635600,
        "text": " of activity pub. And it just seems like that, I mean, who"
      },
      {
        "start": 635600,
        "stop": 636000,
        "text": " knows what happens, but at least in the current moment right now, it seems like picking a spot,"
      },
      {
        "start": 636000,
        "stop": 636400,
        "text": " getting your domain, getting your namespace, and all set up so you've got an identity"
      },
      {
        "start": 636400,
        "stop": 636800,
        "text": " in the fetaverse. Is there a better time than now? Probably not. -Probably not."
      },
      {
        "start": 636800,
        "stop": 637200,
        "text": " And I think Alex's point that activity pub"
      },
      {
        "start": 637200,
        "stop": 637600,
        "text": " itself is what's going to become critical, especially for podcasters. That"
      },
      {
        "start": 637600,
        "stop": 638000,
        "text": " is, I think, some really solid insight. And then to say it's kind of becoming"
      },
      {
        "start": 638000,
        "stop": 638400,
        "text": " Massdawn itself is kind of becoming like the S3"
      },
      {
        "start": 638400,
        "stop": 638800,
        "text": " of activity pub is an interesting insight"
      },
      {
        "start": 638800,
        "stop": 639200,
        "text": " because S3 has kind of become this universal way that people"
      },
      {
        "start": 639200,
        "stop": 639600,
        "text": " Linode offers S3 object storage, right? Minnow offers"
      },
      {
        "start": 639600,
        "stop": 640000,
        "text": " S3 object storage for anybody that wants to deploy it on their own system, like it's just become a standard."
      },
      {
        "start": 640000,
        "stop": 640400,
        "text": " Yeah, right, instead of activity pub, we're just going to hear like, \"Oh yeah, this is another Massdawn"
      },
      {
        "start": 640400,
        "stop": 640800,
        "text": " compatible social media platform that you can self-post.\" -I think so, maybe."
      },
      {
        "start": 640800,
        "stop": 641200,
        "text": " Okay, okay. I know. I lied before. It's actually a quad"
      },
      {
        "start": 641200,
        "stop": 641600,
        "text": " post. -What?! -Hey Richard! -This has got to make him a baller!"
      },
      {
        "start": 641600,
        "stop": 642000,
        "text": " I think so. Because it's 10,003"
      },
      {
        "start": 642000,
        "stop": 642400,
        "text": " sets this time. You see the nice little indexing going on there? -That's..."
      },
      {
        "start": 642400,
        "stop": 642800,
        "text": " Hold up. Stop the show. Alex, you"
      },
      {
        "start": 642800,
        "stop": 643200,
        "text": " are a frickin' genius. He iterated his boost"
      },
      {
        "start": 643200,
        "stop": 643600,
        "text": " to make it clear to me what sequential order they were supposed to go in, and I actually have to say"
      },
      {
        "start": 643600,
        "stop": 644000,
        "text": " it worked, because I threw him in there out of order and then realized"
      },
      {
        "start": 644000,
        "stop": 644400,
        "text": " that he sequenced the sats to increment so that way I knew"
      },
      {
        "start": 644400,
        "stop": 644800,
        "text": " what order they were supposed to go in. Alex, this is why"
      },
      {
        "start": 644800,
        "stop": 645200,
        "text": " you're the podcasting 2.0 consultant. That was brilliant. -Although it did get cheaper."
      },
      {
        "start": 645200,
        "stop": 645600,
        "text": " It started out with a 1K increment and then, well, maybe"
      },
      {
        "start": 645600,
        "stop": 646000,
        "text": " just a sat increment, which is entirely reasonable."
      },
      {
        "start": 646000,
        "stop": 646400,
        "text": " Alex boosts in this time just to simply say that his activity"
      },
      {
        "start": 646400,
        "stop": 646800,
        "text": " pub user is @agates@activitypub.agates.io."
      },
      {
        "start": 646800,
        "stop": 647200,
        "text": " Yeah, these usernames are weird. They got an @ in front"
      },
      {
        "start": 647200,
        "stop": 647600,
        "text": " of them, so this is something I gotta learn. So it's @agates, and then it's @ the domain"
      },
      {
        "start": 647600,
        "stop": 648000,
        "text": " which is activitypub.agates.io. -I think the way to think about it is like"
      },
      {
        "start": 648000,
        "stop": 648400,
        "text": " with your regular, you know, with the old school Twitter world, you got the @ at the front and then your username."
      },
      {
        "start": 648400,
        "stop": 648800,
        "text": " Right? But now, because it's federated, your username, well"
      },
      {
        "start": 648800,
        "stop": 649200,
        "text": " it's gotta have its own little name space somewhere, right? And that's where that second @ comes in."
      },
      {
        "start": 649200,
        "stop": 649600,
        "text": " -Okay. -You can just think that there's always a second @ with @Twitter.com, and now"
      },
      {
        "start": 649600,
        "stop": 650000,
        "text": " we're just sort of making that a little more flexible. -Mmmhmm. I love it."
      },
      {
        "start": 650000,
        "stop": 650400,
        "text": " Okay, so I'm rethinking Twitter is kind of like, that's the public forum"
      },
      {
        "start": 650400,
        "stop": 650800,
        "text": " where all interests collide. It's the general, you shout it out"
      },
      {
        "start": 650800,
        "stop": 651200,
        "text": " into the void, and you can maybe net more fish that don't listen to"
      },
      {
        "start": 651200,
        "stop": 651600,
        "text": " or whatever normally. But like, Mastodon, at the"
      },
      {
        "start": 651600,
        "stop": 652000,
        "text": " core of it, why we care is because of ActivityPub. We want to be participating in the"
      },
      {
        "start": 652000,
        "stop": 652400,
        "text": " federation in ActivityPub. I really, really, really, really appreciate you guys"
      },
      {
        "start": 652400,
        "stop": 652800,
        "text": " working with me on this, because I really wasn't seeing the value"
      },
      {
        "start": 652800,
        "stop": 653200,
        "text": " I wasn't getting it, I was just looking at it as a Twitter alternative"
      },
      {
        "start": 653200,
        "stop": 653600,
        "text": " and now I really appreciate it, it's something much larger. And"
      },
      {
        "start": 653600,
        "stop": 654000,
        "text": " I definitely want us to get involved. So I think that's something you'll hear from us very soon."
      },
      {
        "start": 654000,
        "stop": 654400,
        "text": " Belphinwee boosts in with 2,048 sats."
      },
      {
        "start": 654400,
        "stop": 654800,
        "text": " Thanks for the great shows, guys. I really like how you cover a fairly"
      },
      {
        "start": 654800,
        "stop": 655200,
        "text": " wide range of distributions with some focus on more up-to-date ones."
      },
      {
        "start": 655200,
        "stop": 655600,
        "text": " Together with Joe Res's podcast, who seemed to focus a bit more on the stable stuff,"
      },
      {
        "start": 655600,
        "stop": 656000,
        "text": " I find the two of you cover most of what I need to know about Linux, so keep it up!"
      },
      {
        "start": 656000,
        "stop": 656400,
        "text": " Thanks for providing these sats as well. I agree, I"
      },
      {
        "start": 656400,
        "stop": 656800,
        "text": " love it. And you know, our buddy Joe was just on the Self-hosted podcast,"
      },
      {
        "start": 656800,
        "stop": 657200,
        "text": " so if you are a Joe Res fan, go check out selfhosted.show."
      },
      {
        "start": 657200,
        "stop": 657600,
        "text": " AC Bennett Dev boosts in with 400 sats."
      },
      {
        "start": 657600,
        "stop": 658000,
        "text": " First boost."
      },
      {
        "start": 658000,
        "stop": 658400,
        "text": " Hey, congratulations! That's great! Thank you."
      },
      {
        "start": 658400,
        "stop": 658800,
        "text": " They go on. Just started my first"
      },
      {
        "start": 658800,
        "stop": 659200,
        "text": " software engineer job this year after a decade as"
      },
      {
        "start": 659200,
        "stop": 659600,
        "text": " a musician and educator. Wow, that is a huge transformation."
      },
      {
        "start": 659600,
        "stop": 660000,
        "text": " Big transition. You know, I gotta say though, at least for my own"
      },
      {
        "start": 660000,
        "stop": 660400,
        "text": " whatever this means, personal experience working as a dev,"
      },
      {
        "start": 660400,
        "stop": 660800,
        "text": " some of the very best developers I've ever met come from all kinds"
      },
      {
        "start": 660800,
        "stop": 661200,
        "text": " of different backgrounds, and I think creative fields like the arts are often where"
      },
      {
        "start": 661200,
        "stop": 661600,
        "text": " some folks, you know, once you've learned the base toolset, that creativity, the like"
      },
      {
        "start": 661600,
        "stop": 662000,
        "text": " open-mindedness, the ability to think outside the box, really pays dividends."
      },
      {
        "start": 662000,
        "stop": 662400,
        "text": " So you think that some of those skills you learn when you're kind of"
      },
      {
        "start": 662400,
        "stop": 662800,
        "text": " mastering another skill, that translates to software development?"
      },
      {
        "start": 662800,
        "stop": 663200,
        "text": " You just apply it differently. Well I think folks think of it, and"
      },
      {
        "start": 663200,
        "stop": 663600,
        "text": " it's a huge field, right? There's a lot. There's more rote and you just take this thing and apply"
      },
      {
        "start": 663600,
        "stop": 664000,
        "text": " the principle and move on, right? But I think people think about it a little bit more"
      },
      {
        "start": 664000,
        "stop": 664400,
        "text": " like it's cut and paste when it's much closer to what, you know, the art"
      },
      {
        "start": 664400,
        "stop": 664800,
        "text": " side of the world is doing, is sort of trying to figure out, well, I know what could work here, but what's"
      },
      {
        "start": 664800,
        "stop": 665200,
        "text": " the right solution? How do I tweak it to make it fit all the things? You know,"
      },
      {
        "start": 665200,
        "stop": 665600,
        "text": " speaking of our buddy Joe Res and our editor Drew,"
      },
      {
        "start": 665600,
        "stop": 666000,
        "text": " both of them are very creative, and I feel like that creativity has"
      },
      {
        "start": 666000,
        "stop": 666400,
        "text": " made them better audio editors. So I think I could"
      },
      {
        "start": 666400,
        "stop": 666800,
        "text": " kind of see what you're talking about. Like, Drew's an amazing audio editor, but also like an amazing network"
      },
      {
        "start": 666800,
        "stop": 667200,
        "text": " engineer. Yeah, yeah. And he makes great cat songs. So"
      },
      {
        "start": 667200,
        "stop": 667600,
        "text": " that's a great point. Look, we could have a whole segment praising Drew, and"
      },
      {
        "start": 667600,
        "stop": 668000,
        "text": " we should, but he's too cool, he'd cut it out of the final podcast anyway."
      },
      {
        "start": 668000,
        "stop": 668400,
        "text": " Okay, okay. AC Benetdev goes on,"
      },
      {
        "start": 668400,
        "stop": 668800,
        "text": " \"It was a difficult change, but Linux Unplugged and self-hosted really helped"
      },
      {
        "start": 668800,
        "stop": 669200,
        "text": " me get into the tech world and have something to be excited about. Thanks for what"
      },
      {
        "start": 669200,
        "stop": 669600,
        "text": " you do. I'll boost in again when I have some more sats.\" Well,"
      },
      {
        "start": 669600,
        "stop": 670000,
        "text": " thank you. That's fantastic. I don't know if we can take credit for all"
      },
      {
        "start": 670000,
        "stop": 670400,
        "text": " of that, but... No, you did the hard work. We're just here spouting nonsense. Yeah, we're just"
      },
      {
        "start": 670400,
        "stop": 670800,
        "text": " hopefully getting you motivated from time to time, but you're the one that did the actual work, so give yourself"
      },
      {
        "start": 670800,
        "stop": 671200,
        "text": " a good old pat on the back from your buddies here at the Unplugged program."
      },
      {
        "start": 671200,
        "stop": 671600,
        "text": " We got a couple of first-time boosters as well coming into the show. I'm going to say"
      },
      {
        "start": 671600,
        "stop": 672000,
        "text": " it's, uh, MenoRB, let's go with that. Coming in with"
      },
      {
        "start": 672000,
        "stop": 672400,
        "text": " a row of ducks. \"This old duck still got it!\" Finally collected"
      },
      {
        "start": 672400,
        "stop": 672800,
        "text": " some sats on Fountain, and I'm boosting it right here. Well, welcome, Meno."
      },
      {
        "start": 672800,
        "stop": 673200,
        "text": " Glad to have you. HydroGrum, don't know if I got that at all."
      },
      {
        "start": 673200,
        "stop": 673600,
        "text": " Hydrogyrum boosted in. Let's go with Hydrogyrum."
      },
      {
        "start": 673600,
        "stop": 674000,
        "text": " Boosted in with a row of McDucks. 22,222"
      },
      {
        "start": 674000,
        "stop": 674400,
        "text": " sats. \"This old duck still got it!\" Finally got some real sats in the wallet"
      },
      {
        "start": 674400,
        "stop": 674800,
        "text": " and wanted to say thanks for a great podcast. You know,"
      },
      {
        "start": 674800,
        "stop": 675200,
        "text": " I want to say thanks. This was a standout week"
      },
      {
        "start": 675200,
        "stop": 675600,
        "text": " in terms of support from our boosters. Really a standout week."
      },
      {
        "start": 675600,
        "stop": 676000,
        "text": " And not an easy week for me personally, and to see these boosts coming in"
      },
      {
        "start": 676000,
        "stop": 676400,
        "text": " truly made the difference. You guys brought daylight into my night."
      },
      {
        "start": 676400,
        "stop": 676800,
        "text": " And you did it after all of this SBF and FTX"
      },
      {
        "start": 676800,
        "stop": 677200,
        "text": " news. You know, all of this bogus crap in"
      },
      {
        "start": 677200,
        "stop": 677600,
        "text": " the crypto industry that is just totally out of control. And you guys"
      },
      {
        "start": 677600,
        "stop": 678000,
        "text": " saw the signal through the noise. You bought the sats"
      },
      {
        "start": 678000,
        "stop": 678400,
        "text": " and you boosted, or you earned the sats and you boosted in. That's"
      },
      {
        "start": 678400,
        "stop": 678800,
        "text": " really remarkable. Like, you guys get it. It's really something to have an audience that"
      },
      {
        "start": 678800,
        "stop": 679200,
        "text": " is smart enough to discern that"
      },
      {
        "start": 679200,
        "stop": 679600,
        "text": " signal in the noise. And if you haven't boosted in yet and you've been"
      },
      {
        "start": 679600,
        "stop": 680000,
        "text": " thinking about it, why not? The sats are super cheap right now. So you're"
      },
      {
        "start": 680000,
        "stop": 680400,
        "text": " not like, you know, jumping in when they're like $60,000 for a Bitcoin."
      },
      {
        "start": 680400,
        "stop": 680800,
        "text": " It's cheap. You can play around. We don't care that the sats aren't worth what they were"
      },
      {
        "start": 680800,
        "stop": 681200,
        "text": " a couple of months ago. We love getting the sats. So if you haven't yet and you're in the US"
      },
      {
        "start": 681200,
        "stop": 681600,
        "text": " try the Strike app or the Cash app. If you're outside the US try Blue Wallet."
      },
      {
        "start": 681600,
        "stop": 682000,
        "text": " And then go grab Podverse, or go grab Fountain, and"
      },
      {
        "start": 682000,
        "stop": 682400,
        "text": " boost in. Newpodcastapps.com because this"
      },
      {
        "start": 682400,
        "stop": 682800,
        "text": " next boost, it almost made me cry when I got it. And there's just"
      },
      {
        "start": 682800,
        "stop": 683200,
        "text": " there's something about the boosts that are just at the next level beyond anything I've ever"
      },
      {
        "start": 683200,
        "stop": 683600,
        "text": " experienced before. And wise Papa John came in with"
      },
      {
        "start": 683600,
        "stop": 684000,
        "text": " 7,777 sats."
      },
      {
        "start": 684000,
        "stop": 684400,
        "text": " Coming in hot with the boost. And he says, \"It's not really related to the show, but I"
      },
      {
        "start": 684400,
        "stop": 684800,
        "text": " wanted to let you guys know, I just proposed to my girlfriend and she said"
      },
      {
        "start": 684800,
        "stop": 685200,
        "text": " yes.\" How awesome is that? Right? Like"
      },
      {
        "start": 685200,
        "stop": 685600,
        "text": " that is amazing. And his first thought, well I don't know if it was his first thought, but one of his first thoughts"
      },
      {
        "start": 685600,
        "stop": 686000,
        "text": " I got to boost in and tell the boys. Wasn't even listening to her response. He was"
      },
      {
        "start": 686000,
        "stop": 686400,
        "text": " too busy boosting. We get it. Wise Papa John, congratulations."
      },
      {
        "start": 686400,
        "stop": 686800,
        "text": " Very exciting. And Mississippi Mayhem"
      },
      {
        "start": 686800,
        "stop": 687200,
        "text": " also wanted to boost in and also had a great story to share"
      },
      {
        "start": 687200,
        "stop": 687600,
        "text": " with 8,000 sats. Coming in hot with the boost. Hey all, so if you look back at my"
      },
      {
        "start": 687600,
        "stop": 688000,
        "text": " last full boost, I want to let you know there's a lack of a certain"
      },
      {
        "start": 688000,
        "stop": 688400,
        "text": " CLI program. He's talking about Boost CLI. You know how much we love Boost CLI."
      },
      {
        "start": 688400,
        "stop": 688800,
        "text": " We do. We love the Boost CLI. Before you guys chastise me though,"
      },
      {
        "start": 688800,
        "stop": 689200,
        "text": " I swear I have a good excuse. My son has recently developed"
      },
      {
        "start": 689200,
        "stop": 689600,
        "text": " an interest in free software. Maybe by influence, maybe not."
      },
      {
        "start": 689600,
        "stop": 690000,
        "text": " Okay, it's definitely my influence. He's only six years old, so I don't"
      },
      {
        "start": 690000,
        "stop": 690400,
        "text": " expect deep conversations around the philosophy of different licensing models, but"
      },
      {
        "start": 690400,
        "stop": 690800,
        "text": " you know what? He's plenty old enough to understand concepts"
      },
      {
        "start": 690800,
        "stop": 691200,
        "text": " like altruism and sharing. Since then,"
      },
      {
        "start": 691200,
        "stop": 691600,
        "text": " he has roped in his ten year old cousin into building a mind test server"
      },
      {
        "start": 691600,
        "stop": 692000,
        "text": " in our house, which is incredible. Not only"
      },
      {
        "start": 692000,
        "stop": 692400,
        "text": " is he enjoying Minecraft, but he's also been taking the opportunity to learn"
      },
      {
        "start": 692400,
        "stop": 692800,
        "text": " Lua, and on that front he says that he now has"
      },
      {
        "start": 692800,
        "stop": 693200,
        "text": " his own custom blocks and they can build that"
      },
      {
        "start": 693200,
        "stop": 693600,
        "text": " in their mind test server and they absolutely love it. And all the other things, just"
      },
      {
        "start": 693600,
        "stop": 694000,
        "text": " beyond like his son going on, he's also had a pine phone. He's been rocking the"
      },
      {
        "start": 694000,
        "stop": 694400,
        "text": " pine phone, despite its SMS issues and despite two factor authentication,"
      },
      {
        "start": 694400,
        "stop": 694800,
        "text": " he's been enjoying it and he wanted to try to boost in and tell us"
      },
      {
        "start": 694800,
        "stop": 695200,
        "text": " all about it. So he says, \"What am I going to write about?\" I looked back at all this and I realized"
      },
      {
        "start": 695200,
        "stop": 695600,
        "text": " maybe I'll tell you guys about my dog, but that'll be next week."
      },
      {
        "start": 695600,
        "stop": 696000,
        "text": " That was a series of boosts he sent in, 8,000 each time, so that was a"
      },
      {
        "start": 696000,
        "stop": 696400,
        "text": " series of boosts that came out to be three separate messages, all 8,000 sats."
      },
      {
        "start": 696600,
        "stop": 697000,
        "text": " Thank you very much, Mississippi Mayhem."
      },
      {
        "start": 697000,
        "stop": 697400,
        "text": " And to round us out, CircusReek comes in."
      },
      {
        "start": 697400,
        "stop": 697800,
        "text": " I know! Again? Again. With 12,000 sats, he says"
      },
      {
        "start": 697800,
        "stop": 698200,
        "text": " \"I've been a JB listener since 2007.\" Stop it."
      },
      {
        "start": 698200,
        "stop": 698600,
        "text": " Wow. Stop it. You might just have a stalker."
      },
      {
        "start": 698600,
        "stop": 699000,
        "text": " My wife doesn't really even know what Linux is. I've tried. She just doesn't care."
      },
      {
        "start": 699000,
        "stop": 699400,
        "text": " But she knows your voices. Keep up the good work. Hopefully many more decades"
      },
      {
        "start": 699400,
        "stop": 699800,
        "text": " of listening to come. We'll get her, CircusReek!"
      },
      {
        "start": 699800,
        "stop": 700200,
        "text": " We will. It's like osmosis, man. We will get her. I think as long as we get a laugh or two"
      },
      {
        "start": 700200,
        "stop": 700600,
        "text": " occasionally, that's all I'm going for. Wow. What a week, you guys."
      },
      {
        "start": 700600,
        "stop": 701000,
        "text": " Very humbled by all the support. If you'd like to send a boost, go upgrade to a podcasting"
      },
      {
        "start": 701000,
        "stop": 701400,
        "text": " 2.0 app by going to newpodcastapps.com. And if you really, really"
      },
      {
        "start": 701400,
        "stop": 701800,
        "text": " want to impress those, you know, gats-tas, but if you wantstas, try out"
      },
      {
        "start": 701800,
        "stop": 702200,
        "text": " BOOCLI. It just requires that you master so many different things."
      },
      {
        "start": 702200,
        "stop": 702600,
        "text": " No hard feelings if you don't use BOOCLI. We love getting your messages. But if you"
      },
      {
        "start": 702600,
        "stop": 703000,
        "text": " do, you'll get our attention."
      },
      {
        "start": 703000,
        "stop": 703400,
        "text": " Okay, so we got a couple of picks before we run. And"
      },
      {
        "start": 703400,
        "stop": 703800,
        "text": " I felt like maybe all of the talk about Mastodon"
      },
      {
        "start": 703800,
        "stop": 704200,
        "text": " could kind of influence the picks this week."
      },
      {
        "start": 704200,
        "stop": 704600,
        "text": " So we're a bit on theme. You know how I like to be on theme with the picks. And the"
      },
      {
        "start": 704600,
        "stop": 705000,
        "text": " first one I want to recommend is maybe you're not feeling Twitter, but you still see"
      },
      {
        "start": 705000,
        "stop": 705400,
        "text": " conversations, you still see discussions going on. Someone"
      },
      {
        "start": 705400,
        "stop": 705800,
        "text": " sends you a link over there. This is for you. It's a bookmarklet that"
      },
      {
        "start": 705800,
        "stop": 706200,
        "text": " will take the current Twitter page you're looking at and it will then regenerate"
      },
      {
        "start": 706200,
        "stop": 706600,
        "text": " a Nitter link. N-I-T-T-R dot net. A"
      },
      {
        "start": 706600,
        "stop": 707000,
        "text": " Nitter link, which is not only not Twitter, but"
      },
      {
        "start": 707000,
        "stop": 707400,
        "text": " kind of a cleaner, simpler way to look at these threads. So much. I saw you throw this in and"
      },
      {
        "start": 707400,
        "stop": 707800,
        "text": " it was funny. I was like, \"Oh, I've already been using that!\" I thought you were, actually."
      },
      {
        "start": 707800,
        "stop": 708200,
        "text": " I think you found it. And then you didn't tell me about it, but you're like, \"Yeah, I found one!\""
      },
      {
        "start": 708200,
        "stop": 708600,
        "text": " I think I tagged it for the show and then it never made it into the actual show dogs."
      },
      {
        "start": 708600,
        "stop": 709000,
        "text": " So then I wouldn't have found it. I'm like, \"What is he using?\""
      },
      {
        "start": 709000,
        "stop": 709400,
        "text": " So it's Twitter to Nitter. We'll have a link in the show notes. It's just a"
      },
      {
        "start": 709400,
        "stop": 709800,
        "text": " bookmarklet. Here's the problem, right? You're at work. I'm not signing into my personal"
      },
      {
        "start": 709800,
        "stop": 710200,
        "text": " Twitter account on my work machine, but sometimes you still got to browse Twitter"
      },
      {
        "start": 710200,
        "stop": 710600,
        "text": " and maybe this will change, who knows? But the least"
      },
      {
        "start": 710600,
        "stop": 711000,
        "text": " unlogged in friendly experience. Reddit and Twitter seem to compete for that."
      },
      {
        "start": 711000,
        "stop": 711400,
        "text": " And that's where Nitter is especially handy. It's just none of"
      },
      {
        "start": 711400,
        "stop": 711800,
        "text": " that nonsense. Read the tweet, move on with your life."
      },
      {
        "start": 711800,
        "stop": 712200,
        "text": " Also, old dot Reddit dot com, which also, thank God. But, okay, so"
      },
      {
        "start": 712200,
        "stop": 712600,
        "text": " maybe you don't want to just generate a link. Maybe you want to go even further."
      },
      {
        "start": 712600,
        "stop": 713000,
        "text": " Maybe you want to stop using all of these commercial"
      },
      {
        "start": 713000,
        "stop": 713400,
        "text": " platforms that just want to take your information and run with it. Friends, I want to"
      },
      {
        "start": 713400,
        "stop": 713800,
        "text": " tell you about LibRedirect. This is an extension. You"
      },
      {
        "start": 713800,
        "stop": 714200,
        "text": " install it in your browser and it redirects all the popular sites, all the"
      },
      {
        "start": 714200,
        "stop": 714600,
        "text": " mainstream sites that you use, to alternative front ends or"
      },
      {
        "start": 714600,
        "stop": 715000,
        "text": " back ends if they're available. And this is really, really fun. It's really"
      },
      {
        "start": 715000,
        "stop": 715400,
        "text": " slick. It's called LibRedirect and"
      },
      {
        "start": 715400,
        "stop": 715800,
        "text": " it'll redirect your YouTubes to your"
      },
      {
        "start": 715800,
        "stop": 716200,
        "text": " various different options like piped or individualist. It'll redirect"
      },
      {
        "start": 716200,
        "stop": 716600,
        "text": " Twitter to Nitter. It'll redirect TikTok to"
      },
      {
        "start": 716600,
        "stop": 717000,
        "text": " I guess there's something called Proxytalk. LibReddit for"
      },
      {
        "start": 717000,
        "stop": 717400,
        "text": " Reddit. Wikipedia to Wikiless. Medium to Scribe."
      },
      {
        "start": 717400,
        "stop": 717800,
        "text": " Quora to something called Cordy. There's all kinds"
      },
      {
        "start": 717800,
        "stop": 718200,
        "text": " of options and it just does it transparently. Now,"
      },
      {
        "start": 718200,
        "stop": 718600,
        "text": " I don't know, maybe you're fine using YouTube or maybe you're fine using the main"
      },
      {
        "start": 718600,
        "stop": 719000,
        "text": " Reddit site. But isn't this an interesting experiment? I kind of"
      },
      {
        "start": 719000,
        "stop": 719400,
        "text": " challenge each one of you out there to try this. Live with this for a few days."
      },
      {
        "start": 719400,
        "stop": 719800,
        "text": " Actually, I'd like to know how long you could live with LibRedirect. What"
      },
      {
        "start": 719800,
        "stop": 720200,
        "text": " happens if you replace these centralized services with"
      },
      {
        "start": 720200,
        "stop": 720600,
        "text": " these privacy respecting alternatives? And"
      },
      {
        "start": 720600,
        "stop": 721000,
        "text": " maybe it's never been easier than a web browser that lets you just do it automatically. You go"
      },
      {
        "start": 721000,
        "stop": 721400,
        "text": " to YouTube, it'll send you to the correct place. Quote, unquote, correct."
      },
      {
        "start": 721400,
        "stop": 721800,
        "text": " I'm going to try it. I'll report back next week and I'll let you guys know how it goes."
      },
      {
        "start": 721800,
        "stop": 722200,
        "text": " But I'd also love to hear how it works for all of you out there. So this might be something you could boost in about"
      },
      {
        "start": 722200,
        "stop": 722600,
        "text": " or go to LinuxUnplugged.com/contact. How did LibRedirect work for you?"
      },
      {
        "start": 722600,
        "stop": 723000,
        "text": " Spending a week off of the big commercial services."
      },
      {
        "start": 723000,
        "stop": 723400,
        "text": " Can you cut it? And be honest with me. Because I'm going to be honest with you"
      },
      {
        "start": 723400,
        "stop": 723800,
        "text": " guys. If it doesn't work for me, like, I have a bad YouTube habit right now."
      },
      {
        "start": 723800,
        "stop": 724200,
        "text": " If this doesn't cut it, I'll let you guys know. So it's LibRedirect. We'll have a link"
      },
      {
        "start": 724200,
        "stop": 724600,
        "text": " in the show notes for that as well. And you can put it in Firefox or your"
      },
      {
        "start": 724600,
        "stop": 725000,
        "text": " Chrome. So how is that Shufflecake server of ours"
      },
      {
        "start": 725000,
        "stop": 725400,
        "text": " doing, Wes? I think we're testing the limits of Shufflecake right now because"
      },
      {
        "start": 725400,
        "stop": 725800,
        "text": " well, the folks that are on there, we've been"
      },
      {
        "start": 725800,
        "stop": 726200,
        "text": " walling each other. What? You know, like wall, W. Oh,"
      },
      {
        "start": 726200,
        "stop": 726600,
        "text": " yeah, yeah, yeah. Basically the original group messenger. Yeah. So we've been chatting"
      },
      {
        "start": 726600,
        "stop": 727000,
        "text": " that way back and forth on the box. Yeah. A lot of fun. You know, I don't know who"
      },
      {
        "start": 727000,
        "stop": 727400,
        "text": " you all are. You're all Kirk to me, but you're all the best."
      },
      {
        "start": 727400,
        "stop": 727800,
        "text": " Someone, one of the Kirks,"
      },
      {
        "start": 727800,
        "stop": 728200,
        "text": " got the correct, figured out the clue,"
      },
      {
        "start": 728200,
        "stop": 728600,
        "text": " got, tried the correct password. I don't know what"
      },
      {
        "start": 728600,
        "stop": 729000,
        "text": " command exactly they ran, but because we've got so many folks in play, like,"
      },
      {
        "start": 729000,
        "stop": 729400,
        "text": " the same image is loopback mounted multiple times and then those are mounted"
      },
      {
        "start": 729400,
        "stop": 729800,
        "text": " and they've opened like the first volume. So I'm not,"
      },
      {
        "start": 729800,
        "stop": 730200,
        "text": " I didn't try that because I was only one, there's concurrency of one when I was"
      },
      {
        "start": 730200,
        "stop": 730600,
        "text": " trying this over the weekend. So I never tried, like, can you open the"
      },
      {
        "start": 730600,
        "stop": 731000,
        "text": " second volume if you've already opened the first volume? So I suspect what needs to happen"
      },
      {
        "start": 731000,
        "stop": 731400,
        "text": " is all the, like, unmount all the current mounted volumes,"
      },
      {
        "start": 731400,
        "stop": 731800,
        "text": " use the close volume command to"
      },
      {
        "start": 731800,
        "stop": 732200,
        "text": " shuffle cake close stuff and then try to open it again."
      },
      {
        "start": 732200,
        "stop": 732600,
        "text": " So I'm thinking I might just reboot the system and let"
      },
      {
        "start": 732600,
        "stop": 733000,
        "text": " folks try it again. And then whoever gets there first gets the 20,000 sets. Yeah, and I don't know"
      },
      {
        "start": 733000,
        "stop": 733400,
        "text": " who all was logged in when that person posted the password that they tried or who all saw that message"
      },
      {
        "start": 733400,
        "stop": 733800,
        "text": " because, you know. But if we just sit here and talk about it for a few seconds, we're"
      },
      {
        "start": 733800,
        "stop": 734200,
        "text": " giving them a heads up and then before you reboot it, they'll know. Yeah,"
      },
      {
        "start": 734200,
        "stop": 734600,
        "text": " well I'm rebooting now. Alright, here we go then. We'll find out"
      },
      {
        "start": 734600,
        "stop": 735000,
        "text": " in the post show. So if you want more Linux Unplugged, remember we get together every single"
      },
      {
        "start": 735000,
        "stop": 735400,
        "text": " Sunday at noon Pacific, 3 p.m. Eastern over at jupiter.tube"
      },
      {
        "start": 735400,
        "stop": 735800,
        "text": " and we'd love to have you join us. See you next week."
      },
      {
        "start": 735800,
        "stop": 736200,
        "text": " Same bad time, same bad station. And if you're in the industry,"
      },
      {
        "start": 736200,
        "stop": 736600,
        "text": " be sure you're never missing a single episode of Linux Action News."
      },
      {
        "start": 736600,
        "stop": 737000,
        "text": " LinuxActionNews.com West Payne and I sit down and tell you about the stuff in"
      },
      {
        "start": 737000,
        "stop": 737400,
        "text": " open source that actually matters every single week. Small correction,"
      },
      {
        "start": 737400,
        "stop": 737800,
        "text": " I'm usually standing when I record Linux Action News. Are you? Yeah."
      },
      {
        "start": 737800,
        "stop": 738200,
        "text": " I gotta like totally change my mental image now. That's right."
      },
      {
        "start": 738200,
        "stop": 738600,
        "text": " I just picture you right here, but just in your place. Wow, okay."
      },
      {
        "start": 738600,
        "stop": 739000,
        "text": " Blowing my mind. In the meantime, links to what we talked about. LinuxUnplugged.com/485"
      },
      {
        "start": 739000,
        "stop": 739400,
        "text": " and of course our subscribe stuff is over there and then all the"
      },
      {
        "start": 739400,
        "stop": 739800,
        "text": " great shows. All the great shows at jupiterbroadcast.com"
      },
      {
        "start": 739800,
        "stop": 740200,
        "text": " I made it. I made it."
      },
      {
        "start": 740400,
        "stop": 740800,
        "text": " Oh."
      },
      {
        "start": 743000,
        "stop": 743400,
        "text": " I tell you what,"
      },
      {
        "start": 743400,
        "stop": 743800,
        "text": " that cider really hits. Well it was really probably the cider and the champagne."
      },
      {
        "start": 743800,
        "stop": 744200,
        "text": " I was drinking both of them during the show. But oh my gosh, this is why"
      },
      {
        "start": 744200,
        "stop": 744600,
        "text": " we don't do this every show. I tell you what, barely held it together."
      },
      {
        "start": 744600,
        "stop": 745000,
        "text": " We don't have OG baller booster Johnny with us every show."
      },
      {
        "start": 745000,
        "stop": 745400,
        "text": " John, thanks for joining us and thank you for bringing the champagne."
      },
      {
        "start": 745400,
        "stop": 745800,
        "text": " Thanks for letting me come by. Appreciate it. Oh yeah. Now I saw my wife stop by"
      },
      {
        "start": 745800,
        "stop": 746200,
        "text": " she pulled you out of the room. Did she chastise you about something? Oh man, she was yelling"
      },
      {
        "start": 746200,
        "stop": 746600,
        "text": " That sounds like Hadiya. She's so angry all the time."
      },
      {
        "start": 746600,
        "stop": 747000,
        "text": " No, I parked in the neighbor's spot. I didn't know"
      },
      {
        "start": 747000,
        "stop": 747400,
        "text": " which side was your guys' spot. I was gonna ask actually."
      },
      {
        "start": 747400,
        "stop": 747800,
        "text": " Well, you don't expect a house, right? You don't expect a townhouse?"
      },
      {
        "start": 747800,
        "stop": 748200,
        "text": " Well, I think I heard you say it was, so I did expect that. I just didn't"
      },
      {
        "start": 748200,
        "stop": 748600,
        "text": " catch the A and B, so I didn't even realize there were two. And I wasn't sure which"
      },
      {
        "start": 748600,
        "stop": 749000,
        "text": " side to go to. I picked the right side and came here, but it didn't"
      },
      {
        "start": 749000,
        "stop": 749400,
        "text": " occur to me that the other side was another. You know what? They don't need it."
      },
      {
        "start": 749400,
        "stop": 749800,
        "text": " You know what? They don't need it, right? She just needs to go over there and explain to them"
      },
      {
        "start": 749800,
        "stop": 750200,
        "text": " they're podcasting right now. You don't think they don't do a Windows podcast?"
      },
      {
        "start": 750200,
        "stop": 750600,
        "text": " Wouldn't that be amazing if they're like, \"Rival podcast?\" Just to the"
      },
      {
        "start": 750600,
        "stop": 751000,
        "text": " other side of the townhouse."
      },
      {
        "start": 751000,
        "stop": 751400,
        "text": " Laughter"
      }
    ],
    "processing_time": {
      "secs": 2503,
      "nanos": 220079738
    }
  },
  "metadata": {
    "title": "LINUX Unplugged 485: Mystery Box",
    "pictures": [],
    "duration": {
      "secs": 7476,
      "nanos": 742000000
    },
    "unique_id": "http://linuxunplugged.com/485"
  },
  "episode": {
    "title": "Mystery Box | LINUX Unplugged 485",
    "description": "We dig into Shufflecake, a tool that lets Linux users hide data with plausible deniability, then let our live stream SSH into our server and see if they can discover our secret data.",
    "content": "<p>We dig into Shufflecake, a tool that lets Linux users hide data with plausible deniability, then let our live stream SSH into our server and see if they can discover our secret data.</p>\n\n<p><p>Plus, we follow up on Brent&#39;s never-ending desktop distro search and Chris&#39; new Linux rig.</p><p>Sponsored By:</p><ul><li><a href=\"http://tailscale.com/\" rel=\"nofollow\">Tailscale</a>: <a href=\"http://tailscale.com/\" rel=\"nofollow\">Tailscale is a Zero config VPN. It installs on any device in minutes, manages firewall rules for you, and works from anywhere. Get 20 devices for free for a personal account. </a></li><li><a href=\"https://linode.com/unplugged\" rel=\"nofollow\">Linode Cloud Hosting</a>: <a href=\"https://linode.com/unplugged\" rel=\"nofollow\">A special offer for all Linux Unplugged Podcast listeners and new Linode customers, visit linode.com/unplugged, and receive $100 towards your new account. </a></li><li><a href=\"https://bitwarden.com/linux\" rel=\"nofollow\">Bitwarden</a>: <a href=\"https://bitwarden.com/linux\" rel=\"nofollow\">Bitwarden is the easiest way for businesses and individuals to store, share, and sync sensitive data.</a></li></ul><p><a href=\"https://jupitersignal.memberful.com/checkout?plan=52946\" rel=\"payment\">Support LINUX Unplugged</a></p><p>Links:</p><ul><li><a href=\"https://arstechnica.com/gaming/2022/11/just-a-bunch-of-idiots-having-fun-a-photo-history-of-the-lan-party/\" title=\"Just a bunch of idiots having funa photo history of the LAN party\" rel=\"nofollow\">Just a bunch of idiots having funa photo history of the LAN party</a></li><li><a href=\"https://research.kudelskisecurity.com/2022/11/10/introducing-shufflecake-plausible-deniability-for-multiple-hidden-filesystems-on-linux/\" title=\"Introducing Shufflecake\" rel=\"nofollow\">Introducing Shufflecake</a> &mdash; Shufflecake is a tool for Linux that allows creation of multiple hidden volumes on a storage device in such a way that it is very difficult, even under forensic inspection, to prove the existence of such volumes. Each volume is encrypted with a different secret key, scrambled across the empty space of an underlying existing storage medium, and indistinguishable from random noise when not decrypted.</li><li><a href=\"https://infoscience.epfl.ch/record/297353\" title=\"Hidden Filesystem Design and Improvement - Elia Anzuoni\" rel=\"nofollow\">Hidden Filesystem Design and Improvement - Elia Anzuoni</a> &mdash; We propose a novel design, a scheme called Shufflecake, which targets a more balanced compromise between performance and security. The level of deniability it offers, while not protecting against attacks in the most stringent threat model, is sufficient in many practical scenarios.</li><li><a href=\"https://www.gagliardoni.net/\" title=\"Tommaso Gagliardonis Homepage\" rel=\"nofollow\">Tommaso Gagliardonis Homepage</a></li><li><a href=\"https://codeberg.org/shufflecake/dm-sflc\" title=\"Linux kernel module for Shufflecake\" rel=\"nofollow\">Linux kernel module for Shufflecake</a></li><li><a href=\"https://codeberg.org/shufflecake/shufflecake-userland\" title=\"Shufflecake Userland Tools\" rel=\"nofollow\">Shufflecake Userland Tools</a></li><li><a href=\"https://imgur.com/a/7dxsqPU\" title=\"Fedora upgrade failed due to dep failure\" rel=\"nofollow\">Fedora upgrade failed due to dep failure</a></li><li><a href=\"https://www.ypsidanger.com/comparing-opensuse-microos-to-fedora-silverblue-37/\" title=\"Comparing openSUSE MicroOS and Fedora Silverblue 37\" rel=\"nofollow\">Comparing openSUSE MicroOS and Fedora Silverblue 37</a></li><li><a href=\"https://lucumr.pocoo.org/2022/11/14/scaling-mastodon/\" title=\"Scaling Mastodon is Impossible\" rel=\"nofollow\">Scaling Mastodon is Impossible</a></li><li><a href=\"https://lottalinuxlinks.com/using-mastodon-for-comments-on-a-static-blog/\" title=\"Using Mastodon for comments on a static blog\" rel=\"nofollow\">Using Mastodon for comments on a static blog</a></li><li><a href=\"https://github.com/no-gravity/TwitterToNitter\" title=\"TwitterToNitter\" rel=\"nofollow\">TwitterToNitter</a> &mdash; Bookmarklet that shows the current Twitter page on Nitter. On every click it choses a random Nitter instance.</li><li><a href=\"https://github.com/libredirect/libredirect\" title=\"libredirect\" rel=\"nofollow\">libredirect</a> &mdash; A web extension that redirects YouTube, Twitter, Instagram... requests to alternative privacy friendly frontends and backends.</li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-9067",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15799680/92ce32da-fde3-4c71-9f63-c2f5f019fd45.mp3",
      "length": "105846459",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-11-20T22:55:00+01:00"
  },
  "speedup": 2.9868498
}