{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 500,
        "text": " You'd think the episodes where we're together in person would be the ones where we really have our crap together."
      },
      {
        "start": 500,
        "stop": 700,
        "text": " Give me another three minutes and I think we might be better."
      },
      {
        "start": 700,
        "stop": 1200,
        "text": " Three minutes? No way, we gotta start right now. We can't wait three minutes."
      },
      {
        "start": 1200,
        "stop": 1500,
        "text": " Let me just move some things here."
      },
      {
        "start": 1500,
        "stop": 1800,
        "text": " It's Office Hours with me, Chris."
      },
      {
        "start": 1800,
        "stop": 2200,
        "text": " [Music]"
      },
      {
        "start": 2200,
        "stop": 3200,
        "text": " Come on in everybody. It's a special Office Hours because we are down in roasty toasty Pasadena, California, about to go tour JPL."
      },
      {
        "start": 3200,
        "stop": 3600,
        "text": " And my two good buddies are joining me right here live in the office."
      },
      {
        "start": 3600,
        "stop": 3800,
        "text": " Hello Brent. Hello Wes."
      },
      {
        "start": 3800,
        "stop": 3900,
        "text": " Well hello."
      },
      {
        "start": 3900,
        "stop": 4000,
        "text": " Hello handsome."
      },
      {
        "start": 4000,
        "stop": 4500,
        "text": " Nice to have you both here with me. Nice to have you join us Wes. It's been a minute."
      },
      {
        "start": 4500,
        "stop": 4800,
        "text": " Yes it has, but I can't think of a better place to be right now."
      },
      {
        "start": 4800,
        "stop": 6200,
        "text": " It's been a crazy few days since we office'd together. We've driven through three states. We've met many listeners. We've lit a barbecue on fire."
      },
      {
        "start": 6200,
        "stop": 6400,
        "text": " We've done a lot. Accidentally."
      },
      {
        "start": 6400,
        "stop": 6600,
        "text": " Yeah, I mean accidentally. We'll get to all of that."
      },
      {
        "start": 6600,
        "stop": 7100,
        "text": " I'm feeling like it's time to catch up with the audience and tell everybody what's been going on for a little bit."
      },
      {
        "start": 7100,
        "stop": 7500,
        "text": " We have so many stories to share. And even though Brent isn't ready to do the show yet."
      },
      {
        "start": 7500,
        "stop": 7600,
        "text": " Not quite, but I'm getting there."
      },
      {
        "start": 7600,
        "stop": 7900,
        "text": " I mean I feel like we just proceed without him. You know, until he's ready."
      },
      {
        "start": 7900,
        "stop": 8400,
        "text": " Because I feel like since we're all together I can watch him and I can see when he's ready."
      },
      {
        "start": 8400,
        "stop": 8600,
        "text": " You might have to run a bit, but you can catch up."
      },
      {
        "start": 8600,
        "stop": 8900,
        "text": " Mm-hmm. Yeah. I won't say why he's so tired, but I think there's a reason."
      },
      {
        "start": 8900,
        "stop": 9200,
        "text": " Now I thought maybe we'd tell a little bit of the story of getting down here."
      },
      {
        "start": 9200,
        "stop": 9800,
        "text": " Yeah, I took the easy way. I just flew down here, but you two. I mean, you've been venturing."
      },
      {
        "start": 9800,
        "stop": 10400,
        "text": " I had the worst, worst stress and anxiety getting ready to go."
      },
      {
        "start": 10400,
        "stop": 10500,
        "text": " Were you feeling this too, Brent?"
      },
      {
        "start": 10500,
        "stop": 11000,
        "text": " Oh, easily. Because we tried to squeeze in a ton of projects at the studio as well."
      },
      {
        "start": 11000,
        "stop": 11500,
        "text": " But when it came time too, I think we were both extremely stressed."
      },
      {
        "start": 11500,
        "stop": 11700,
        "text": " Wait, you got that server AC built?"
      },
      {
        "start": 11700,
        "stop": 12100,
        "text": " No, I think maybe that'll be on the other end of the trip. We'll see."
      },
      {
        "start": 12100,
        "stop": 12600,
        "text": " The thing was, we knew we had to, Monday morning we were going to leave."
      },
      {
        "start": 12600,
        "stop": 13000,
        "text": " And we wanted to do a pro move, right?"
      },
      {
        "start": 13000,
        "stop": 13500,
        "text": " And that was try to bypass Seattle, Tacoma, and Portland traffic."
      },
      {
        "start": 13500,
        "stop": 14400,
        "text": " And to do that, you have to leave our area at a very specific time, because you've got to hit the gas station, you've got to hit Seattle at this time, you've got to hit Tacoma at this time, and Portland just at this time."
      },
      {
        "start": 14400,
        "stop": 15000,
        "text": " And that meant that we needed to leave no later than 11 a.m. Pacific time."
      },
      {
        "start": 15000,
        "stop": 15200,
        "text": " You have this all calculated out."
      },
      {
        "start": 15200,
        "stop": 15500,
        "text": " Yeah, but that's after having recorded a show for you, right, Chris?"
      },
      {
        "start": 15500,
        "stop": 15900,
        "text": " Right. Well, so Sunday we did two LUBs, we did a five-hour livestream."
      },
      {
        "start": 15900,
        "stop": 17000,
        "text": " And then Monday morning I did a really early coder, and I was trying to get everything done, figuring, well, if I get coder complete, we can race up to the RV, we can load up and we can head out by 11 a.m."
      },
      {
        "start": 17000,
        "stop": 17900,
        "text": " And, well, let's just say 12 hours later that I thought we would leave, Brent and I were still working on projects."
      },
      {
        "start": 17900,
        "stop": 18900,
        "text": " Well, it's about 12 hours after when I thought we'd be leaving, and the sun has mostly set, Brent's working on more projects."
      },
      {
        "start": 18900,
        "stop": 19000,
        "text": " Oh, hi."
      },
      {
        "start": 19000,
        "stop": 19200,
        "text": " Hey, what are you working on down there?"
      },
      {
        "start": 19200,
        "stop": 19700,
        "text": " There's like a little skirt that's under the engine and it's falling a little bit."
      },
      {
        "start": 19700,
        "stop": 19900,
        "text": " We think it might be a little problematic and..."
      },
      {
        "start": 19900,
        "stop": 20100,
        "text": " Kind of worried about maybe..."
      },
      {
        "start": 20100,
        "stop": 20300,
        "text": " ...ruining our, like, fuel efficiency and stuff."
      },
      {
        "start": 20300,
        "stop": 20400,
        "text": " Yeah, causing a...causing a draft."
      },
      {
        "start": 20400,
        "stop": 20700,
        "text": " And you'd hate for it to get caught while we're driving, so..."
      },
      {
        "start": 20700,
        "stop": 20900,
        "text": " It also has reduced our clearance, so there's that issue."
      },
      {
        "start": 20900,
        "stop": 21000,
        "text": " Yeah."
      },
      {
        "start": 21000,
        "stop": 21300,
        "text": " But mostly I want to see what kind of miles per gallon Brent can get out of this thing."
      },
      {
        "start": 21300,
        "stop": 21500,
        "text": " Yeah, last time we did, what, 46 or something?"
      },
      {
        "start": 21500,
        "stop": 21600,
        "text": " Incredible."
      },
      {
        "start": 21600,
        "stop": 21900,
        "text": " 46 miles per gallon on a Ford Focus."
      },
      {
        "start": 21900,
        "stop": 22200,
        "text": " A 2013 Ford Focus, like 135,000 miles on it."
      },
      {
        "start": 22200,
        "stop": 22300,
        "text": " Yeah, we did all right."
      },
      {
        "start": 22300,
        "stop": 22600,
        "text": " But we're still here."
      },
      {
        "start": 22600,
        "stop": 23500,
        "text": " So then now, I guess, the plan is we're just going to get up really early in the morning and head out at about 4 a.m."
      },
      {
        "start": 23500,
        "stop": 23600,
        "text": " And we did."
      },
      {
        "start": 23600,
        "stop": 23800,
        "text": " We actually did very well, I think."
      },
      {
        "start": 23800,
        "stop": 24000,
        "text": " We got everything ready to go."
      },
      {
        "start": 24000,
        "stop": 24800,
        "text": " We even unplugged Jupes from Shore Power, brought the slides in, and just were basically turn the key and go."
      },
      {
        "start": 24800,
        "stop": 25400,
        "text": " And it was one of those situations where we had done a lot of thinking about preparing the RV for the road trip,"
      },
      {
        "start": 25400,
        "stop": 26000,
        "text": " but we hadn't done a lot of thinking about preparing the chase car that we're driving around that we drove down here to Pasadena."
      },
      {
        "start": 26000,
        "stop": 26300,
        "text": " Yeah, right, you didn't drive one vehicle, you took two vehicles all this way."
      },
      {
        "start": 26300,
        "stop": 26400,
        "text": " Right."
      },
      {
        "start": 26400,
        "stop": 26600,
        "text": " Did we ever do that oil change that we were thinking about?"
      },
      {
        "start": 26600,
        "stop": 26700,
        "text": " Nope."
      },
      {
        "start": 26700,
        "stop": 26800,
        "text": " Oh, no."
      },
      {
        "start": 26800,
        "stop": 27100,
        "text": " That's how the whole, so that's how this all started, is we were going to do an oil change,"
      },
      {
        "start": 27100,
        "stop": 27800,
        "text": " and then we discovered that Ford puts like a skirt underneath the Focus, and it's completely sealed up underneath."
      },
      {
        "start": 27800,
        "stop": 28200,
        "text": " Only we discovered that it was sagging and potentially dragging, and we needed to fix that."
      },
      {
        "start": 28200,
        "stop": 28500,
        "text": " Yeah, it's almost like whoever put it on last didn't put it on right."
      },
      {
        "start": 28500,
        "stop": 28600,
        "text": " I really struggled to get it in place."
      },
      {
        "start": 28600,
        "stop": 28700,
        "text": " Thankfully, we did."
      },
      {
        "start": 28700,
        "stop": 29000,
        "text": " Do you remember I also had to fill the oil?"
      },
      {
        "start": 29000,
        "stop": 29300,
        "text": " Yeah, the oil was a little low, and then we almost overfilled it."
      },
      {
        "start": 29300,
        "stop": 29500,
        "text": " No, no, I think, yeah."
      },
      {
        "start": 29500,
        "stop": 30200,
        "text": " For about ten minutes, we knew that I did overfill it, and that's how it brought us to me being under the car."
      },
      {
        "start": 30200,
        "stop": 30600,
        "text": " Yeah, it was a process, and that was into the dark, right?"
      },
      {
        "start": 30600,
        "stop": 30700,
        "text": " That was late at night."
      },
      {
        "start": 30700,
        "stop": 30800,
        "text": " Why do we do that to ourselves?"
      },
      {
        "start": 30800,
        "stop": 31200,
        "text": " But it also included like harvesting the garden, so we had fruits and veggies for not fruits but..."
      },
      {
        "start": 31200,
        "stop": 31400,
        "text": " You need snacks for the road, yeah."
      },
      {
        "start": 31400,
        "stop": 31500,
        "text": " We had snacks, yeah."
      },
      {
        "start": 31500,
        "stop": 32000,
        "text": " Yeah, I will say that time, Chris, had we left at eleven, we would have not been ready, and we would have been stressed,"
      },
      {
        "start": 32000,
        "stop": 32400,
        "text": " I think, the whole trip, because we would not have had the things we needed."
      },
      {
        "start": 32400,
        "stop": 33200,
        "text": " There was just stuff we had to do, and I was just refusing to accept it, but the inevitability of it just was just inescapable."
      },
      {
        "start": 33200,
        "stop": 33500,
        "text": " Well, and of course, I mean, you always have a target to leave, right?"
      },
      {
        "start": 33500,
        "stop": 34000,
        "text": " But you had like an actual, an actual event to be headed towards that you couldn't put off."
      },
      {
        "start": 34000,
        "stop": 34700,
        "text": " That's just it. That we had a deadline, we had a meetup the next day, which turned out to be the day we left, right?"
      },
      {
        "start": 34700,
        "stop": 35200,
        "text": " So we knew we had to leave early, because we had to make it down, they're still trying to miss all the traffic, which we did."
      },
      {
        "start": 35200,
        "stop": 36000,
        "text": " But then we had to get to Grants Pass for our meetup there at Grants Pass, and we got to our campsite about 45 minutes before the meetup started."
      },
      {
        "start": 36000,
        "stop": 36100,
        "text": " No way."
      },
      {
        "start": 36100,
        "stop": 36500,
        "text": " It wasn't a huge meetup, but it was, it was a really great meetup."
      },
      {
        "start": 36500,
        "stop": 37200,
        "text": " We had a good little group there, and we had room for extra people to sit down and join us and geek out with us."
      },
      {
        "start": 37200,
        "stop": 38100,
        "text": " And we chatted things about like wireless wisps in the area, and ISP, you know, politics for that location, and just the IT market in Grants Pass."
      },
      {
        "start": 38100,
        "stop": 38600,
        "text": " Yeah, we had David with us, and he was really great. He's going to join us at JPL as well."
      },
      {
        "start": 38600,
        "stop": 38800,
        "text": " Yeah, isn't that awesome?"
      },
      {
        "start": 38800,
        "stop": 39000,
        "text": " Do you remember Devin and Juniper joined us?"
      },
      {
        "start": 39000,
        "stop": 39100,
        "text": " Yeah."
      },
      {
        "start": 39100,
        "stop": 39300,
        "text": " And then also his mom and friends."
      },
      {
        "start": 39300,
        "stop": 40100,
        "text": " And his mom's sister, who if I was 60 years older, I would have been, I would have been interested in. She was a lot of fun. It was great."
      },
      {
        "start": 40100,
        "stop": 40800,
        "text": " In fact, the whole family, and they were RVers too, so I, you know, I got to geek out about, you know, the different RV knowledge we have about the local area."
      },
      {
        "start": 40800,
        "stop": 41300,
        "text": " There's something about these meetups. I mean, just kindred spirits, whether they use Linux or not."
      },
      {
        "start": 41300,
        "stop": 41900,
        "text": " Yeah, that's what I noticed definitely is like we were totally done for that day. I mean, we traveled what, like eight hours or something like that?"
      },
      {
        "start": 41900,
        "stop": 42000,
        "text": " They're still gentle."
      },
      {
        "start": 42000,
        "stop": 42500,
        "text": " And, yeah, but also it was like they're just friends of ours. Okay, friends we've never met before, but."
      },
      {
        "start": 42500,
        "stop": 42600,
        "text": " The conversation's easy."
      },
      {
        "start": 42600,
        "stop": 42900,
        "text": " Yeah, you just jump into it. It's very, very, very smooth."
      },
      {
        "start": 42900,
        "stop": 43300,
        "text": " So that's your, that's your Grants Pass review. Handsy, but real smooth and easy."
      },
      {
        "start": 43300,
        "stop": 44100,
        "text": " Yeah. And we didn't, we really didn't get much time. In fact, I worked almost the entire time in Grants Pass with the exception of the meetup."
      },
      {
        "start": 44100,
        "stop": 44500,
        "text": " And this has happened on the last year's Road Tour too. With the exception of the meetup, I never even left the campground."
      },
      {
        "start": 44500,
        "stop": 44700,
        "text": " Yeah, we said we wouldn't do this again."
      },
      {
        "start": 44700,
        "stop": 44800,
        "text": " I know. But, you know."
      },
      {
        "start": 44800,
        "stop": 45100,
        "text": " Brent went off for what looked like a lovely hike, I think."
      },
      {
        "start": 45100,
        "stop": 45200,
        "text": " Yes."
      },
      {
        "start": 45200,
        "stop": 46500,
        "text": " And I'm sitting there stuck in the damn RV the entire time. I think he's guilty, he feels guilty about it."
      },
      {
        "start": 46500,
        "stop": 47000,
        "text": " I do really feel guilty. It was wonderful. I even like crossed a small river without my shoes on."
      },
      {
        "start": 47000,
        "stop": 47100,
        "text": " With Levi, right?"
      },
      {
        "start": 47100,
        "stop": 47200,
        "text": " Oh, Levi was so cute."
      },
      {
        "start": 47200,
        "stop": 47800,
        "text": " But I do happen to know one of your goals here was to, you know, show Brent some of the wonderful areas you take yourself to."
      },
      {
        "start": 47800,
        "stop": 48400,
        "text": " No, this is the, Burke Hedia gets to do it as well, you know, and she gets to tell me about all the cool places she explored while I recorded. And that's fine."
      },
      {
        "start": 48400,
        "stop": 48600,
        "text": " And someone has to walk the dog."
      },
      {
        "start": 48600,
        "stop": 49000,
        "text": " Somebody's got to do the podcasting, somebody's got to walk the dog. It's just the way things went."
      },
      {
        "start": 49000,
        "stop": 49300,
        "text": " If it helps, we also did drop a geocache while we were out."
      },
      {
        "start": 49300,
        "stop": 49900,
        "text": " Yeah, yeah. So we should tell people about that. There's a geocache for people to find in Grants Pass. Or at least that area."
      },
      {
        "start": 49900,
        "stop": 50500,
        "text": " There is. And I, you know, it's a funny thing, I don't want to give too much away, but at the same time, I actually think it might be really difficult to find."
      },
      {
        "start": 50500,
        "stop": 51000,
        "text": " Yeah, and I should make it clear, it's like 45 minutes north or so of Grants Pass on the freeway."
      },
      {
        "start": 51000,
        "stop": 51900,
        "text": " Yeah, it is. It's actually in a place called Canyonville. And I think Cow Creek might actually be a bit more of an accurate description."
      },
      {
        "start": 51900,
        "stop": 52300,
        "text": " We do have GPS coordinates that we'll share in the show notes."
      },
      {
        "start": 52300,
        "stop": 53200,
        "text": " And there's a hilarious photo of me standing on this giant pile of rocks at a small, what do you call those, Chris?"
      },
      {
        "start": 53200,
        "stop": 53300,
        "text": " A rest stop?"
      },
      {
        "start": 53300,
        "stop": 53900,
        "text": " Yeah, I think it's a rest stop is a good description of it. And there's a massive pile of boulders."
      },
      {
        "start": 53900,
        "stop": 54000,
        "text": " So somewhere in there?"
      },
      {
        "start": 54000,
        "stop": 54400,
        "text": " That kind of flanks this rest stop. Unfortunately, yeah, I think it's in there somewhere."
      },
      {
        "start": 54400,
        "stop": 54500,
        "text": " Somewhere. That's a hint."
      },
      {
        "start": 54500,
        "stop": 55100,
        "text": " We made it fairly, it's fairly visible for being hidden under a bunch of large boulders."
      },
      {
        "start": 55100,
        "stop": 55600,
        "text": " But I think we underestimated how accurate the GPS might be on a phone."
      },
      {
        "start": 55600,
        "stop": 55700,
        "text": " Yeah."
      },
      {
        "start": 55700,
        "stop": 56200,
        "text": " We'll see. If you find it, though, what would be lovely, because we're going to be dropping these throughout the trip."
      },
      {
        "start": 56200,
        "stop": 56700,
        "text": " What would be lovely is just take a few photos of you, even just searching for it."
      },
      {
        "start": 56700,
        "stop": 57100,
        "text": " If you find it, do a little video or something, maybe some audio, send it our way."
      },
      {
        "start": 57100,
        "stop": 57500,
        "text": " And you can either keep, there's a whole bunch of crazy, awesome stuff in there."
      },
      {
        "start": 57500,
        "stop": 57700,
        "text": " We put a bunch of very fun things."
      },
      {
        "start": 57700,
        "stop": 58000,
        "text": " I won't spoil too much of it because you got to try to find it."
      },
      {
        "start": 58000,
        "stop": 58400,
        "text": " But you can take the stuff, you can replace it with new stuff for someone else to find."
      },
      {
        "start": 58400,
        "stop": 58800,
        "text": " Up to you. But we'd love to get a few photos and videos of that."
      },
      {
        "start": 58800,
        "stop": 59200,
        "text": " Yeah. I'm really looking forward to that as we go about."
      },
      {
        "start": 59200,
        "stop": 59800,
        "text": " And we did deploy one in the area, and then we eventually packed up."
      },
      {
        "start": 59800,
        "stop": 60100,
        "text": " And we did a long drive to Sacramento."
      },
      {
        "start": 60100,
        "stop": 60200,
        "text": " Oh, man."
      },
      {
        "start": 60200,
        "stop": 60800,
        "text": " Like almost eight hours of driving, tons and tons of miles, lots of traffic."
      },
      {
        "start": 60800,
        "stop": 61300,
        "text": " And we got right to hide another geocache in the Sacramento area, too."
      },
      {
        "start": 61300,
        "stop": 61700,
        "text": " It's the second geocache. It's been successfully tucked away in a place."
      },
      {
        "start": 61700,
        "stop": 61900,
        "text": " Let's see how we, ah, hints."
      },
      {
        "start": 61900,
        "stop": 62500,
        "text": " Water nearby, there's a bridge nearby, and an old power plant nearby."
      },
      {
        "start": 62500,
        "stop": 63300,
        "text": " And sometimes when the forest burns, you can plant a secret geocache and something beautiful will grow."
      },
      {
        "start": 63300,
        "stop": 63500,
        "text": " That's the hint."
      },
      {
        "start": 63500,
        "stop": 63700,
        "text": " And of course it's in Sacramento."
      },
      {
        "start": 63700,
        "stop": 63900,
        "text": " Buy an old power plant."
      },
      {
        "start": 63900,
        "stop": 64100,
        "text": " Buy the water."
      },
      {
        "start": 64100,
        "stop": 64200,
        "text": " Perhaps in Folsom."
      },
      {
        "start": 64200,
        "stop": 64500,
        "text": " But those are all the hints I'm giving."
      },
      {
        "start": 64500,
        "stop": 64700,
        "text": " And it's in a Tupperware container."
      },
      {
        "start": 64700,
        "stop": 64900,
        "text": " But that's the last hint."
      },
      {
        "start": 64900,
        "stop": 65000,
        "text": " And there is a shirt in there."
      },
      {
        "start": 65000,
        "stop": 65200,
        "text": " But that's not really a hint."
      },
      {
        "start": 65200,
        "stop": 65400,
        "text": " There's this old hydro plant."
      },
      {
        "start": 65400,
        "stop": 65700,
        "text": " If you're a local, you might know what we're talking about."
      },
      {
        "start": 65700,
        "stop": 66000,
        "text": " And that's your hint. You go there, and there's a little park area."
      },
      {
        "start": 66000,
        "stop": 66300,
        "text": " They also give free tours. Really amazing."
      },
      {
        "start": 66300,
        "stop": 66400,
        "text": " Yeah."
      },
      {
        "start": 66400,
        "stop": 66600,
        "text": " Historical experience. Really, really cool."
      },
      {
        "start": 66600,
        "stop": 67000,
        "text": " Yeah. We have more geocaches to deploy, so keep your ears out for where those are going to be at."
      },
      {
        "start": 67000,
        "stop": 67600,
        "text": " Not everything went smooth. We had a bit of a gear failure at our Sacramento meetup."
      },
      {
        "start": 67600,
        "stop": 67900,
        "text": " Really good meetup at a place called..."
      },
      {
        "start": 67900,
        "stop": 68100,
        "text": " Oh, I know we have the name of it."
      },
      {
        "start": 68100,
        "stop": 68200,
        "text": " We should have been mentioning the name of all of them."
      },
      {
        "start": 68200,
        "stop": 68300,
        "text": " Really great brewery."
      },
      {
        "start": 68300,
        "stop": 68400,
        "text": " These were all breweries."
      },
      {
        "start": 68400,
        "stop": 68600,
        "text": " Urban Roots Brewery and Steakhouse."
      },
      {
        "start": 68600,
        "stop": 68700,
        "text": " Smokehouse."
      },
      {
        "start": 68700,
        "stop": 68800,
        "text": " Sorry, I got that wrong."
      },
      {
        "start": 68800,
        "stop": 68900,
        "text": " Smokehouse."
      },
      {
        "start": 68900,
        "stop": 69100,
        "text": " Actual decent brisket."
      },
      {
        "start": 69100,
        "stop": 69300,
        "text": " Decent barbecue."
      },
      {
        "start": 69300,
        "stop": 69500,
        "text": " We just didn't have decent gear."
      },
      {
        "start": 69500,
        "stop": 69900,
        "text": " Live meetup report. Brent is trying to fix our audio recorder."
      },
      {
        "start": 69900,
        "stop": 70100,
        "text": " So I just busted out the phone."
      },
      {
        "start": 70100,
        "stop": 70400,
        "text": " This thing works really nice. You got a graph in it."
      },
      {
        "start": 70400,
        "stop": 70700,
        "text": " I know. Real-time visuals, dude. It's incredible."
      },
      {
        "start": 70700,
        "stop": 71200,
        "text": " Good meetup, though. Good food. But bad recording equipment."
      },
      {
        "start": 71200,
        "stop": 71400,
        "text": " We got new gear. We should have set it up before we got here."
      },
      {
        "start": 71400,
        "stop": 71700,
        "text": " Yeah, it's true. I had to set the date. It was really embarrassing."
      },
      {
        "start": 71700,
        "stop": 72000,
        "text": " Was it like defaulted to 94? Because it's a pretty old gear."
      },
      {
        "start": 72000,
        "stop": 72700,
        "text": " Well, it's actually 2014, but if you click up to go to 2015, 2016, it actually brings you straight to 2050."
      },
      {
        "start": 72700,
        "stop": 73100,
        "text": " I was like, wait a second. So you have to click down to bring the date up. It was really awkward."
      },
      {
        "start": 73100,
        "stop": 73400,
        "text": " I mean, we're not working with the latest and greatest, but it works."
      },
      {
        "start": 73400,
        "stop": 73600,
        "text": " Well, okay, it isn't working."
      },
      {
        "start": 73600,
        "stop": 73700,
        "text": " We'll get there, right?"
      },
      {
        "start": 73700,
        "stop": 73900,
        "text": " The phone works, and it has the right time."
      },
      {
        "start": 73900,
        "stop": 74000,
        "text": " No!"
      },
      {
        "start": 74000,
        "stop": 74500,
        "text": " Sacramento is a special place because we had the meetup, we did the geocache,"
      },
      {
        "start": 74500,
        "stop": 75300,
        "text": " but one of the true legends of this trip is listener Jeff, who put a lot of effort in to set up a space for us"
      },
      {
        "start": 75300,
        "stop": 75700,
        "text": " that we could camp at for a few days. We could do some shows."
      },
      {
        "start": 75700,
        "stop": 76400,
        "text": " And it was an effort to get Jupes into his backyard, because he's just living in suburbia in Sacramento."
      },
      {
        "start": 76400,
        "stop": 76700,
        "text": " It's not really designed for large vehicles."
      },
      {
        "start": 76700,
        "stop": 77100,
        "text": " We weren't getting Jupes in there for about a half hour."
      },
      {
        "start": 77100,
        "stop": 77500,
        "text": " You can hear her in this clip. She's just working as I slowly back her into the yard."
      },
      {
        "start": 77500,
        "stop": 77700,
        "text": " You were backing up for like a half hour?"
      },
      {
        "start": 77700,
        "stop": 78300,
        "text": " Oh yeah. We were blocking traffic and everything. We had to shim the road in certain spots."
      },
      {
        "start": 78300,
        "stop": 78400,
        "text": " It was a whole other deal."
      },
      {
        "start": 78400,
        "stop": 78500,
        "text": " He got burnt out as a flagger."
      },
      {
        "start": 78500,
        "stop": 79100,
        "text": " He was out moving paver stones with Jeff at a rapid pace as we're trying to get her back tires up over the curb,"
      },
      {
        "start": 79100,
        "stop": 79500,
        "text": " which was just a tighter fit than we expected. We thought we'd clear it."
      },
      {
        "start": 79500,
        "stop": 80100,
        "text": " And Jupes did it for a half hour. She did it as I move forward, move back, move forward, move back,"
      },
      {
        "start": 80100,
        "stop": 80800,
        "text": " and then back her up in there. And then there was probably eight inches of clearance of the fence on one side of her."
      },
      {
        "start": 80800,
        "stop": 81700,
        "text": " It was a really, really touch-and-go thing, because we were all sort of frazzled, because we'd been driving for seven and a half hours."
      },
      {
        "start": 81700,
        "stop": 81800,
        "text": " Not at your sharpest."
      },
      {
        "start": 81800,
        "stop": 82300,
        "text": " And the last bit of it was right before the Sacramento airport, where traffic got real thick."
      },
      {
        "start": 82300,
        "stop": 82500,
        "text": " So the last bit of it was intense driving, too."
      },
      {
        "start": 82500,
        "stop": 83300,
        "text": " So we were fried, and it had just been a real hectic situation. To block traffic is super stressful."
      },
      {
        "start": 83300,
        "stop": 83500,
        "text": " Why do we do this to ourselves all the time?"
      },
      {
        "start": 83500,
        "stop": 83600,
        "text": " I don't know."
      },
      {
        "start": 83600,
        "stop": 83700,
        "text": " How's the exit going to be?"
      },
      {
        "start": 83700,
        "stop": 83800,
        "text": " Well..."
      },
      {
        "start": 83800,
        "stop": 84100,
        "text": " We're going to report back on that one day."
      },
      {
        "start": 84100,
        "stop": 84900,
        "text": " We will figure that out when we get there, because we drove a car down to Pasadena, which was another six, seven hours of driving from Sacramento."
      },
      {
        "start": 84900,
        "stop": 85600,
        "text": " And so we left Jupes all locked up back in Sacramento, which is really one of the, I think, strategic decisions of this trip."
      },
      {
        "start": 85600,
        "stop": 86100,
        "text": " But we do not know how we're getting out just yet. We're going to take it slow and find out."
      },
      {
        "start": 86100,
        "stop": 86300,
        "text": " See if you can beat that 30 minutes."
      },
      {
        "start": 86300,
        "stop": 86900,
        "text": " So, you know, that's why I think listener Jeff, who's been a true legend, and he's joined us on this trip,"
      },
      {
        "start": 86900,
        "stop": 87300,
        "text": " I think that's why he's found this a little more relaxing than we have so far."
      },
      {
        "start": 87300,
        "stop": 87500,
        "text": " A lot more relaxing than I expected, actually."
      },
      {
        "start": 87500,
        "stop": 88300,
        "text": " Thought that I was going to be stressed out and worn down, but you guys have basically done all my cooking and all my cleaning for me, so can't really complain."
      },
      {
        "start": 88300,
        "stop": 88500,
        "text": " Isn't that nice?"
      },
      {
        "start": 88500,
        "stop": 88900,
        "text": " Now, you did a whole bunch of solar stuff on your house."
      },
      {
        "start": 88900,
        "stop": 89300,
        "text": " It seems like you're an expert at some of this stuff."
      },
      {
        "start": 89300,
        "stop": 90000,
        "text": " You did put in some electrical stuff at the barn where the RV usually is."
      },
      {
        "start": 90000,
        "stop": 90100,
        "text": " That was many years ago."
      },
      {
        "start": 90100,
        "stop": 90300,
        "text": " Tell us a little bit about that."
      },
      {
        "start": 90300,
        "stop": 91500,
        "text": " So that was me randomly reaching out to Chris from an old, what was that, user error episode about him complaining about popping his 15 amp breaker from Electric Heaters."
      },
      {
        "start": 91500,
        "stop": 92000,
        "text": " So I just sent him a message and said, \"This is something I know how to do. Would you like me to come up and do it?\""
      },
      {
        "start": 92000,
        "stop": 92300,
        "text": " He said, \"Yes.\" So I did."
      },
      {
        "start": 92300,
        "stop": 93000,
        "text": " And we threw up a 15 amp receptacle for his RV, put the breaker in, did the pipe, all that."
      },
      {
        "start": 93000,
        "stop": 93400,
        "text": " Took maybe 45 minutes, something like that, and got it done."
      },
      {
        "start": 93400,
        "stop": 94900,
        "text": " Nice. So you knew that when we were going to park Lady Joops at your place for several days, recording shows there, and then for several days while we're here in Pasadena, that you knew kind of what the requirements were going to be."
      },
      {
        "start": 94900,
        "stop": 95300,
        "text": " So what changed at your place in the last few weeks?"
      },
      {
        "start": 95300,
        "stop": 96500,
        "text": " So I did the same thing, but I didn't want a permanent installation. So just recently put up my solar and got that taken care of and needed an inspection done as well."
      },
      {
        "start": 96500,
        "stop": 97000,
        "text": " So I had to make this temporary. Didn't want an extra 50 amp receptacle on my wall."
      },
      {
        "start": 97000,
        "stop": 98100,
        "text": " So I set up a pallet, put the receptacle on said pallet, ran pipe around the corner of the wall, then tied that into my main panel."
      },
      {
        "start": 98100,
        "stop": 98600,
        "text": " Pipe just kind of goes in to the panel, taped up nice and safe."
      },
      {
        "start": 98600,
        "stop": 99100,
        "text": " Everything's wired up properly though and on the correct breaker. So legitimately is actually safe."
      },
      {
        "start": 99100,
        "stop": 99600,
        "text": " But that's a temporary installation of a 50 amp RV plug."
      },
      {
        "start": 99600,
        "stop": 100400,
        "text": " From what I can tell, and I've done a few renos, it's the nicest sort of last minute MacGyver job I've ever seen."
      },
      {
        "start": 100400,
        "stop": 101000,
        "text": " So kudos to you. And you did a little bit of work on the RV as well when we were there, didn't you?"
      },
      {
        "start": 101000,
        "stop": 102100,
        "text": " Yeah. We tied into the water pumps power, put a Y splitter on there with XT 60 connectors so that they can plug in there."
      },
      {
        "start": 102100,
        "stop": 102700,
        "text": " What do they call it? The, what do they call that thing? The, the, the grinder."
      },
      {
        "start": 102700,
        "stop": 103400,
        "text": " I think it's the like macerator blender. That's what they call it."
      },
      {
        "start": 103400,
        "stop": 104100,
        "text": " So they can plug in their poop blender separately and let that thing tear away and do its job."
      },
      {
        "start": 104100,
        "stop": 104500,
        "text": " So no more secondary battery and alligator clips."
      },
      {
        "start": 104500,
        "stop": 105000,
        "text": " Sweet. And actually it's, it's been remarkable to see lady jukes right beside your house."
      },
      {
        "start": 105000,
        "stop": 105500,
        "text": " Your house is great, but lady jukes kind of towers over it in a kind of way. Do you find that kind of funny?"
      },
      {
        "start": 105500,
        "stop": 106200,
        "text": " Yeah, I think it actually shades the Southeast panels on my house. It's so damn big."
      },
      {
        "start": 106200,
        "stop": 106600,
        "text": " It's wonderful though. It really is a sight to behold."
      },
      {
        "start": 106600,
        "stop": 107000,
        "text": " Well, I gotta say it's been great to have you on this trip and for us to stay at your place."
      },
      {
        "start": 107000,
        "stop": 107600,
        "text": " So I know we're only like partway into the trip, so I'm looking forward to hanging out some more and going to JPL together."
      },
      {
        "start": 107600,
        "stop": 108000,
        "text": " It's going to be a lot of fun. That's about it. Tons of fun."
      },
      {
        "start": 108000,
        "stop": 108400,
        "text": " You know what he didn't mention, but was super useful? He also ran out an ethernet cable out for us."
      },
      {
        "start": 108400,
        "stop": 108500,
        "text": " Oh yeah."
      },
      {
        "start": 108500,
        "stop": 109100,
        "text": " So jukes has ethernet internet, which made doing the shows a lot better. It was really great."
      },
      {
        "start": 109100,
        "stop": 109700,
        "text": " And she's sitting there. It's 90 degrees out. She's nice and comfortable, you know, so great."
      },
      {
        "start": 109700,
        "stop": 110200,
        "text": " And so now we're hanging out here. We're in our makeshift recording room, which is the dining room."
      },
      {
        "start": 110200,
        "stop": 110500,
        "text": " Describe the room, Chris, would you?"
      },
      {
        "start": 110500,
        "stop": 111600,
        "text": " You know, like, if you have you ever seen a picture of somebody who's a hoarder and they're like, they're like really mentally ill and like you, you realize they've been hoarding for like 20 years and nobody knew about it."
      },
      {
        "start": 111600,
        "stop": 112300,
        "text": " And like every room of their house is just piled full of stuff. You know that? That's what this room looks like."
      },
      {
        "start": 112300,
        "stop": 112600,
        "text": " We've taken all of the beds from all."
      },
      {
        "start": 112600,
        "stop": 112800,
        "text": " There are no serviceable beds at the moment."
      },
      {
        "start": 112800,
        "stop": 113700,
        "text": " We've taken all of the mattresses and all of the blankets and all of the pillows. And for some reason, this Airbnb had a lot of extra pillows."
      },
      {
        "start": 113700,
        "stop": 113800,
        "text": " Helpful."
      },
      {
        "start": 113800,
        "stop": 113900,
        "text": " We'll have to note that in the review."
      },
      {
        "start": 113900,
        "stop": 114500,
        "text": " Yeah. Yeah. I would say, I mean, I'm not even exaggerating. I'd say probably 30 more pillows than you need."
      },
      {
        "start": 114500,
        "stop": 114600,
        "text": " No dish soap."
      },
      {
        "start": 114600,
        "stop": 114700,
        "text": " No dish soap."
      },
      {
        "start": 114700,
        "stop": 114800,
        "text": " No can opener."
      },
      {
        "start": 114800,
        "stop": 115000,
        "text": " No, no, no."
      },
      {
        "start": 115000,
        "stop": 116000,
        "text": " And so we brought all of it into the room. In fact, we're recording late tonight, so nobody can go to bed until we're done recording. Sorry, everybody."
      },
      {
        "start": 116000,
        "stop": 116200,
        "text": " Well, except a little Levi has taken a nap on one of the blankets."
      },
      {
        "start": 116200,
        "stop": 116700,
        "text": " Yeah, we have Levi here. He's curled up. He thinks this is great, I'm sure."
      },
      {
        "start": 116700,
        "stop": 117100,
        "text": " And you know, it's not even perfect, but we made something out of it."
      },
      {
        "start": 117100,
        "stop": 117700,
        "text": " And the thing that is nice is it has a great kitchen area and has a great outdoor cooking area."
      },
      {
        "start": 117700,
        "stop": 118800,
        "text": " And so we decided to do something really kind of special because part of what made this road trip possible is our audience contributing some sats to Brent's petrol fund."
      },
      {
        "start": 118800,
        "stop": 118900,
        "text": " Is that what you called up there in Canada?"
      },
      {
        "start": 118900,
        "stop": 119100,
        "text": " I think it was Sats Gas Tank."
      },
      {
        "start": 119100,
        "stop": 119300,
        "text": " Do you call petrol in Canada?"
      },
      {
        "start": 119300,
        "stop": 119600,
        "text": " Oh, no, we don't. It's only our, you know, British cousins."
      },
      {
        "start": 119600,
        "stop": 120600,
        "text": " So we had a gas fund to help Brent get down to the studio. And Brent is a generally safe, studious driver."
      },
      {
        "start": 120600,
        "stop": 121800,
        "text": " So we had some leftover sats. And I think it was Brent's idea. Let's treat everybody to dinner and let's get some food cranking on that barbecue that we bought with the sats."
      },
      {
        "start": 121800,
        "stop": 122700,
        "text": " This sucker is cranked. It's over 600 degrees in there, but that means it should cook Brent's satoshi squares nice and quick."
      },
      {
        "start": 122700,
        "stop": 123200,
        "text": " He's made us some nice potatoes, all chopped up. Potatoes bought with sats, boosted in."
      },
      {
        "start": 123200,
        "stop": 123600,
        "text": " Yeah, that's hot over there. It's hot, like 600 degrees. So be careful."
      },
      {
        "start": 123600,
        "stop": 123800,
        "text": " You grew these. Oh, these are really out of the garden."
      },
      {
        "start": 123800,
        "stop": 124000,
        "text": " These are not satoshi taters?"
      },
      {
        "start": 124000,
        "stop": 124100,
        "text": " Well, I don't know."
      },
      {
        "start": 124100,
        "stop": 124500,
        "text": " Wait a minute, dude. Are you saying these are illegal potatoes that we smuggled across state lines?"
      },
      {
        "start": 124500,
        "stop": 124700,
        "text": " Oh, no."
      },
      {
        "start": 124700,
        "stop": 125000,
        "text": " I think the satoshi squares would have been better."
      },
      {
        "start": 125000,
        "stop": 125600,
        "text": " Brent was shocked when we stopped at the California border and they screened everybody who crosses the border."
      },
      {
        "start": 125600,
        "stop": 125900,
        "text": " This is something that doesn't happen in most states, but it happens in California."
      },
      {
        "start": 125900,
        "stop": 126400,
        "text": " Every vehicle has to stop for inspection. And the inspection consists of one question."
      },
      {
        "start": 126400,
        "stop": 127000,
        "text": " Do you have any fruits or produce or no, any vegetables or produce on board is what they say."
      },
      {
        "start": 127000,
        "stop": 127900,
        "text": " And I just think about it for like half a second, saying, \"Yeah, we don't have any,\" which was false because we had just harvested the entire garden."
      },
      {
        "start": 127900,
        "stop": 128400,
        "text": " And then, of course, I promptly forgot about that and thought we ordered these. I thought we got these."
      },
      {
        "start": 128400,
        "stop": 128600,
        "text": " We'll talk about how here in just a moment."
      },
      {
        "start": 128600,
        "stop": 128800,
        "text": " If you forget your crime, is there really even a crime?"
      },
      {
        "start": 128800,
        "stop": 129900,
        "text": " Yeah, right? Exactly, exactly. So maybe the potatoes weren't bought with the sats like I thought they were, but the steaks, those were definitely bought with the sats."
      },
      {
        "start": 129900,
        "stop": 130200,
        "text": " We had some tasty sat steaks."
      },
      {
        "start": 130200,
        "stop": 130600,
        "text": " All right, the first sat steak is going on the grill, and this one has a sear. Look at that. Okay."
      },
      {
        "start": 130600,
        "stop": 130700,
        "text": " Here we go. You ready?"
      },
      {
        "start": 130700,
        "stop": 130800,
        "text": " Yeah, I'm definitely ready."
      },
      {
        "start": 130800,
        "stop": 131500,
        "text": " You know, the sat steaks, they smell a little better than a regular steak."
      },
      {
        "start": 131500,
        "stop": 131800,
        "text": " They smell like decentralization."
      },
      {
        "start": 131800,
        "stop": 132000,
        "text": " Okay, ready?"
      },
      {
        "start": 132000,
        "stop": 132100,
        "text": " Yeah, give her a flip."
      },
      {
        "start": 132100,
        "stop": 132400,
        "text": " Oh, look at that."
      },
      {
        "start": 132400,
        "stop": 132600,
        "text": " That is great. So that really sears them really well."
      },
      {
        "start": 132600,
        "stop": 132800,
        "text": " That's fantastic."
      },
      {
        "start": 132800,
        "stop": 133000,
        "text": " And then we just finish them up on the regular grill."
      },
      {
        "start": 133000,
        "stop": 133200,
        "text": " Wait for it."
      },
      {
        "start": 133200,
        "stop": 133800,
        "text": " Like a pro. Like a pro. Nicely done."
      },
      {
        "start": 133800,
        "stop": 133900,
        "text": " Next."
      },
      {
        "start": 133900,
        "stop": 134200,
        "text": " Next sat steak, and we'll just move right down the line."
      },
      {
        "start": 134200,
        "stop": 134300,
        "text": " I said next."
      },
      {
        "start": 134300,
        "stop": 134800,
        "text": " For the vegan of the group, Brent's a pretty dang good meat griller, I have to say."
      },
      {
        "start": 134800,
        "stop": 135300,
        "text": " And this barbecue was cool because it has a dedicated sear grill."
      },
      {
        "start": 135300,
        "stop": 135700,
        "text": " Yeah, I've never seen that before, but that was actually, like, as far as purpose built."
      },
      {
        "start": 135700,
        "stop": 135900,
        "text": " It was exactly what we needed."
      },
      {
        "start": 135900,
        "stop": 136300,
        "text": " Yeah, and the sat steaks were going great. They were smelling delicious."
      },
      {
        "start": 136300,
        "stop": 136700,
        "text": " Listening, you know, a little crisp on the edge."
      },
      {
        "start": 136700,
        "stop": 137300,
        "text": " We had rubbed them down with a chipotle salt kind of rub. Something simple but tasty."
      },
      {
        "start": 137300,
        "stop": 138100,
        "text": " A little bit of garlic in there too. And then to kind of top it off, my wife Hadiya made a garlic butter that we brushed on there."
      },
      {
        "start": 138200,
        "stop": 138700,
        "text": " However, that seems to have kind of been the straw that broke the camel's back."
      },
      {
        "start": 138700,
        "stop": 139000,
        "text": " It's a bit more, uh, what do you call it?"
      },
      {
        "start": 139000,
        "stop": 139400,
        "text": " Grease fire. The whole grease pan in the barbecue is caught on fire. It's not our fault."
      },
      {
        "start": 139400,
        "stop": 139800,
        "text": " I was going to say more volatile than your standard kind of investment strategy."
      },
      {
        "start": 139800,
        "stop": 140300,
        "text": " It's, uh, yeah. It's performing more like an altcoin right now."
      },
      {
        "start": 140300,
        "stop": 140700,
        "text": " It's quite bad. It's just burning out of control."
      },
      {
        "start": 140800,
        "stop": 141500,
        "text": " Um, we did rescue the steaks, so I actually think the steaks are going to be okay if maybe just a little charred around the edges."
      },
      {
        "start": 141500,
        "stop": 141800,
        "text": " But there's no rescuing this barbecue."
      },
      {
        "start": 141800,
        "stop": 141900,
        "text": " How much did you stake?"
      },
      {
        "start": 141900,
        "stop": 142200,
        "text": " Brent, I am too hungry for that crap."
      },
      {
        "start": 142200,
        "stop": 143100,
        "text": " You know, the listeners can't see, like, the actual billowing black smoke that was emanating here."
      },
      {
        "start": 143100,
        "stop": 143500,
        "text": " Yeah, I don't think anybody's cleaned out the grease trap in that barbecue in about five years."
      },
      {
        "start": 143600,
        "stop": 143800,
        "text": " We were large flames. We were worried there for a sec."
      },
      {
        "start": 143800,
        "stop": 144800,
        "text": " Yeah, like, it got, the flames got big enough, they were like, \"Do we have to worry about the backdraft factor when we open this thing to put it out? Is that going to be a problem?\""
      },
      {
        "start": 144800,
        "stop": 145300,
        "text": " We did forget about the, oh, what did they call those?"
      },
      {
        "start": 145300,
        "stop": 145700,
        "text": " Soyrizo."
      },
      {
        "start": 145700,
        "stop": 146200,
        "text": " I got myself some soyrizo sausage to put on the grill as well."
      },
      {
        "start": 146300,
        "stop": 147000,
        "text": " Yeah. Somehow we totally forgot about them the entire time we were grilling, so they got just roasted during that fire."
      },
      {
        "start": 147000,
        "stop": 147300,
        "text": " Well, I checked on them a little bit before the fire."
      },
      {
        "start": 147300,
        "stop": 147500,
        "text": " Well, thank you."
      },
      {
        "start": 147500,
        "stop": 148100,
        "text": " And they were still fine. But the fire really billowed up the back of the barbecue, and it really got those."
      },
      {
        "start": 148100,
        "stop": 148800,
        "text": " What you're saying is, Brent, you know, the fire, it just, it was just right on your food only. I don't know how to explain it."
      },
      {
        "start": 148900,
        "stop": 150300,
        "text": " It was some spicy food. Greasy, spicy food. But I actually got some camera footage of the grease fire, and so I was just looking at it before we sat down to record, and soon as we open the barbecue, we'll see what happens."
      },
      {
        "start": 150300,
        "stop": 151200,
        "text": " We first opened it, and we took some stuff off, and then we put it back down. And then the fire really went out of control. And that first time, it was already gone. It was too late."
      },
      {
        "start": 151300,
        "stop": 151900,
        "text": " We just didn't realize it. We were too focused on the potatoes. The Satoshi squares, which turned out to be not Satoshi squares."
      },
      {
        "start": 151900,
        "stop": 152800,
        "text": " But, you know, so we had this opportunity where the audience helped get Brent down here. We had some extra sats. We thought, let's feed everybody, because we really had no dinner plans. We've been way too busy."
      },
      {
        "start": 152900,
        "stop": 154600,
        "text": " So what we decided to do was use a service/website called Bit Refill. This is not a sponsorship or anything, it's just what we did. And Bit Refills just sells tons and tons and tons of different digital gift cards for everything."
      },
      {
        "start": 154700,
        "stop": 156200,
        "text": " I mean, it's crazy. And obviously they have grocery stores on there, and they have things like Instacart on there. And so we went the route of Instacart. So we used the sats to buy an Instacart gift certificate."
      },
      {
        "start": 156200,
        "stop": 157000,
        "text": " Well, a couple of them actually. Then loaded the app with that gift card and made the purchase like normal. So it was pretty great."
      },
      {
        "start": 157100,
        "stop": 157700,
        "text": " The only way we could have removed a step out of there would be if Instacart just took Lightning payments directly."
      },
      {
        "start": 157700,
        "stop": 158800,
        "text": " Yeah, that's the funniest part. Of all the steps in the chain, and there's a few, the actual Lightning payment, you know, once you get the invoice and then you can fill it out in your app, that's by far the fastest part out of all of the steps."
      },
      {
        "start": 158900,
        "stop": 160500,
        "text": " Yeah, it's just immediate. It's so great. And then you have the gift card instantly, which is really awesome. The UI on the apps and like loading the gift cards, that always sucks, right? You gotta get the app or whatever. Then there's UI to do it, it's always weird, but that has nothing to do with the sats or the Lightning."
      },
      {
        "start": 160500,
        "stop": 161500,
        "text": " So thank you for everybody who boosted into Office Hours and Linux Unplugged. The split that we set up for that gas fund is still in place and we may buy more stakes."
      },
      {
        "start": 161600,
        "stop": 162400,
        "text": " It still has to get home. Yeah, that's true. Yeah, I found it actually really fun to come up with different strategies to how to put these to use. So I hope we come up with some other."
      },
      {
        "start": 162400,
        "stop": 163500,
        "text": " Yeah, one of them is, you know, we thought like, because everybody always mentions this, every time we talk to people about what we're doing, people always say, well, why don't you just sell them and get the cash and buy whatever you want? We're like, well, of course we could just sell them."
      },
      {
        "start": 163500,
        "stop": 164100,
        "text": " That's not as much fun. That's not the point either, is it?"
      },
      {
        "start": 164200,
        "stop": 164900,
        "text": " Well, I want to take a moment and thank Linode for sponsoring this episode of Office Hours, linode.com/tupiter."
      },
      {
        "start": 164900,
        "stop": 166000,
        "text": " They're not only sponsoring Office Hours, but they're making this trip possible. It gives our team a chance to reconnect. We can build special content and have these special moments, but it also means we get to go tour JPL."
      },
      {
        "start": 166000,
        "stop": 167100,
        "text": " And why would Linode do that? What do they get out of it, right? What they get out of it is investment in a community that's going to advocate for them. They get out of it long-term planning, long-term investments."
      },
      {
        "start": 167100,
        "stop": 167700,
        "text": " And I think that shows you the kind of thinking that they do about this stuff. It's something that I really appreciate about them."
      },
      {
        "start": 167700,
        "stop": 168600,
        "text": " And it's really what drew me in as a customer. And now look where that's gone, right? I started using Linode over three years ago now, which is crazy."
      },
      {
        "start": 168600,
        "stop": 169300,
        "text": " I know some people have been using them for longer than a decade, but I started using them just over three years ago because I was at Texas Linux Fest."
      },
      {
        "start": 169300,
        "stop": 169800,
        "text": " And I think it was the second Texas Linux Fest I'd been to. I'm not positive. I can't remember now."
      },
      {
        "start": 169900,
        "stop": 170500,
        "text": " And it wasn't going good. They'd moved locations. Most of the vendors weren't taking it very seriously."
      },
      {
        "start": 170500,
        "stop": 171600,
        "text": " Linode showed up with a great booth, people that are excited to be there. They went a little above and beyond to make sure the conference could happen. They spent a little extra to support them."
      },
      {
        "start": 171600,
        "stop": 172400,
        "text": " And I thought, you know, look at them. They're really taking, I could tell Texas Linux Fest had some serious potential. I could tell it was one to take seriously."
      },
      {
        "start": 172500,
        "stop": 173500,
        "text": " And I thought, I can see that. They see it too. They see it too. That is a company that actually understands community. It understands free software development."
      },
      {
        "start": 173500,
        "stop": 174300,
        "text": " It understands what makes Linux tick at the real base level. And that's why they're here. And I'm like, next time I build something, I'm going to try it out on Linode."
      },
      {
        "start": 174300,
        "stop": 174900,
        "text": " Well, now they're doing it here with us, right? They're here. They're investing in something that builds community."
      },
      {
        "start": 175000,
        "stop": 175800,
        "text": " And my hope is when you're listening to this, you'll think, well, next time I want to build something on really great, really fast cloud hosting, I'm going to go to Linode."
      },
      {
        "start": 175800,
        "stop": 176600,
        "text": " You go to linode.com/jupiter. You get $100 in 60-day credit and you support the show. Linode.com/jupiter."
      },
      {
        "start": 176700,
        "stop": 178000,
        "text": " All right, what's next on our list there, boys? We talked about our trip so far. We haven't made it to JPL yet. And is our meetup tomorrow? No, JPL is tomorrow. The meetup's the day after the same day."
      },
      {
        "start": 178000,
        "stop": 178200,
        "text": " What are we even doing over here?"
      },
      {
        "start": 178200,
        "stop": 178400,
        "text": " It's all blurring together."
      },
      {
        "start": 178400,
        "stop": 178600,
        "text": " I guess we better figure that out after this."
      },
      {
        "start": 178600,
        "stop": 179000,
        "text": " But as this is releasing, it's going to be the day of the meetup."
      },
      {
        "start": 179100,
        "stop": 179800,
        "text": " So hopefully it went great. If you're hearing this by the time you're hearing this, hopefully it went. I'm sure it did. I'm sure it did."
      },
      {
        "start": 179800,
        "stop": 180200,
        "text": " I'm really looking forward to going to JPL and discovering all of their secrets. You know what I mean?"
      },
      {
        "start": 180200,
        "stop": 180700,
        "text": " You know, that makes me think we do have to drop another geocache around here somewhere."
      },
      {
        "start": 180700,
        "stop": 180900,
        "text": " We should. Yeah, we should."
      },
      {
        "start": 180900,
        "stop": 181100,
        "text": " We've got to think of something."
      },
      {
        "start": 181100,
        "stop": 181300,
        "text": " Yeah, we should do that tomorrow."
      },
      {
        "start": 181300,
        "stop": 181500,
        "text": " Good thinking."
      },
      {
        "start": 181600,
        "stop": 182100,
        "text": " We've published the new website. We've recently published the new website that our community built for us, like the heroes that they are."
      },
      {
        "start": 182100,
        "stop": 182700,
        "text": " An incredible story of value for value and community coming together to create something way beyond what we could have done on our own."
      },
      {
        "start": 182700,
        "stop": 182900,
        "text": " And it continues, even during the trip."
      },
      {
        "start": 182900,
        "stop": 183300,
        "text": " Yeah, I was actually really worried. I knew we'd be busy during the trip."
      },
      {
        "start": 183300,
        "stop": 183900,
        "text": " And I tried to put in as much work as I could before leaving to get to the studio."
      },
      {
        "start": 183900,
        "stop": 184400,
        "text": " And that was what, like a week and a half ago, something like that now? Has it been longer? I don't know anymore."
      },
      {
        "start": 184500,
        "stop": 184700,
        "text": " I think, yeah, a little bit longer. A couple of days longer."
      },
      {
        "start": 184700,
        "stop": 184800,
        "text": " I don't know."
      },
      {
        "start": 184800,
        "stop": 185400,
        "text": " It's really a weird thing. And if you're not going through it, it's hard to like really wrap your head around it, but everything's blurring together."
      },
      {
        "start": 185400,
        "stop": 186300,
        "text": " It reminds me a little bit of, some people know what this is like, is after you have children, the first few days all blur together after you have your child."
      },
      {
        "start": 186300,
        "stop": 186700,
        "text": " And that's what this road trip's been like. It's all one long Monday."
      },
      {
        "start": 186700,
        "stop": 187300,
        "text": " Yeah, and I kind of from our other road trips knew this was going to happen. I know this feeling. It's a familiar one. It's also a very fun one."
      },
      {
        "start": 187400,
        "stop": 187600,
        "text": " It is. And we're sprinting basically."
      },
      {
        "start": 187600,
        "stop": 188100,
        "text": " Yeah. And so amazing things happen. We get into a bunch of projects and trouble and all sorts of adventures."
      },
      {
        "start": 188100,
        "stop": 189000,
        "text": " And I knew that I wouldn't have the same time to put into the website as I did previously to do a bit of community engagement and those kinds of things."
      },
      {
        "start": 189000,
        "stop": 189100,
        "text": " But you know what?"
      },
      {
        "start": 189100,
        "stop": 189400,
        "text": " You can't approve MR's and drive a car at the same time, Brent?"
      },
      {
        "start": 189400,
        "stop": 189700,
        "text": " You know, they tell me that's dangerous."
      },
      {
        "start": 189700,
        "stop": 190000,
        "text": " But as a passenger he can, and he did."
      },
      {
        "start": 190100,
        "stop": 191100,
        "text": " That's true. You know, the new Dev.One that you both so generously got me, allowed me to work in the car on the way here for like, I think I worked five or six hours."
      },
      {
        "start": 191100,
        "stop": 192000,
        "text": " So great. Yeah, so when we left Jupes behind, I drove the Focus and Jeff drove his car down and Brent rode with Jeff and Hadiya rode with me."
      },
      {
        "start": 192000,
        "stop": 192500,
        "text": " So it just sort of worked out really nice because everybody got a car buddy and you got some work time."
      },
      {
        "start": 192600,
        "stop": 193200,
        "text": " It was actually really great and nice to become reacquainted with all of the work that's been happening there. And I was super blown away."
      },
      {
        "start": 193200,
        "stop": 193700,
        "text": " There's been a ton of stuff happening, Chris, while you and I have just been fooling around on this trip here."
      },
      {
        "start": 193700,
        "stop": 194700,
        "text": " I think there are two things that stand out for me. First is that we have a brand new 404 page that I think hearkens to the old website."
      },
      {
        "start": 194700,
        "stop": 194900,
        "text": " An homage, if you will."
      },
      {
        "start": 194900,
        "stop": 195100,
        "text": " An homage is a nice way to put it."
      },
      {
        "start": 195200,
        "stop": 195900,
        "text": " It's like the one good thing about the old website. So, you know, we took that and scrapped the rest. The 404 page! The frickin' 404 page!"
      },
      {
        "start": 195900,
        "stop": 197000,
        "text": " So thank you to C.J. Bass Player for taking that one on and making it happen. If you'd like to see it, just go to jupyterbroadcasting.com and then make up the rest."
      },
      {
        "start": 197000,
        "stop": 197900,
        "text": " Just screw it up and you'll see it. It is so great. I'm really glad we preserved that. A little bit of whimsy, if you will."
      },
      {
        "start": 197900,
        "stop": 198100,
        "text": " You got to have fun in there somewhere."
      },
      {
        "start": 198100,
        "stop": 198500,
        "text": " Okay, now there's a part I've been waiting to give more information about."
      },
      {
        "start": 198500,
        "stop": 199300,
        "text": " The workflow that gets rid of the cowboy in the room, which apparently is me. So tell me about this new workflow that's designed to protect everybody from Chris."
      },
      {
        "start": 199300,
        "stop": 199500,
        "text": " I thought you were a prospector?"
      },
      {
        "start": 199500,
        "stop": 200100,
        "text": " Prospector, Chris, yeah. So tell me about GitFlow and how we're using it to do smarter development."
      },
      {
        "start": 200200,
        "stop": 201300,
        "text": " Yeah, we've had many discussions about, okay, so up to this point, we like cowboys, not just you, Chris, all of us, have just been iterating very quickly on the website."
      },
      {
        "start": 201300,
        "stop": 202700,
        "text": " And all PRs have been just kind of modifying our main branch. And that's been okay, but I think it's time that we mature a little bit and maybe protect a few important gems."
      },
      {
        "start": 202800,
        "stop": 204800,
        "text": " So we've been having discussions in our issues and via the matrix room for, oh, it feels like a month now on how to address this and what are the best ways to get some, perhaps, live previews of some of the development that's happening without having to publish to production, which sounds like actually a really good idea not to screw things up."
      },
      {
        "start": 204900,
        "stop": 206400,
        "text": " And so I think the one we've settled on is GitFlow. And Wes, could you help me wrap my head around what this is doing for us? I think I've begun to understand it, but it sounds like you've got a little bit more experience than I do in this one."
      },
      {
        "start": 206500,
        "stop": 209400,
        "text": " Well, I think some of your aim here was to have an environment that you could merge PRs directly into before having to take that and deploy it to the main website, right? So you could have a staging environment of some kind where you could merge things together, integrate multiple different PRs, the different work, different changes, configuration updates, new features, evaluate that as a consistent release, and then at periodic times, sort of cut that over and promote that deployment."
      },
      {
        "start": 209400,
        "stop": 209900,
        "text": " Deploy it to the main branch, put it in production. Is that the idea that you were kind of going for?"
      },
      {
        "start": 210000,
        "stop": 212500,
        "text": " Exactly. Yeah. And I think what I'm noticing now is some of the problems that we're tackling on the website are multifaceted, and sometimes many PRs are interacting. And so if you're just pushing one domain, well, maybe that actually breaks things before you get to push a few others. So it sounds like maybe a much nicer way to solve some complex, niggly problems that maybe we're going to face in just a little bit."
      },
      {
        "start": 212600,
        "stop": 214400,
        "text": " But you have to be careful that you don't accumulate too many changes. If you're not doing regular deploys, you could get a really big difference between them. You also, depending on the team size, you might need folks involved. I think that's less of a problem here, especially since you've been doing such a great job of being informed on what's going on with the website, Brent."
      },
      {
        "start": 214500,
        "stop": 215700,
        "text": " And so you have a lot of features added, and you're trying to do a successful look at, did that deploy correctly? Did it break anything? Did those new things actually get added? You need to make sure that you have all that context or people around who can help with that."
      },
      {
        "start": 215800,
        "stop": 217800,
        "text": " I think one other advantage we're looking forward to is building in basically a live preview of the development branch that is on the exact same infrastructure that we can make some merges to and test things in real time without maybe that being public facing. I'm sure we'll make some mistakes, so we don't want that to be too public."
      },
      {
        "start": 217800,
        "stop": 218200,
        "text": " You know, it's always nice to have sameness, that's for sure."
      },
      {
        "start": 218300,
        "stop": 219100,
        "text": " It does seem like something we probably should be doing now. We've reached that phase of the development cycle, which is exciting. We're getting all grown up."
      },
      {
        "start": 219100,
        "stop": 219400,
        "text": " It's a successful project, right? I mean, very successful."
      },
      {
        "start": 219400,
        "stop": 220900,
        "text": " Yeah. It's been pretty great seeing work continue. There's some things that I feel like we should probably take a minute and jump in and have a conversation about with them, specifically just certain directions on future developments. We're lucky to have that issue."
      },
      {
        "start": 221000,
        "stop": 221900,
        "text": " There's a lot of things that people want to build, and they need information from us so they can build those apps in some sort of consumable format. And there's just a debate on how to do that."
      },
      {
        "start": 221900,
        "stop": 223600,
        "text": " And so one of the things that I always want to bring the conversation back to is we love our new website. The RSS feed whenever we can needs to be the source of truth because the website is probably the smallest way people consume content from JB."
      },
      {
        "start": 223700,
        "stop": 224700,
        "text": " And so we've underinvested in that website for so long, and we've promoted all of the individual show sites so heavily, we've just discouraged visiting jupyterbroadcasting.com."
      },
      {
        "start": 224700,
        "stop": 225200,
        "text": " I mean, until recently, officehours.hair is the URL we always mentioned, right?"
      },
      {
        "start": 225200,
        "stop": 225600,
        "text": " Right. I don't know otherwise what I think the main site had the calendar and had the live page."
      },
      {
        "start": 225600,
        "stop": 225800,
        "text": " And, you know, otherwise don't..."
      },
      {
        "start": 225800,
        "stop": 225900,
        "text": " You don't really need to go there."
      },
      {
        "start": 225900,
        "stop": 226000,
        "text": " You don't need to."
      },
      {
        "start": 226100,
        "stop": 227300,
        "text": " We always kind of keep...the website is one of the endpoint destinations of the information, but so is the podcast apps, so are YouTube, so is like all these things, and all of that needs to be really driven from the RSS feed."
      },
      {
        "start": 227300,
        "stop": 227600,
        "text": " The RSS feed needs to be the source of truth for all of that."
      },
      {
        "start": 227600,
        "stop": 227800,
        "text": " And so we just need to build things with that in mind."
      },
      {
        "start": 227800,
        "stop": 228300,
        "text": " And we just kind of keep repeating that mantra, is the RSS feed needs to be the source of truth."
      },
      {
        "start": 228300,
        "stop": 228600,
        "text": " That is essential for a podcast."
      },
      {
        "start": 228600,
        "stop": 228900,
        "text": " The RSS feed is our radio signal."
      },
      {
        "start": 229000,
        "stop": 229200,
        "text": " We are the RSS feed, really, right? I mean..."
      },
      {
        "start": 229200,
        "stop": 230800,
        "text": " Yeah. Yeah. And just so grateful for the fact that we can be really heads down on something like this and to have just things like that 404 page actually just get completely pushed out and developed while we're out here doing this."
      },
      {
        "start": 230800,
        "stop": 231700,
        "text": " And there are certainly other PRs that have been created and merged in that time, and I have been not involved at all."
      },
      {
        "start": 231800,
        "stop": 232800,
        "text": " So a huge thank you to Elray for kind of taking the reins and keeping things flowing nicely for the community. So another shout out to Elray once again."
      },
      {
        "start": 232800,
        "stop": 233100,
        "text": " You know, I think we have a boost from Elray too, so why don't we get into the boosts?"
      },
      {
        "start": 233100,
        "stop": 233600,
        "text": " And now it is time for Le Boost."
      },
      {
        "start": 233600,
        "stop": 234100,
        "text": " And our first boost actually comes in from True Grits, who sent in an enterprise boost of 1701."
      },
      {
        "start": 234200,
        "stop": 234900,
        "text": " And that's... this is belated. Congrats on the new website. I just checked it out and it looks much nicer."
      },
      {
        "start": 234900,
        "stop": 235200,
        "text": " Ooh, thank you for the feedback."
      },
      {
        "start": 235200,
        "stop": 235400,
        "text": " I love that people are still going out and checking it out."
      },
      {
        "start": 235400,
        "stop": 235700,
        "text": " That's True Grits, you know. That's a booster of high taste, I think."
      },
      {
        "start": 235800,
        "stop": 237200,
        "text": " Speaking of the Star Trek boost, the Enterprise boost, we found an all Star Trek TNG channel, and that's the only thing... we've never changed it. We got here, I had it on within five minutes of being at the Airbnb, and it's literally been on the entire time."
      },
      {
        "start": 237200,
        "stop": 238100,
        "text": " The amazing thing too is it started with Episode 1, Encounter at Farpoint, when I turned on the TV, and it's been going chronologically the entire time."
      },
      {
        "start": 238200,
        "stop": 239100,
        "text": " Now they're into Season 2, except for they skipped Tasha dying. Skin of Evil. I don't know why they skipped that episode, but they just skipped right over Tasha Yar dying."
      },
      {
        "start": 239100,
        "stop": 239300,
        "text": " She just disappeared."
      },
      {
        "start": 239300,
        "stop": 239900,
        "text": " Yeah, and in the Pluto TV Star Trek parallel universe version, Tasha Yar is still alive. She just hasn't shown up to work for a few days."
      },
      {
        "start": 239900,
        "stop": 240400,
        "text": " Thank you, True Grits. Jean Bean boosted in with elite sets of stats."
      },
      {
        "start": 240500,
        "stop": 242000,
        "text": " And Jean Bean writes, \"Have you ever considered using JB as a business that is an alternative to Fireside and other parts of podcasting infrastructure? You know, the way you could maybe monetize some of the work and learnings you guys have done on the back end."
      },
      {
        "start": 242000,
        "stop": 242900,
        "text": " What do you think, Wes? Should we take everything that's been built on the back end and bring it out to the market and compete with Fireside and all the others?\""
      },
      {
        "start": 242900,
        "stop": 243300,
        "text": " I don't know about compete, but there's a lot of good ingredients in there."
      },
      {
        "start": 243400,
        "stop": 244000,
        "text": " I don't think we have the, you know, we don't have any of the perks to offer, like your Spotify's and other closed platforms."
      },
      {
        "start": 244000,
        "stop": 245100,
        "text": " And it's a little tricky because there are already specifically a few like podcasting 2.0 tools and other platforms that exist that I think if you're doing one or two shows would work pretty well."
      },
      {
        "start": 245200,
        "stop": 246800,
        "text": " And Fireside and a few of the other competitors are hitting that market, but also a market that's a little above that. And I don't know if that higher market is interested in the like self-hosted or like free and open source nature necessarily of the tools and platforms as we are."
      },
      {
        "start": 246800,
        "stop": 247100,
        "text": " Are you saying we're a bit of a niche?"
      },
      {
        "start": 247100,
        "stop": 247500,
        "text": " Yeah, we definitely like to push the edge on the features. There's that."
      },
      {
        "start": 247600,
        "stop": 248200,
        "text": " The other thing is, is those services can live and die on their UI. We do not fuss a lot about UI for our tools."
      },
      {
        "start": 248200,
        "stop": 248400,
        "text": " We're audio, we're audio!"
      },
      {
        "start": 248500,
        "stop": 251000,
        "text": " And then the other thing that strikes me about it besides the pricing and how tricky that would be is, you know, the thing that we could focus on and feels pretty within our reach would be to kind of package up the website stuff and say, \"Hey, if you're looking for a kind of out of the box website for a podcast, especially like a network that has a couple of podcasts.\""
      },
      {
        "start": 251100,
        "stop": 251500,
        "text": " Man, there's nothing out there for podcast networks. Nothing out there."
      },
      {
        "start": 251500,
        "stop": 251700,
        "text": " Yeah, right. That has that notion built right in now."
      },
      {
        "start": 251700,
        "stop": 252700,
        "text": " Yeah. So I almost feel like if we were to refine the focus a little bit, that we could actually achieve. And really somebody could just go fork it right now and actually just do that on their own. We don't really have to do much."
      },
      {
        "start": 252700,
        "stop": 253200,
        "text": " But I think it's safe to say Gene Bean's right in that, yeah, we've obviously talked about this before."
      },
      {
        "start": 253200,
        "stop": 253600,
        "text": " Yeah. Technical issues boosted him with 5,000 sats."
      },
      {
        "start": 253600,
        "stop": 253800,
        "text": " Coming in hot with the boost!"
      },
      {
        "start": 253800,
        "stop": 254000,
        "text": " Every time."
      },
      {
        "start": 254000,
        "stop": 254800,
        "text": " He says, \"I saw Dave Jones boost this on Mastodon and I was curious about what you thought. The website is op3op3.dev.\""
      },
      {
        "start": 254800,
        "stop": 255500,
        "text": " And Wes, am I right? Is this sort of maybe like an open source, public podcast stats tracking service?"
      },
      {
        "start": 255500,
        "stop": 256800,
        "text": " Yeah, it's the Open Podcast Prefix Project. That's where the three comes from. And the idea is, you're a podcaster, podcast hosting company, maybe it's this fictional other spinout we've just made."
      },
      {
        "start": 256900,
        "stop": 257300,
        "text": " You can prepend their little URL to the start of your normal URL."
      },
      {
        "start": 257300,
        "stop": 257500,
        "text": " It's like a redirect?"
      },
      {
        "start": 257500,
        "stop": 258000,
        "text": " And then it's going to just do a quick little redirect. They talk later on about their edge locations all over the world."
      },
      {
        "start": 258000,
        "stop": 258400,
        "text": " Global CDN with 275 cities in over 100 countries."
      },
      {
        "start": 258500,
        "stop": 259900,
        "text": " And that's the one. And then yeah, they'll start collecting some metrics, according to various IAB standards and such, they talk about that too. But the metrics, they're intended to be open. Privacy focused, but open."
      },
      {
        "start": 259900,
        "stop": 260400,
        "text": " So they don't expose who's doing the downloading, but they do expose the podcast numbers."
      },
      {
        "start": 260400,
        "stop": 261300,
        "text": " Once you start using this prefix, you are opening up your show's listener numbers to the world, without compromising your listener's privacy."
      },
      {
        "start": 261400,
        "stop": 262300,
        "text": " And next to that, developers and companies can start building products and services for you with the data, without you having to manage a custom integration. So maybe that's some of the angle?"
      },
      {
        "start": 262300,
        "stop": 263100,
        "text": " Okay, I have some questions. Why would someone want to do this, compared to how it's done now? Which maybe we should explain as well."
      },
      {
        "start": 263200,
        "stop": 264600,
        "text": " It's close to how it's done now, with the exception of open numbers. And it's usually either companies that are in the podcast advertising selling business or Spotify. It's not like a super neutral party."
      },
      {
        "start": 264600,
        "stop": 265200,
        "text": " To that end, I actually think Fireside's one of the better metric collectors in the business."
      },
      {
        "start": 265300,
        "stop": 266200,
        "text": " I think one of the more popular ones would be Podtrack. There's also Chartable, Blueberry, some of these that people use. And they all kind of use HTTP redirects to count download numbers."
      },
      {
        "start": 266200,
        "stop": 267600,
        "text": " Then podcasters take that, and they use those numbers to set pricing for advertisers. That's where having them open could be kind of interesting. I would be willing to do it if everyone else in our space did it."
      },
      {
        "start": 267600,
        "stop": 267900,
        "text": " I was about to say it's one of those sort of first mover things, right?"
      },
      {
        "start": 268000,
        "stop": 268400,
        "text": " I'd love to play in that ecosystem if that's how the world was already working, but how do you get that shift to happen?"
      },
      {
        "start": 268400,
        "stop": 269400,
        "text": " I can also see it inspiring a bit of animosity, a little envy perhaps, between different podcasters that are in the same niche or something like that."
      },
      {
        "start": 269400,
        "stop": 270800,
        "text": " Well, I think that's where my question originates. What's the advantage other than just kind of making it transparent? Because it seems, to me at least, that I'm not sure really what you would get out of it."
      },
      {
        "start": 270900,
        "stop": 272000,
        "text": " Yeah, and I can tell you somebody's been doing this for 15 years. The download number is, I mean it matters, but it's one of probably five or six data points that I consider on how a show's doing."
      },
      {
        "start": 272000,
        "stop": 273100,
        "text": " And so a show that gets 10,000 downloads versus a show that gets 60,000 downloads. Well, if you just compare them by the numbers, like, okay, for example, office hours, right?"
      },
      {
        "start": 273200,
        "stop": 274000,
        "text": " I don't know what office hours' download numbers are because I don't care. It's not about that. It's about making a podcast for the JB audience that wants it."
      },
      {
        "start": 274000,
        "stop": 274900,
        "text": " And I don't care if it gets 10 downloads. Look at the community that we had built around it for like the website and helping you get gas in your tank."
      },
      {
        "start": 274900,
        "stop": 276100,
        "text": " And it has been immensely valuable for us. I don't even know what the download numbers are, right? What I follow is how many boosts are coming in, how many emails are coming in, what is the response we're getting in the matrix,"
      },
      {
        "start": 276100,
        "stop": 276400,
        "text": " what response we're getting in the matrix chat when we talk about this stuff, right?"
      },
      {
        "start": 276400,
        "stop": 276900,
        "text": " Well, I've noticed as well at the meetups just how much people are mentioning certain topics and office hours comes up."
      },
      {
        "start": 276900,
        "stop": 278000,
        "text": " Yeah, and those are the kind of numbers these days that I pay more attention to. I guess if I, I suppose if I was trying to be really aggressive about selling ads on office hours, I'd probably be more aware of what the numbers are."
      },
      {
        "start": 278100,
        "stop": 279200,
        "text": " I'm not as much because I'm not really actively doing that as long as the boosts stay pretty decent. We'll see. You never know. There's going to be more, probably more economic tightening. So who knows?"
      },
      {
        "start": 279200,
        "stop": 280300,
        "text": " But I personally am a little bit like a sconce at this Op3 dev, but I would love to hear Dave's thoughts on it. So I might have to go dig up his post on Mastodon."
      },
      {
        "start": 280300,
        "stop": 280600,
        "text": " I think the pod sage would probably get me thinking a little bit more about it."
      },
      {
        "start": 280700,
        "stop": 281900,
        "text": " And then check this out, guys. Frozier boosted in with a mega row of sticks, 111,000 stats and another 111 in there too. That's a big number that I can barely even get out this time at night."
      },
      {
        "start": 281900,
        "stop": 282100,
        "text": " Sounds like more stakes to me."
      },
      {
        "start": 282100,
        "stop": 282400,
        "text": " Definitely, definitely our baller booster for the night."
      },
      {
        "start": 282400,
        "stop": 283300,
        "text": " So thank you very much, Frozier. He just is a long time listener. Thanks for everything."
      },
      {
        "start": 283400,
        "stop": 284900,
        "text": " Absolutely. One of the meetups, I don't want to give too many details, but one of the meetups, we talked to a guy who was so early into Bitcoin that when he'd leave Bitcoin mining overnight on his PC, he'd get a block. He'd get 50 Bitcoin."
      },
      {
        "start": 284900,
        "stop": 285400,
        "text": " And he was annoyed the one night when he ran it overnight and didn't get 50 Bitcoin."
      },
      {
        "start": 285400,
        "stop": 285600,
        "text": " Oh my goodness."
      },
      {
        "start": 285600,
        "stop": 286300,
        "text": " Yeah. So he's like, you know, \"Thanks for the Bitcoin coverage.\" I'm like, \"You're welcome.\""
      },
      {
        "start": 286500,
        "stop": 287200,
        "text": " So funny. I mean, could you imagine like 50 Bitcoin a night? It was crazy back then. It was so crazy back then."
      },
      {
        "start": 287200,
        "stop": 288100,
        "text": " Oh, I am super happy to say our next booster is our website star contributor that we were just talking about this week. One amongst many, but one that comes up often on this show."
      },
      {
        "start": 288100,
        "stop": 288600,
        "text": " It is Mr. Elray who boosted in with a row of ducks."
      },
      {
        "start": 288700,
        "stop": 289700,
        "text": " 2222 sats and Elray writes, \"So I was able to get money into Albi while completely on mobile.\" This is something we were asking."
      },
      {
        "start": 289700,
        "stop": 290600,
        "text": " Albi is a browser extension that kind of lets you connect to your own node. It lets you bring your wallet between different applications and services and Podverse is one of them."
      },
      {
        "start": 290600,
        "stop": 291100,
        "text": " By the way, Podverse on Graphene OS. Thumbs up. Big thumbs up."
      },
      {
        "start": 291100,
        "stop": 291300,
        "text": " Is that some foreshadowing there?"
      },
      {
        "start": 291400,
        "stop": 292200,
        "text": " So Elray writes, \"I did have to use another app. I have Blue Wallet, which can generate the invoices for my Albi wallet. Then I go to the pay option in the strike app."
      },
      {
        "start": 292200,
        "stop": 293000,
        "text": " You'll then be able to paste the lightning request from Blue Wallet. If you click the QR code, you'll get that and you'll get a paste option and it all sends.\""
      },
      {
        "start": 293000,
        "stop": 293900,
        "text": " We were kind of playing around with this too. It's like tricky to set it up once. And then once you figure out the workflow, it's super fast."
      },
      {
        "start": 294000,
        "stop": 294600,
        "text": " The second time we did it, because we bought one gift card and a second gift card, the second time it was like 15 seconds."
      },
      {
        "start": 294600,
        "stop": 295300,
        "text": " The first time it took us like 10 minutes. Just figured it all out. You've got to get the workflow and figure out how to connect the apps."
      },
      {
        "start": 295300,
        "stop": 296600,
        "text": " It's an open system with an open protocol like HTTP, like SMTP. And in some cases you're connecting multiple applications together and you're moving things around this open network to get it in the right place."
      },
      {
        "start": 296700,
        "stop": 297600,
        "text": " I really like the combination of Albi and Podverse. It sounds like another great option is the Zeus wallet to move things around."
      },
      {
        "start": 297600,
        "stop": 298000,
        "text": " I'm going to play around with all this and come up with some official recommendations for working with Albi."
      },
      {
        "start": 298000,
        "stop": 298700,
        "text": " You know what I did while you both were recording LAN earlier today? I didn't actually share this."
      },
      {
        "start": 298800,
        "stop": 299800,
        "text": " Chris, you're going to have to help me because this time of night I forgot all the things I learned. I have a node that some of your wonderful sats come into. Thank you very much."
      },
      {
        "start": 299800,
        "stop": 300500,
        "text": " That's the node we set up for you on Linode that is in the split. So when you boost into office hours and LUP, the split goes to Brent's node."
      },
      {
        "start": 300500,
        "stop": 300700,
        "text": " We call it Brent's node."
      },
      {
        "start": 300700,
        "stop": 300900,
        "text": " It is called Brent's node."
      },
      {
        "start": 300900,
        "stop": 301300,
        "text": " Something like that. Only we should actually give out the actual name. But it's close to Brent's node."
      },
      {
        "start": 301400,
        "stop": 302300,
        "text": " I've been playing with that because we've been trying to get into that on this trip. Chris, you set me up with a bunch of channels to other people's nodes."
      },
      {
        "start": 302300,
        "stop": 303200,
        "text": " We had to play with that a little bit to try to use some of the sats that were on my node. So I played today with doing some circle..."
      },
      {
        "start": 303200,
        "stop": 303300,
        "text": " A loop?"
      },
      {
        "start": 303400,
        "stop": 304400,
        "text": " I was trying to rebalance some sats on certain channels and use a circular... what is that called when you move sats from one side to the other?"
      },
      {
        "start": 304400,
        "stop": 305000,
        "text": " You can loop in and loop out. There's a ring of fire. Did you do the ring of fire, Brent?"
      },
      {
        "start": 305000,
        "stop": 305200,
        "text": " That's really cool."
      },
      {
        "start": 305200,
        "stop": 305400,
        "text": " They're doing ring of fire."
      },
      {
        "start": 305400,
        "stop": 306200,
        "text": " Alright, so essentially what you're doing is sending out the sats from one channel and receiving them on another channel and balancing things out."
      },
      {
        "start": 306300,
        "stop": 306600,
        "text": " I don't know exactly what it was. But there was a name that everybody was using that I forget now."
      },
      {
        "start": 306600,
        "stop": 306800,
        "text": " Was it looped?"
      },
      {
        "start": 306800,
        "stop": 307100,
        "text": " We're just guessing shapes now? What does this show become?"
      },
      {
        "start": 307100,
        "stop": 307300,
        "text": " Was it triangle?"
      },
      {
        "start": 307300,
        "stop": 307500,
        "text": " It kind of sounds to me like maybe I should continue learning."
      },
      {
        "start": 307500,
        "stop": 307700,
        "text": " The square."
      },
      {
        "start": 307700,
        "stop": 307900,
        "text": " Ellipse."
      },
      {
        "start": 307900,
        "stop": 308600,
        "text": " That's great though. There's some people who hate that. I feel like it's a bit like Tamagotchi. You guys know what those are?"
      },
      {
        "start": 308600,
        "stop": 309100,
        "text": " I never really had one, but my Lightning node is kind of like my Tamagotchi pet."
      },
      {
        "start": 309200,
        "stop": 309300,
        "text": " I'm going to go ahead and check the channel."
      },
      {
        "start": 309300,
        "stop": 309500,
        "text": " We Tamagotchi envy over here."
      },
      {
        "start": 309500,
        "stop": 309800,
        "text": " Okay. I was doing some circular rebalancing."
      },
      {
        "start": 309800,
        "stop": 310000,
        "text": " Oh yeah, okay. A loop."
      },
      {
        "start": 310000,
        "stop": 310200,
        "text": " Yeah, okay, thanks."
      },
      {
        "start": 310200,
        "stop": 310500,
        "text": " No, actually it probably is a different. Somebody can explain it what it is."
      },
      {
        "start": 310500,
        "stop": 311100,
        "text": " But that's great. Good for you. Doing a little node maintenance. And so now you can get your outbound liquidity up."
      },
      {
        "start": 311100,
        "stop": 311300,
        "text": " That's exactly it."
      },
      {
        "start": 311400,
        "stop": 312200,
        "text": " I'm going to need it because Mr. Rustacastafursta comes in with 10,000 sats this week."
      },
      {
        "start": 312200,
        "stop": 313300,
        "text": " And they write, \"This boost is courtesy of Fountain. I'm in their beta group and because I'm providing a value of time and talent to them, they threw in some treasure my way and I'm happy to pass that along.\""
      },
      {
        "start": 313300,
        "stop": 313500,
        "text": " Well, that's amazing."
      },
      {
        "start": 313600,
        "stop": 315000,
        "text": " \"I have mixed feelings on how their earnings work, but at the end of the day, I'm happy it's here because it allows me to participate. I'm intimidated to go from fiat to digital currency only. I'm trying to educate myself more on the topic, but honestly, it's kind of a big leap.\""
      },
      {
        "start": 315000,
        "stop": 315300,
        "text": " Don't go kissing mountains, Brent. We need you."
      },
      {
        "start": 315300,
        "stop": 315500,
        "text": " Oh, thank you."
      },
      {
        "start": 315500,
        "stop": 315700,
        "text": " We still need to do some repairs on Brent's car when we get back."
      },
      {
        "start": 315700,
        "stop": 315900,
        "text": " It's true."
      },
      {
        "start": 315900,
        "stop": 316100,
        "text": " Just a little mountain kissing. Just a little bit."
      },
      {
        "start": 316100,
        "stop": 316300,
        "text": " There are only a few stones stuck in the front."
      },
      {
        "start": 316300,
        "stop": 316500,
        "text": " Just some rock stones."
      },
      {
        "start": 316500,
        "stop": 317400,
        "text": " It's a great ride. You know, the point here is well taken, Rustacasta. It is a little bit sketchy still to go from fiat. I love Robosats."
      },
      {
        "start": 317400,
        "stop": 318100,
        "text": " The great thing about Robosats, it's on tour, so you've got to go track it down, but when you go Google search Robosats, you'll find educational materials like the first link."
      },
      {
        "start": 318100,
        "stop": 318800,
        "text": " The beautiful thing about Robosats is it's more of a human experience. I know that sounds weird."
      },
      {
        "start": 318800,
        "stop": 318900,
        "text": " But robots in the name."
      },
      {
        "start": 319000,
        "stop": 319900,
        "text": " The only thing with this robot is you're just kind of like a generic avatar. So when you go to Robosats, it generates an avatar for you that's basically an encryption ID."
      },
      {
        "start": 319900,
        "stop": 320900,
        "text": " And then you can download that and save it, and then you can come back and use that same avatar over and over again so you build up a reputation, but it's not tied to any ID."
      },
      {
        "start": 320900,
        "stop": 321200,
        "text": " It just was randomly generated that one time when you loaded the website."
      },
      {
        "start": 321300,
        "stop": 322000,
        "text": " And then you go in and there's a buy and a sell side, and the sellers will list what they're willing to accept as payment."
      },
      {
        "start": 322000,
        "stop": 323000,
        "text": " And sometimes it's things like let's use the cash app, let's use strike, let's use revolt, or I've even seen like an Amazon gift card on one of them because they just choose what they want, right?"
      },
      {
        "start": 323000,
        "stop": 323900,
        "text": " And so you go there and you initiate the trade, you tell them how much you want, and you have to accept because they're going to have a little bit above market price, so you accept how much you're willing to trade."
      },
      {
        "start": 323900,
        "stop": 324200,
        "text": " So you say, I want, you know, a thousand sats or whatever."
      },
      {
        "start": 324200,
        "stop": 324900,
        "text": " It actually starts a chat process with that other person, and you exchange a little bit of information just to refine all the payment details."
      },
      {
        "start": 324900,
        "stop": 325500,
        "text": " There's an escrow process involved so it makes sure everybody gets everything they're supposed to and you can report if you didn't get it."
      },
      {
        "start": 325500,
        "stop": 325700,
        "text": " Of course it would affect their reputation too."
      },
      {
        "start": 325700,
        "stop": 326500,
        "text": " And in this process you have an actual quick exchange with the person you're buying from, and it ends up being a more human experience, and it's not a hassle."
      },
      {
        "start": 326500,
        "stop": 326700,
        "text": " It's just real quick."
      },
      {
        "start": 326700,
        "stop": 326800,
        "text": " Human sats."
      },
      {
        "start": 326900,
        "stop": 327900,
        "text": " So I like RoboSats. I recognize it's not like crazy simple and straightforward and that Chris is a little bit of a weirdo here because I'm okay loading up the Tor browser to go buy my sats."
      },
      {
        "start": 327900,
        "stop": 328900,
        "text": " But they've also made an Umbral app, so if you've got Umbral now, there is a RoboSats app that you can install and run your own local RoboSats using your own node information."
      },
      {
        "start": 328900,
        "stop": 329300,
        "text": " I just love that kind of crap, you know? I love it."
      },
      {
        "start": 329400,
        "stop": 330300,
        "text": " Every week when we bring up our doc for this show I think, \"There can't be that much podcasting news or Bitcoin-related stuff that we want to talk about.\""
      },
      {
        "start": 330300,
        "stop": 330700,
        "text": " But it turns out there's always tons. They're super, super fascinating."
      },
      {
        "start": 330700,
        "stop": 331200,
        "text": " I do want to mention as well, Rusticasta, thank you for getting involved with Fountain."
      },
      {
        "start": 331200,
        "stop": 331700,
        "text": " I think getting involved in a bunch of these pieces of software that we're using is amazing."
      },
      {
        "start": 331800,
        "stop": 332600,
        "text": " And that reminds me of how a bunch of our contributors to our website helped Podverse. Chris, you had some feedback on that one."
      },
      {
        "start": 332600,
        "stop": 332900,
        "text": " In fact, I want to get Mitch back on the show and talk about it."
      },
      {
        "start": 332900,
        "stop": 333500,
        "text": " But I had a nice note from Mitch, one of the co-creators of Podverse and one of the main developers."
      },
      {
        "start": 333500,
        "stop": 334700,
        "text": " And he just said he's had a great experience from contributors who are helping just like with bugs and little things here in Podverse here and there and catch stuff."
      },
      {
        "start": 334700,
        "stop": 335400,
        "text": " And he says some of the best technical contributions that they've had from outsiders to the project are from JB audience members."
      },
      {
        "start": 335400,
        "stop": 335700,
        "text": " They'll say, \"Oh yeah, I heard about it on JB,\" and they come contribute."
      },
      {
        "start": 335700,
        "stop": 335900,
        "text": " That is so dang cool."
      },
      {
        "start": 335900,
        "stop": 336400,
        "text": " And we hear about it from Mitch. We didn't even hear about it. The audience didn't stop by and go, \"Hey, guess what I did, guys?\""
      },
      {
        "start": 336400,
        "stop": 336800,
        "text": " They're just out there doing their thing. That's what's so great about it being open source."
      },
      {
        "start": 336900,
        "stop": 337900,
        "text": " It's long term, right? That's"
      },
      {
        "start": 337900,
        "stop": 338700,
        "text": " Also, just a really super quick note about Fountain and earning SATs. They just kind of redid how the earn system works. It's way easier to understand."
      },
      {
        "start": 338700,
        "stop": 339400,
        "text": " And they explain it all in a blog post. So go check that out if you're earning your SATs and you want to know how that works."
      },
      {
        "start": 339500,
        "stop": 340100,
        "text": " Just super briefly, Mr. Versa actually boosted in with a double boost this week, which is so great."
      },
      {
        "start": 340100,
        "stop": 341000,
        "text": " And they write, \"Here's a new show title idea,\" because I've been soliciting ideas from the audience on what to rename Office Hours, because it's just a horrible show name."
      },
      {
        "start": 341000,
        "stop": 342400,
        "text": " The idea was to talk about JB stuff and have a spot for the community to come in. That's still the idea, but the problem is that there's a billion podcasts named Office Hours, and about 900 million of them are all about the Office television show."
      },
      {
        "start": 342400,
        "stop": 343000,
        "text": " And then they get in here and they're like, \"Well, how come you guys aren't talking about the Office?\" And I'm like, \"Oh.\""
      },
      {
        "start": 343000,
        "stop": 343200,
        "text": " What are your thoughts on Jim and Pam, huh?"
      },
      {
        "start": 343200,
        "stop": 344000,
        "text": " Yeah, don't get me going, dude. Now, here's the thing. The cast of Versa had a recommendation for a new show name."
      },
      {
        "start": 344100,
        "stop": 345400,
        "text": " \"Sats and Chats with Chris.\" \"Sats and Chats.\" That's not that far off. I don't hate it. I don't hate it either. I don't think it's it, but it's cute."
      },
      {
        "start": 345400,
        "stop": 345600,
        "text": " Gets the ball rolling, that's for sure."
      },
      {
        "start": 345600,
        "stop": 346300,
        "text": " Yeah. We need something fun, though, because what I have in mindI don't even want to say it. It's so boring, but if nobody else has a better idea, I'm going to have to go with it."
      },
      {
        "start": 346300,
        "stop": 346700,
        "text": " \"Sats and Chats with Chris\" could be like an occasional livestream."
      },
      {
        "start": 346800,
        "stop": 347300,
        "text": " That's true, especially when we start generating our RSS feed and we get the lit tag in there so you can boost the live shows."
      },
      {
        "start": 347300,
        "stop": 347800,
        "text": " That could be a lot of fun to sit there and answer questions and, you know, just have a good old time."
      },
      {
        "start": 347800,
        "stop": 348300,
        "text": " Think about it. I like that idea, though. Thanks for sending something in Rusticast of Versa."
      },
      {
        "start": 348300,
        "stop": 349100,
        "text": " If you'd like to send a boost into the show, we'd love you to send us one using a new podcast app at newpodcastapps.com, and we have something special."
      },
      {
        "start": 349200,
        "stop": 350500,
        "text": " Editor Drew wanted to apologize to Rusticast of Versa, who was tricked into listening to an extended post-show that had nothing, just dead air, and he thought something Marvel-style would be coming at the end of the credits."
      },
      {
        "start": 350500,
        "stop": 350800,
        "text": " So Drew's just out there trolling our audience?"
      },
      {
        "start": 350800,
        "stop": 351700,
        "text": " Yeah, and he actually took a second to record a clip to Rusticasta, who boosted in complaining about this Marvel-style rug pull."
      },
      {
        "start": 351800,
        "stop": 352500,
        "text": " Dear Rusticast of Versa, Yes, I biffed it, and I hope that you accept this meow as an apology."
      },
      {
        "start": 352500,
        "stop": 352700,
        "text": " Meow!"
      },
      {
        "start": 352700,
        "stop": 352900,
        "text": " I've never gotten a meow before."
      },
      {
        "start": 352900,
        "stop": 353100,
        "text": " I love him so much."
      },
      {
        "start": 353100,
        "stop": 354200,
        "text": " If you'd like to get a boost into the show, newpodcastapps.com, go grab a new podcast app that's podcasting 2.0 compatible, or you can use something like your Breeze out there or Alby."
      },
      {
        "start": 354300,
        "stop": 354900,
        "text": " In fact, you can install Alby and then just boost through our website with the podcast player that we have embedded on the website. We've got POBVRTS now."
      },
      {
        "start": 354900,
        "stop": 355100,
        "text": " ALBY."
      },
      {
        "start": 355100,
        "stop": 355500,
        "text": " Yeah, ALBY. Check that out. It's a great open source extension."
      },
      {
        "start": 355500,
        "stop": 355700,
        "text": " Alright, boys, we did it. That's it."
      },
      {
        "start": 355700,
        "stop": 355900,
        "text": " Well done, gentlemen."
      },
      {
        "start": 355900,
        "stop": 356100,
        "text": " Are you ready for JPL?"
      },
      {
        "start": 356100,
        "stop": 356400,
        "text": " Well, first we have to welcome our final member of the crew."
      },
      {
        "start": 356400,
        "stop": 356900,
        "text": " That's true. That's true. We have Alex is just showing up right now as we're wrapping up the show. So we've got to get out of here so we can go say hi to Alex."
      },
      {
        "start": 356900,
        "stop": 357200,
        "text": " Also, everyone needs their beds back."
      },
      {
        "start": 357200,
        "stop": 357500,
        "text": " Yeah, there's that. He's going to go get in. Oh, I wish we could have recorded that."
      },
      {
        "start": 357500,
        "stop": 357900,
        "text": " Alex seen his room, just totally ripped apart."
      },
      {
        "start": 357900,
        "stop": 358200,
        "text": " No blankets. No pillows."
      },
      {
        "start": 358200,
        "stop": 358500,
        "text": " He's got the best internet in the house, though. So there's that."
      },
      {
        "start": 358500,
        "stop": 359300,
        "text": " Alright, everybody. Office hours is over. We'll see you back from the Pacific Northwest in a couple of weeks. Get out of here."
      },
      {
        "start": 359300,
        "stop": 359400,
        "text": " Thank you."
      },
      {
        "start": 359600,
        "stop": 359700,
        "text": " Thank you."
      }
    ],
    "processing_time": {
      "secs": 2214,
      "nanos": 151228429
    }
  },
  "metadata": {
    "title": "Office Hours 13: One Long Monday",
    "pictures": [],
    "duration": {
      "secs": 3581,
      "nanos": 32000000
    },
    "unique_id": "http://www.officehours.hair/13"
  },
  "episode": {
    "title": "One Long Monday | Office Hours 13",
    "description": "We get you caught up on one heck of a trip.",
    "content": "<p><p>We get you caught up on one heck of a trip.</p><p>Sponsored By:</p><ul><li><a href=\"https://linode.com/jupiter\" rel=\"nofollow\">Linode</a>: <a href=\"https://linode.com/jupiter\" rel=\"nofollow\">Get $100 to check out a rocking Linode system, and support the show!</a></li></ul><p>Links:</p><ul><li><a href=\"https://www.weekendbeercompany.com/\" title=\"Weekend Beer Company\" rel=\"nofollow\">Weekend Beer Company</a></li><li><a href=\"https://www.urbanrootsbrewing.com/\" title=\"Urban Roots Brewery/Smokehouse\" rel=\"nofollow\">Urban Roots Brewery/Smokehouse</a></li><li><a href=\"https://maps.app.goo.gl/vhVUm5En7RqdsLUn8?g_st=it\" title=\"4256'37.9\"N 12317'42.9\"W\" rel=\"nofollow\">4256'37.9\"N 12317'42.9\"W</a></li><li><a href=\"https://maps.app.goo.gl/adrdJY1NJv7n3p6s6?g_st=it\" title=\"3840'50.7\"N 12110'36.1\"W\" rel=\"nofollow\">3840'50.7\"N 12110'36.1\"W</a></li><li><a href=\"https://www.bitrefill.com/\" title=\"Bitrefill\" rel=\"nofollow\">Bitrefill</a></li><li><a href=\"https://github.com/JupiterBroadcasting/jupiterbroadcasting.com/pull/427\" title=\"Add 404 page by CGBassPlayer - Pull Request #427\n\" rel=\"nofollow\">Add 404 page by CGBassPlayer - Pull Request #427\n</a></li><li><a href=\"https://www.jupiterbroadcasting.com/test\" title=\"404 Page not found \" rel=\"nofollow\">404 Page not found </a></li><li><a href=\"https://github.com/JupiterBroadcasting/jupiterbroadcasting.com/issues/432\" title=\"Testing develop branch workflow #432\" rel=\"nofollow\">Testing develop branch workflow #432</a></li><li><a href=\"https://www.atlassian.com/git/tutorials/comparing-workflows/gitflow-workflow\" title=\"Gitflow Workflow\" rel=\"nofollow\">Gitflow Workflow</a></li><li><a href=\"https://error.show/\" title=\"User Error\" rel=\"nofollow\">User Error</a></li><li><a href=\"https://explore.fountain.fm/blog/fountain-0-4-8\" title=\"Fountain 0.4.8 - Referrals, Search Editorial and \" rel=\"nofollow\">Fountain 0.4.8 - Referrals, Search Editorial and </a></li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-8870",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15674314/948b8d94-8b24-46c8-b6b5-de39e7e57d81.mp3",
      "length": "50735476",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-09-30T03:05:00+02:00"
  },
  "speedup": 1.6173385
}