{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 672,
        "text": " While I'm talking to you today from England, hello to all my British compatriots. Is that even a word?"
      },
      {
        "start": 672,
        "stop": 1296,
        "text": " I'm not sure. Comrades. Comrades. That's a... Yeah. Uncle Vlad might want a word about that."
      },
      {
        "start": 1296,
        "stop": 1816,
        "text": " Yeah, that's all right. Today's a mouth organ sort of day, is it, for you? I do have it right"
      },
      {
        "start": 1816,
        "stop": 2352,
        "text": " here with me in the studio. You never know when you might need to, like, just to kind of punctuate"
      },
      {
        "start": 2352,
        "stop": 3232,
        "text": " a point. I need to paint a picture for those listening via audio. I have my microphone in"
      },
      {
        "start": 3232,
        "stop": 3832,
        "text": " front of me resting on a couple of pillows on a desk in the corner of my wife's childhood bedroom."
      },
      {
        "start": 3832,
        "stop": 4328,
        "text": " It's quite the setup. Yeah, and also it's another way of saying if you have problems with it, it's"
      },
      {
        "start": 4328,
        "stop": 4752,
        "text": " not Drew's fault. I mean, you know, that's not necessarily a Drew approved, but... No, I'm not"
      },
      {
        "start": 4752,
        "stop": 5248,
        "text": " sure it would be sound engineer 101, like, microphone placement or anything like that."
      },
      {
        "start": 5248,
        "stop": 5800,
        "text": " Are you getting hyped for the meetup? It's getting close. I am. Well, first of all, it's my sister's"
      },
      {
        "start": 5800,
        "stop": 6400,
        "text": " wedding this weekend, which is the entire reason that we're over here, and then my mind will move"
      },
      {
        "start": 6400,
        "stop": 6960,
        "text": " to the good people of the JB community, and I can start getting excited about that. But August 5th,"
      },
      {
        "start": 6960,
        "stop": 7320,
        "text": " for those of you that have forgotten or didn't know or are just hearing about it for the first"
      },
      {
        "start": 7320,
        "stop": 7888,
        "text": " time, August 5th, underneath the London Eye in the Jubilee Park Gardens. We're having a London"
      },
      {
        "start": 7888,
        "stop": 8368,
        "text": " meetup. I'll be there, Joe Resington will be there, and about a hundred other people, hundred"
      },
      {
        "start": 8368,
        "stop": 8896,
        "text": " other podcast friends. I've got stickers, so if you'd like a self-hosted sticker, limited edition"
      },
      {
        "start": 8896,
        "stop": 9576,
        "text": " diamond cut, very nice. I just saw in the London Colony Matrix chat room, one of the listeners that"
      },
      {
        "start": 9576,
        "stop": 10136,
        "text": " made it to the Raleigh meetup there in the States is getting on a plane in the next few days and"
      },
      {
        "start": 10136,
        "stop": 10736,
        "text": " flying out to London for the meetup. No way! That's so cool! He had that good of a time at the"
      },
      {
        "start": 10736,
        "stop": 11224,
        "text": " Raleigh meetup, at the Raleigh, as you say, meetup, which, I don't know, I take that as a compliment."
      },
      {
        "start": 11224,
        "stop": 11808,
        "text": " No pressure. The meetups have been well received, right? No. So meetup.com/JupiterBroadcasting for"
      },
      {
        "start": 11808,
        "stop": 12208,
        "text": " the details and timing and all that. I feel a little less organized for this one. I mean,"
      },
      {
        "start": 12208,
        "stop": 12656,
        "text": " the last one was 20 minutes from my house. This one is a little further than that, and,"
      },
      {
        "start": 12656,
        "stop": 13280,
        "text": " you know, I can't bring a tent this time and snacks and stuff. Yeah, I hear you. I feel"
      },
      {
        "start": 13280,
        "stop": 13768,
        "text": " unprepared when I show up to a meetup without Lady Joops, my RV, so I can imagine, you know,"
      },
      {
        "start": 13768,
        "stop": 14104,
        "text": " like, \"Oh, okay, we don't have the swag. We don't have the, okay, we don't have food."
      },
      {
        "start": 14104,
        "stop": 14672,
        "text": " We got beer. No, we don't got the beer. Okay, well, I guess it's just us.\" But you are off"
      },
      {
        "start": 14672,
        "stop": 15208,
        "text": " where I presume is also your future new off-site backup, or are you building something with the"
      },
      {
        "start": 15208,
        "stop": 15608,
        "text": " house you're staying at now? Tell us a little bit about that aspect of the trip. Yeah, it's been so"
      },
      {
        "start": 15608,
        "stop": 16168,
        "text": " exciting. It's been a magical mystery tour of England for me this last couple of weeks."
      },
      {
        "start": 16168,
        "stop": 16848,
        "text": " How's it now? We stayed at my sister's, my mum's, my dad's, and now we're staying at the mother-in-laws,"
      },
      {
        "start": 16848,
        "stop": 17384,
        "text": " and each of them have had their own unique levels of what they deem acceptable internet, which is"
      },
      {
        "start": 17384,
        "stop": 18104,
        "text": " often far from what Alex deems acceptable internet. I know exactly what you mean. Yeah,"
      },
      {
        "start": 18104,
        "stop": 18792,
        "text": " a 50 meg down and a couple of meg up is just about fine for remote working, so"
      },
      {
        "start": 18968,
        "stop": 19520,
        "text": " it's been interesting. The most interesting one was my dad's. He moved to a new house a few"
      },
      {
        "start": 19520,
        "stop": 20288,
        "text": " months ago, and his new internet was one step above garbage. We're talking single digits"
      },
      {
        "start": 20288,
        "stop": 21096,
        "text": " down, four or five meg down, and half a meg up through DSL, ADSL. It's just no good, so he got"
      },
      {
        "start": 21096,
        "stop": 21632,
        "text": " Starlink, and when we stayed with him for a few days, I got to try out Starlink for the first time,"
      },
      {
        "start": 21632,
        "stop": 22168,
        "text": " which was pretty interesting. That's it? Interesting? I mean, for some of us it's like a life"
      },
      {
        "start": 22168,
        "stop": 22992,
        "text": " changer. It's so cool, but yeah, I'm guessing not a great experience by that descriptor. As a city"
      },
      {
        "start": 22992,
        "stop": 23632,
        "text": " dweller who is used to the latency of a cable connecting me into the matrix, it's quite an"
      },
      {
        "start": 23632,
        "stop": 24400,
        "text": " adjustment. You can definitely tell when a certain satellite is direct overhead versus when it's off"
      },
      {
        "start": 24400,
        "stop": 24992,
        "text": " center. I actually took a time lapse of dishy in the garden just to see if I could see it moving"
      },
      {
        "start": 24992,
        "stop": 25568,
        "text": " around. You can't. I mean, I left it on there for 10 minutes and I couldn't see any movement of the"
      },
      {
        "start": 25568,
        "stop": 26000,
        "text": " dish, which I found interesting, but if you put your ear right next to the dish you can actually"
      },
      {
        "start": 26000,
        "stop": 26792,
        "text": " hear the motors adjusting as it goes over, which I found fascinating. But yeah, my very short"
      },
      {
        "start": 26792,
        "stop": 27408,
        "text": " review of Starlink, even though it was only for three or four days, is that in a pinch it'll do,"
      },
      {
        "start": 27408,
        "stop": 27960,
        "text": " but I would never buy a house that relies on Starlink as the primary internet connection."
      },
      {
        "start": 27960,
        "stop": 28640,
        "text": " And I think for me it's been an incredibly useful exercise actually to try Starlink out in the real"
      },
      {
        "start": 28640,
        "stop": 29144,
        "text": " world. Yeah, you were what? You've probably seen ping times on average in the mid-40s,"
      },
      {
        "start": 29144,
        "stop": 29512,
        "text": " hopefully. That's usually pretty good for Starlink. The speeds were fine,"
      },
      {
        "start": 29512,
        "stop": 30048,
        "text": " actually. We were getting 100 meg down and anywhere from 20 to 60 up, which is honestly"
      },
      {
        "start": 30048,
        "stop": 30712,
        "text": " it's perfectly fine for big bursts of traffic. We could stream videos just fine and things like that,"
      },
      {
        "start": 30712,
        "stop": 31544,
        "text": " but video calls, which are real time in nature, were not as reliable as I would like for a full"
      },
      {
        "start": 31544,
        "stop": 32216,
        "text": " time solution. And given that I work 100% remotely, it's very important to me. So"
      },
      {
        "start": 32320,
        "stop": 32728,
        "text": " that's really the main thing. It's just the fact that it wasn't consistent and that sometimes the"
      },
      {
        "start": 32728,
        "stop": 33504,
        "text": " pings were 10 to 30 milliseconds and sometimes they were up near 100. So it really depended on"
      },
      {
        "start": 33504,
        "stop": 34072,
        "text": " what mood it was in, it felt like. Yeah, on average, just collecting data for the weeks"
      },
      {
        "start": 34072,
        "stop": 34616,
        "text": " that I have right around mid-40s seems to be my average ping time when you consider the high end"
      },
      {
        "start": 34616,
        "stop": 35168,
        "text": " and the low time you'll see. And I completely agree with your assessment. It's great for folks"
      },
      {
        "start": 35168,
        "stop": 35888,
        "text": " that want to watch Netflix and it's fine for a lot of activities online, really. It's real time"
      },
      {
        "start": 35888,
        "stop": 36472,
        "text": " communications where it's still a little tricky and also game streaming. I have actually done"
      },
      {
        "start": 36472,
        "stop": 37080,
        "text": " some game streaming, but as I'm playing from time to time, that latency changes. So of course, then"
      },
      {
        "start": 37080,
        "stop": 37528,
        "text": " the performance in the game changes. Now, the one thing that is nice is because like you said, Alex,"
      },
      {
        "start": 37528,
        "stop": 38280,
        "text": " it is tied to the orbit of the satellite. So what that means is your ping times change gradually,"
      },
      {
        "start": 38280,
        "stop": 38808,
        "text": " right? It's not like you're getting 44 milliseconds, 44 milliseconds, 280, 280,"
      },
      {
        "start": 38808,
        "stop": 39432,
        "text": " 44. It's not that kind of choppy. It's a more consistent latency that it does matter on the"
      },
      {
        "start": 39432,
        "stop": 40112,
        "text": " distance. It's just physics that is traveling up to that satellite. Compared to LTE, which especially"
      },
      {
        "start": 40112,
        "stop": 40816,
        "text": " in the States is often met with bandwidth caps that I would exceed within a few days and then"
      },
      {
        "start": 40816,
        "stop": 41328,
        "text": " throttling on top of that and then capricious carriers that just change the rules and plans"
      },
      {
        "start": 41328,
        "stop": 41784,
        "text": " on you all the time. Or like you go the other route and you buy like these reseller packages."
      },
      {
        "start": 41784,
        "stop": 42224,
        "text": " I actually have one of those right now where it's technically it's like some enterprise plan that"
      },
      {
        "start": 42224,
        "stop": 42688,
        "text": " they're like relabeling. So you've got it on some deal. It's crazy kind of a gray market for"
      },
      {
        "start": 42688,
        "stop": 43256,
        "text": " cellular data. And they're always complicated. They always inevitably blow up on you. They're"
      },
      {
        "start": 43256,
        "stop": 43824,
        "text": " really expensive. They're more expensive than Starlink is per month. So when you look at what"
      },
      {
        "start": 43824,
        "stop": 44328,
        "text": " the options were for a lot of people compared to Starlink, Starlink is such an upgrade. But"
      },
      {
        "start": 44328,
        "stop": 44952,
        "text": " what I think is ridiculous is and you're seeing this a lot on the East Coast is people in homes"
      },
      {
        "start": 44952,
        "stop": 45624,
        "text": " are buying Starlink just because they don't want the they don't like their ISP or whatever it is."
      },
      {
        "start": 45624,
        "stop": 46096,
        "text": " So they're dropping their cable and DSL connections and switching over to Starlink,"
      },
      {
        "start": 46096,
        "stop": 46752,
        "text": " which is probably more expensive, I would think. Definitely slower and is overburdening the Starlink"
      },
      {
        "start": 46752,
        "stop": 47232,
        "text": " network. And now that Starlink has this RV package where they'll ship the dish to you immediately"
      },
      {
        "start": 47232,
        "stop": 47984,
        "text": " and any, you know, Tom or or Jane can buy one of these RV packages and then they can set it up at"
      },
      {
        "start": 47984,
        "stop": 48440,
        "text": " home and they have Starlink. They don't have to wait for Starlink to approve them through the"
      },
      {
        "start": 48440,
        "stop": 48968,
        "text": " current queue, which is based on capacity. And I think the whole thing is going to degrade the"
      },
      {
        "start": 48968,
        "stop": 49512,
        "text": " quality of the network and it's it's going to be that way until they can launch more satellites."
      },
      {
        "start": 49512,
        "stop": 50176,
        "text": " But all that said, it's what I use every, you know, every day for my home connection in Jupes."
      },
      {
        "start": 50176,
        "stop": 50560,
        "text": " And for me, it was it's been it's been a really big deal."
      },
      {
        "start": 50560,
        "stop": 51248,
        "text": " The reality is it's better than most other rural options, especially for people like you who are"
      },
      {
        "start": 51248,
        "stop": 51848,
        "text": " fully mobile. But I think for me, really, it was answering the question of could I buy a house in"
      },
      {
        "start": 51848,
        "stop": 52648,
        "text": " the sticks and rely on Starlink and not want to slit my wrists full time? Like, does this actually"
      },
      {
        "start": 52648,
        "stop": 53400,
        "text": " open up areas of real estate to me that were previously off limits? I don't think so. And I"
      },
      {
        "start": 53400,
        "stop": 53984,
        "text": " think it's just a personal judgment call that you've got to make. Yeah. And for some people,"
      },
      {
        "start": 53984,
        "stop": 54592,
        "text": " like the remote off grid elements are so much more of a priority that they'll take the, you know, the"
      },
      {
        "start": 54592,
        "stop": 55168,
        "text": " less ideal Internet connectivity. But if you do a lot of VoIP calls like you do right for work"
      },
      {
        "start": 55168,
        "stop": 55640,
        "text": " specifically, I think you're right. You really got to think about it. And there will be other options."
      },
      {
        "start": 55640,
        "stop": 56032,
        "text": " Amazon's working on some stuff. There's some other companies that are working on other solutions,"
      },
      {
        "start": 56032,
        "stop": 56552,
        "text": " and some of them will be even a lower distance of travel. So maybe they'll be even better."
      },
      {
        "start": 56552,
        "stop": 56896,
        "text": " So the other thing about Starlink that's worth talking about, I think, is the crappy"
      },
      {
        "start": 56896,
        "stop": 57512,
        "text": " router that they ship with that thing nowadays. So my dad got the Square Starlink Dishy Dish,"
      },
      {
        "start": 57512,
        "stop": 58320,
        "text": " which is the newer one as I understand it, which has got a built-in cable and it comes into this"
      },
      {
        "start": 58320,
        "stop": 59184,
        "text": " futuristic looking router that has a cool SpaceX logo on it, Starlink logo on it. But he had to buy"
      },
      {
        "start": 59184,
        "stop": 59784,
        "text": " the Ethernet adapter, which I think we got off the grey market on eBay for about £100, which is"
      },
      {
        "start": 59840,
        "stop": 60344,
        "text": " crazy just for an Ethernet adapter, but there you go. It's the only option to get it into the rest"
      },
      {
        "start": 60344,
        "stop": 60920,
        "text": " of the network, into the real world, for want of a better phrase, so he could hook it into his"
      },
      {
        "start": 60920,
        "stop": 61632,
        "text": " existing UniFi setup and all the rest of it. But when I was there, I was using Tailscale a lot to"
      },
      {
        "start": 61632,
        "stop": 62384,
        "text": " get back home and do a lot of stuff with, you know, everything that I do. And my subnet at home"
      },
      {
        "start": 62384,
        "stop": 63408,
        "text": " includes the range 192.168.1.0/20 I think. And the trouble with that is that the default Starlink"
      },
      {
        "start": 63408,
        "stop": 64528,
        "text": " subnet is 192.168.1.0. And if in Tailscale you have an overlapping subnet in the remote LAN versus"
      },
      {
        "start": 64528,
        "stop": 65088,
        "text": " where you are now, and then you try and do a DNS query, obviously it doesn't know where to root the"
      },
      {
        "start": 65088,
        "stop": 65520,
        "text": " packet because it thinks, well, that particular subnet's over here, when actually it's in both"
      },
      {
        "start": 65520,
        "stop": 66064,
        "text": " places, so it just loses its mind. It's not Tailscale's fault. Obviously it's the network"
      },
      {
        "start": 66064,
        "stop": 66672,
        "text": " design and, you know, it's my fault, really. And so I thought, okay, cool, how hard can it be to"
      },
      {
        "start": 66672,
        "stop": 67536,
        "text": " customize the subnet in a Starlink router? How hard could it be? Not possible. It's just not"
      },
      {
        "start": 67536,
        "stop": 68232,
        "text": " possible. I feel like the hardware is decent. I like that it's OpenWrt based. And they've done"
      },
      {
        "start": 68232,
        "stop": 68632,
        "text": " some really smart things in there in terms of like diagnostic capabilities and being able to speed"
      },
      {
        "start": 68632,
        "stop": 69096,
        "text": " test your Wi-Fi from the app and all that kind of stuff. That's really cool. I really like that bit."
      },
      {
        "start": 69096,
        "stop": 69744,
        "text": " However, with the Square Dishy, they have a dependency now on this router, which is"
      },
      {
        "start": 69744,
        "stop": 70472,
        "text": " just awful in my opinion, because in the past with the circular dish, I could go"
      },
      {
        "start": 70472,
        "stop": 71120,
        "text": " directly from the dish and take that ethernet cable and just plug it in the back of my router."
      },
      {
        "start": 71120,
        "stop": 71632,
        "text": " No Starlink router needed. And then I could manage it with my PEP link where I mixed it with my LTE"
      },
      {
        "start": 71632,
        "stop": 72280,
        "text": " and Wi-Fi connections. It was glorious. And now I have a router in the mix and I don't like it."
      },
      {
        "start": 72280,
        "stop": 72752,
        "text": " And it's another piece of gear that sucks power. And I don't like that. Although overall,"
      },
      {
        "start": 72752,
        "stop": 73120,
        "text": " the whole Dishy setup, the Square Dishy setup takes less power than the circular dish."
      },
      {
        "start": 73208,
        "stop": 73864,
        "text": " But you know, you get it right for like, you got to figure it's got to be 95% of people who buy"
      },
      {
        "start": 73864,
        "stop": 74384,
        "text": " this. This is probably a significantly better router than their ISP would give them."
      },
      {
        "start": 74384,
        "stop": 74896,
        "text": " Probably. But it's annoying knowing that it's OpenWrt under the hood and they don't expose"
      },
      {
        "start": 74896,
        "stop": 75360,
        "text": " even basic knobs like customizing the DHCP range."
      },
      {
        "start": 75360,
        "stop": 75872,
        "text": " I think the whole thought is that such a few amount of users would ever need that,"
      },
      {
        "start": 75872,
        "stop": 76152,
        "text": " that they don't want the support burden of it."
      },
      {
        "start": 76192,
        "stop": 76640,
        "text": " That's got to be it. But I've just kind of worked it out as much as I can. But I agree with you,"
      },
      {
        "start": 76640,
        "stop": 76944,
        "text": " it could be a lot better. So moving on to the next stage of my trip,"
      },
      {
        "start": 76944,
        "stop": 77448,
        "text": " we're now at the mother-in-law's in Norfolk. I brought my old UK server with me and it's now"
      },
      {
        "start": 77448,
        "stop": 78192,
        "text": " living at its new home. Best part is that she now has fiber. It's 500 down and 70 up, which is"
      },
      {
        "start": 78192,
        "stop": 78680,
        "text": " plenty for all for my needs remotely. There you go. That's better. Now we're talking."
      },
      {
        "start": 78680,
        "stop": 79224,
        "text": " With good ping times and everything else, the downside is she lives in a well over"
      },
      {
        "start": 79224,
        "stop": 79920,
        "text": " 100 year old cottage with several foot thick stone walls. Wi-Fi is a challenge."
      },
      {
        "start": 79920,
        "stop": 80384,
        "text": " I have two or three UniFi repeaters that I have installed here over the last few years."
      },
      {
        "start": 80384,
        "stop": 81032,
        "text": " And it works well enough. But obviously now she's got fiber, which she was using an LTE"
      },
      {
        "start": 81032,
        "stop": 81512,
        "text": " mast on the roof to get her internet before. I had to think about running ethernet through"
      },
      {
        "start": 81512,
        "stop": 81920,
        "text": " the house to cope with the new speeds. And my servers here, I want that hardwired,"
      },
      {
        "start": 81920,
        "stop": 82448,
        "text": " I don't want that on Wi-Fi, et cetera, et cetera. So I spent most of yesterday morning up a ladder"
      },
      {
        "start": 82448,
        "stop": 82944,
        "text": " running ethernet through the walls and drilling holes and pulling ethernet cable around the"
      },
      {
        "start": 82944,
        "stop": 83600,
        "text": " outside and over the top of the roof. It was fun. It's not something I want to do every day,"
      },
      {
        "start": 83600,
        "stop": 84088,
        "text": " but as a one-off, it was good fun. But it got me thinking about the various different things that"
      },
      {
        "start": 84088,
        "stop": 84728,
        "text": " you might want to start thinking about when cabling a house. You know, Cat 6a versus Cat 6,"
      },
      {
        "start": 84728,
        "stop": 85240,
        "text": " pass-through ethernet connectors. What type of crimping thing do you need? This was the first"
      },
      {
        "start": 85240,
        "stop": 86000,
        "text": " time I ordered, I pre-ordered some pass-through ethernet connectors, JAX RJ45 plugs. And"
      },
      {
        "start": 86000,
        "stop": 86512,
        "text": " essentially these things I think are going to change my ethernet termination game. They are the"
      },
      {
        "start": 86512,
        "stop": 87192,
        "text": " way to go. You line up all your cables in the right order. So you've got your orange and then"
      },
      {
        "start": 87192,
        "stop": 87720,
        "text": " your blue and green, whatever the spec you've chosen is. And then you line them all up and"
      },
      {
        "start": 87720,
        "stop": 88184,
        "text": " you shove them through the plug so that the strands actually poke out of the far side of the plug."
      },
      {
        "start": 88184,
        "stop": 88784,
        "text": " And then you use a crimping tool that actually snips off those cables at the perfect length."
      },
      {
        "start": 88784,
        "stop": 89328,
        "text": " Beforehand, what I've done is most ethernet plugs I've used before, you'd have to look really"
      },
      {
        "start": 89328,
        "stop": 90072,
        "text": " closely and sort of hope and check that all of the cables had got into the terminals and hope that"
      },
      {
        "start": 90072,
        "stop": 90560,
        "text": " all eight of your connections were in the right order and hadn't jumped a slot when you're"
      },
      {
        "start": 90560,
        "stop": 91032,
        "text": " shoving it in. But with the pass-through cables you can actually look at the cables that have"
      },
      {
        "start": 91032,
        "stop": 91456,
        "text": " come out the other side and go, right there's four solid colors there and there are four stripy colors"
      },
      {
        "start": 91456,
        "stop": 92136,
        "text": " there. They look about in the right order. Clip, done, test. I only did four plugs yesterday,"
      },
      {
        "start": 92136,
        "stop": 92768,
        "text": " but I think that's the first time I've done four plugs and got four plugs working. First time."
      },
      {
        "start": 92768,
        "stop": 93344,
        "text": " Right, I know what you mean. So if ever you're thinking about what cables to buy,"
      },
      {
        "start": 93344,
        "stop": 94000,
        "text": " what connectors to buy, spend a little bit extra if you're someone like me that does it once or"
      },
      {
        "start": 94000,
        "stop": 94784,
        "text": " twice every century and get the pass-through stuff. It does make your life a lot, lot easier."
      },
      {
        "start": 94784,
        "stop": 95256,
        "text": " That is a great little tip right there. I have seen those and totes agree. They're nice. It's"
      },
      {
        "start": 95256,
        "stop": 95600,
        "text": " such an easier way to do it because of the reason you said right there you can just check your"
      },
      {
        "start": 95600,
        "stop": 95952,
        "text": " colors, make sure you got everything in the right order and then you chop it."
      },
      {
        "start": 95952,
        "stop": 96384,
        "text": " Now the next thing that was on my plate was trying to figure out the firewall situation. So her"
      },
      {
        "start": 96384,
        "stop": 97136,
        "text": " fiber connection is a PPPoE fiber to the home connection. So I built an OpenSense router."
      },
      {
        "start": 97192,
        "stop": 98048,
        "text": " I ordered some parts off eBay. I brought an old CPU with me from the States, an i3 3200 or 3220,"
      },
      {
        "start": 98048,
        "stop": 98744,
        "text": " I think. Eight gigs of DDR3L RAM. The only thing I brought with me was the CPU."
      },
      {
        "start": 98744,
        "stop": 99352,
        "text": " Everything else I ordered from eBay basically at the airport whilst I was thinking about what I had"
      },
      {
        "start": 99352,
        "stop": 99712,
        "text": " to do whilst I was here. Not last minute at all. Okay."
      },
      {
        "start": 99792,
        "stop": 100344,
        "text": " And so it was, you know, 10 days before I needed it and luckily everything arrived."
      },
      {
        "start": 100344,
        "stop": 100840,
        "text": " I even remembered to order thermal paste. Somehow my brain remembered that thermal paste was the"
      },
      {
        "start": 100840,
        "stop": 101288,
        "text": " thing I was going to need. Wow, you really channeled that PC build energy. Nice."
      },
      {
        "start": 101288,
        "stop": 102096,
        "text": " Yeah. And so I built this router, sat on my lap and assembled the Intel DQ77KB motherboard."
      },
      {
        "start": 102184,
        "stop": 102824,
        "text": " That rolls off the tongue. This is a really nice mini ITX motherboard. It's got two gigabit NICs"
      },
      {
        "start": 102824,
        "stop": 103344,
        "text": " in it. One of them is colored red so I use that one as my WAN port and the other one is just black."
      },
      {
        "start": 103344,
        "stop": 103968,
        "text": " They're both Intel NICs. So OpenSense picks them up right away. Install of OpenSense took about"
      },
      {
        "start": 103968,
        "stop": 104680,
        "text": " four minutes. Really super simple. You burn the image onto a USB stick. I think I used Rufus on"
      },
      {
        "start": 104680,
        "stop": 105392,
        "text": " on my mother-in-law's desktop running Windows. Four minutes to install the OpenSense operating system."
      },
      {
        "start": 105392,
        "stop": 106000,
        "text": " Then it automatically detects the WAN and LAN links based on the IP addresses it's getting"
      },
      {
        "start": 106000,
        "stop": 106816,
        "text": " or not getting in some cases. And that's it. It could not be simpler to install an OpenSense system."
      },
      {
        "start": 106816,
        "stop": 107496,
        "text": " But I've got to say that that moment when you post a system that you've built from assembled parts of"
      },
      {
        "start": 107496,
        "stop": 108048,
        "text": " random eBay sellers for the first time. When you know you've only got two or three days so you"
      },
      {
        "start": 108048,
        "stop": 108680,
        "text": " don't have time to wait for more parts to come in. It's a squeaky bum moment. I'm going to tell you that."
      },
      {
        "start": 108680,
        "stop": 109240,
        "text": " Those eBay purchases are a roll of the dice a little bit. Although honestly, so is buying stuff"
      },
      {
        "start": 109240,
        "stop": 109752,
        "text": " new. I have probably more often than not received things brand new that haven't been functional than"
      },
      {
        "start": 109752,
        "stop": 110336,
        "text": " I have from eBay. I'm impressed A) that you had the forethought to get the thermal paste and B)"
      },
      {
        "start": 110392,
        "stop": 110816,
        "text": " that you're doing all of this ordering in the chaos of an airport. Which means you're like"
      },
      {
        "start": 110816,
        "stop": 111344,
        "text": " looking at the eBay listings. You're like reviewing the eBay listing. Maybe you're checking the reviews"
      },
      {
        "start": 111344,
        "stop": 111808,
        "text": " of the seller too. You're making all these decisions while wife and kid are with you in an"
      },
      {
        "start": 111808,
        "stop": 112408,
        "text": " airport and it all managed to work out. I'm going to say that's a little bit of luck and a little"
      },
      {
        "start": 112408,
        "stop": 113096,
        "text": " bit of ninja both. I'm going with 95% luck on that one. That it all just worked. Yeah. Right."
      },
      {
        "start": 113224,
        "stop": 113832,
        "text": " I put a 60 gig MSATA SSD in there. 8 gigs of RAM as I said. The reason I put so much RAM in this"
      },
      {
        "start": 113832,
        "stop": 114256,
        "text": " system is because I wanted to run a couple of services on this box. Now I've mentioned this"
      },
      {
        "start": 114256,
        "stop": 115056,
        "text": " before but you can install packages on OpenSense from a guys repo called I think it's MeMugMail."
      },
      {
        "start": 115056,
        "stop": 115360,
        "text": " I really don't know if I'm saying that right but there'll be a link in the show notes."
      },
      {
        "start": 115360,
        "stop": 116152,
        "text": " I'm able to run two critical packages directly on the firewall. The first of those is Tailscale."
      },
      {
        "start": 116152,
        "stop": 116920,
        "text": " I can run Tailscale on the router. That's great. That's worth it right there. Absolutely. I mean"
      },
      {
        "start": 116920,
        "stop": 117448,
        "text": " obviously I'm going to be setting up a direct wire guard endpoint on the firewall as well just as a"
      },
      {
        "start": 117448,
        "stop": 118008,
        "text": " backup but running Tailscale on the router itself is so nice because it gives me access to the"
      },
      {
        "start": 118008,
        "stop": 118528,
        "text": " entire subnet without worrying about if a particular machine is turned on. Anything like that. You know"
      },
      {
        "start": 118528,
        "stop": 119024,
        "text": " I've got exit node capabilities all that good stuff with Tailscale. So then I just installed"
      },
      {
        "start": 119024,
        "stop": 119464,
        "text": " Tailscale actually on my router in Raleigh and the router at my mum's house which has got the"
      },
      {
        "start": 119464,
        "stop": 120104,
        "text": " Synology. So I've now got a three node Tailscale OpenSense network going on. It's pretty sweet."
      },
      {
        "start": 120104,
        "stop": 120672,
        "text": " And then the other package that I've started installing on OpenSense is AddGuard Home"
      },
      {
        "start": 120672,
        "stop": 121160,
        "text": " directly on the router. So I use that as the primary DNS server on the router itself. I"
      },
      {
        "start": 121160,
        "stop": 121736,
        "text": " disable Unbound and then I point port 53 through into that service that's running on the router"
      },
      {
        "start": 121736,
        "stop": 122376,
        "text": " itself. So I have add blocking on the router and it means I can do DNS rewrites and all that kind"
      },
      {
        "start": 122376,
        "stop": 123184,
        "text": " of stuff if I need to for DNS reasons. It's just so nice. How did you communicate any of this to"
      },
      {
        "start": 123184,
        "stop": 123584,
        "text": " the family members? Do you say you're going to have ad blocking now on your network, you're welcome,"
      },
      {
        "start": 123584,
        "stop": 124104,
        "text": " or do you kind of not say anything and just see if they report an issue? What's your approach?"
      },
      {
        "start": 124104,
        "stop": 124672,
        "text": " It's easier to ask for forgiveness isn't it? Yeah. Well there is something to the fact that like if"
      },
      {
        "start": 124672,
        "stop": 125120,
        "text": " you tell them, I mean my family does this to me all the time, if I sit at their computer and then"
      },
      {
        "start": 125120,
        "stop": 125584,
        "text": " something breaks afterwards it's my fault even if I didn't even change anything right? So there's a"
      },
      {
        "start": 125584,
        "stop": 126024,
        "text": " bit of a logic to just not saying anything and just seeing how things go and just knowing that"
      },
      {
        "start": 126024,
        "stop": 126632,
        "text": " they're taken care of. So is that your approach? Yeah, particularly for the ad blocking stuff"
      },
      {
        "start": 126632,
        "stop": 127360,
        "text": " because you know I know that mobile games are quite popular in this household and they are"
      },
      {
        "start": 127360,
        "stop": 127888,
        "text": " really bad for ads and whenever I'm traveling with my wife she always goes \"God, I always forget when"
      },
      {
        "start": 127888,
        "stop": 128392,
        "text": " I'm at home just how many ads you're saving me, thank you!\" So I'm hoping that in six months time"
      },
      {
        "start": 128392,
        "stop": 128848,
        "text": " we'll have a conversation and she'll be like \"Oh yeah, well look at all these ads!\" And by the way,"
      },
      {
        "start": 128848,
        "stop": 129304,
        "text": " you know when I was out there I did a little something for you. Yeah and the upshot is for"
      },
      {
        "start": 129304,
        "stop": 129816,
        "text": " me I can do you know easier DNS rewrites and that kind of stuff and then I've got a standardized"
      },
      {
        "start": 129816,
        "stop": 130320,
        "text": " setup between the three different places because I do ad guard on all three, I do Tailscale now on"
      },
      {
        "start": 130320,
        "stop": 130816,
        "text": " all three, I've got OpenSense at all three sites. So yeah that is really nice, just keep it nice and"
      },
      {
        "start": 130816,
        "stop": 131400,
        "text": " consistent for you, less mistakes, easier to support. There will be a link in the show notes"
      },
      {
        "start": 131400,
        "stop": 131888,
        "text": " by the way to how I set that up. I am using ad guard as the primary DNS, I think it uses"
      },
      {
        "start": 131888,
        "stop": 132432,
        "text": " Unbound as a recursive or upstream provider which then finally after those two hops goes out to"
      },
      {
        "start": 132432,
        "stop": 132976,
        "text": " Cloudflare to the internet to do the final internet-based DNS resolution. You know it's"
      },
      {
        "start": 132976,
        "stop": 133496,
        "text": " so funny what you've done here, there is a place in the business world where this could be sold as"
      },
      {
        "start": 133496,
        "stop": 134096,
        "text": " a product for businesses and doctors offices and whatnot. You come in, you set up an open"
      },
      {
        "start": 134096,
        "stop": 134504,
        "text": " audible firewall and then if they have multiple branches something that they're always trying to"
      },
      {
        "start": 134504,
        "stop": 134896,
        "text": " solve is how to link those branches together so then you offer Tailscale as a solution to link"
      },
      {
        "start": 134896,
        "stop": 135408,
        "text": " those branches together. Ad guard does the DNS for them and the ad blocking to help make their"
      },
      {
        "start": 135408,
        "stop": 135952,
        "text": " systems safer. Like this, just this little thing that you've done on this trip could be sold as a"
      },
      {
        "start": 135952,
        "stop": 136456,
        "text": " standalone like service and offering product that a consulting company goes around because I have"
      },
      {
        "start": 136456,
        "stop": 137064,
        "text": " seen that in my days in IT. I have seen businesses that were using a lot worse technology, a lot worse"
      },
      {
        "start": 137064,
        "stop": 137536,
        "text": " software and hardware going around making a killing selling setups like this. I know that"
      },
      {
        "start": 137536,
        "stop": 138120,
        "text": " Tailscale aren't sponsoring today but I have used the heck out of Tailscale on this trip. It is,"
      },
      {
        "start": 138120,
        "stop": 138904,
        "text": " it's like dark magic sitting down in a foreign country typing a DNS entry that you know is at"
      },
      {
        "start": 138904,
        "stop": 139592,
        "text": " your house 3,000 miles away and it just loads behind a firewall. It's just so cool. We still"
      },
      {
        "start": 139592,
        "stop": 140168,
        "text": " have the URL or you know we could use coders to tailscale.com/coder or tailscale.com/ssh but yeah"
      },
      {
        "start": 140168,
        "stop": 140608,
        "text": " they are not a sponsor on this show but we love it still use it so there you go and you're right. If"
      },
      {
        "start": 140608,
        "stop": 141008,
        "text": " I was traveling over to families that's what I'd be setting up. You're really making me consider"
      },
      {
        "start": 141008,
        "stop": 141376,
        "text": " OpenSense and Adguard. I have to be honest with you for the network here at the studio"
      },
      {
        "start": 141488,
        "stop": 142112,
        "text": " I've been mostly for the content reasons and because it sounds fun I've been really considering"
      },
      {
        "start": 142112,
        "stop": 142720,
        "text": " just doing like a a Nixed base Raspberry Pi Compute Module 4 on a carrier board that has dual"
      },
      {
        "start": 142720,
        "stop": 143464,
        "text": " gigabit ethernet and then Nix is the OS and then just a really simple really basic command line"
      },
      {
        "start": 143464,
        "stop": 143952,
        "text": " firewall setup and just do everything through an SSH connection and just see how slim and minimal"
      },
      {
        "start": 143952,
        "stop": 144496,
        "text": " of a firewall I can make but Alex you make OpenSense seem so attractive especially with"
      },
      {
        "start": 144496,
        "stop": 145072,
        "text": " those add-ons that yeah that really does get me. Tailscale and Adguard sound really nice"
      },
      {
        "start": 145072,
        "stop": 145664,
        "text": " so I don't know. It's been great for me. I know I have a bit of a bugbear about people saying oh"
      },
      {
        "start": 145664,
        "stop": 146192,
        "text": " it's been rock solid. What does that phrase even mean? Like you know what I mean but"
      },
      {
        "start": 146384,
        "stop": 147256,
        "text": " it's been rock solid for me you know. There it is! Yeah I know it's been it's been really solid. I"
      },
      {
        "start": 147256,
        "stop": 147896,
        "text": " do know what you mean. I appreciate the stability that you're trying to imply with that so Alex likes"
      },
      {
        "start": 147896,
        "stop": 148440,
        "text": " it so much you know he's installing it for mom and dad so now the only question is are you going"
      },
      {
        "start": 148440,
        "stop": 148936,
        "text": " to leave them with any kind of docs or user logins or anything? What do you do there? I've got a"
      },
      {
        "start": 148936,
        "stop": 149448,
        "text": " Bookstack instance set up for them but I wondered what other people are using for family members and"
      },
      {
        "start": 149448,
        "stop": 149952,
        "text": " friends and things when you need to communicate basic information like what the wi-fi password"
      },
      {
        "start": 149952,
        "stop": 150552,
        "text": " you've set up is or what you know IP. Do family members need to know what IP address you have"
      },
      {
        "start": 150552,
        "stop": 151224,
        "text": " the access points set to? Probably not but you know basic stuff about the network that you've done"
      },
      {
        "start": 151224,
        "stop": 151704,
        "text": " if you got hit by a bus tomorrow they might need to know the answer to you know basic stuff like"
      },
      {
        "start": 151704,
        "stop": 152312,
        "text": " that. I've actually taken just to just a simple github flavored markdown file I then print out"
      },
      {
        "start": 152312,
        "stop": 153104,
        "text": " and leave in a drawer. It's not secure or anything like that but I feel like it speaks the language"
      },
      {
        "start": 153104,
        "stop": 153784,
        "text": " of you know non slightly less technical people which isn't to say a bad thing it's just you know"
      },
      {
        "start": 153784,
        "stop": 154456,
        "text": " how it is. Yeah I don't think you want to leave them something that they have no control over I"
      },
      {
        "start": 154456,
        "stop": 154800,
        "text": " mean like you know god forbid something happens to you you don't want them to have to tear everything"
      },
      {
        "start": 154800,
        "stop": 155264,
        "text": " out. You want somebody to come in and go oh I see what Alex did here yeah okay oh I see what the"
      },
      {
        "start": 155264,
        "stop": 155760,
        "text": " problem yeah yeah we can take care of this right that's what so I think that's a good goal. I would"
      },
      {
        "start": 155760,
        "stop": 156224,
        "text": " also be really interested to know what people are using for that because I feel like I've probably"
      },
      {
        "start": 156224,
        "stop": 156784,
        "text": " got a few family members I should document things for not to mention the wife so let us know."
      },
      {
        "start": 156944,
        "stop": 157600,
        "text": " Linode.com/SSH go there to get 100 dollars in 60-day credit on a new account and it's just a"
      },
      {
        "start": 157600,
        "stop": 158280,
        "text": " great way to support the show. Linode is the geeks cloud it's the DIY geeks cloud with 11 data centers"
      },
      {
        "start": 158280,
        "stop": 158848,
        "text": " worldwide they got something close to you a client a family member whatever you're trying to do."
      },
      {
        "start": 158848,
        "stop": 159328,
        "text": " They've been hard at work for nearly 19 years creating the best experience for running things"
      },
      {
        "start": 159328,
        "stop": 159832,
        "text": " in the cloud. If you want to build it yourself from the ground up their support is there for you"
      },
      {
        "start": 159832,
        "stop": 160360,
        "text": " they'll understand what you're talking about that's huge in our space but if you're still new and"
      },
      {
        "start": 160360,
        "stop": 160880,
        "text": " you're just trying to get experience they've also got a lot of really nice one-click stacks. You hit"
      },
      {
        "start": 160880,
        "stop": 161424,
        "text": " the button Linode deploys it for you and of course the performance is always incredible that's one of"
      },
      {
        "start": 161424,
        "stop": 162016,
        "text": " the things I love about it. Their reliability is unmatched they have built out and own their"
      },
      {
        "start": 162016,
        "stop": 162480,
        "text": " own network I mean really nobody does it like Linode because you'd have to have been around"
      },
      {
        "start": 162480,
        "stop": 163024,
        "text": " for nearly 19 years. I wouldn't host all of JB's stuff on there unless I felt nobody did it better"
      },
      {
        "start": 163024,
        "stop": 163408,
        "text": " seriously. I think you're going to really enjoy it when you get that 100 dollars and you kick"
      },
      {
        "start": 163408,
        "stop": 164016,
        "text": " the tires so go to linode.com/ssh check them out they've been rolling out new MVME storage"
      },
      {
        "start": 164016,
        "stop": 164568,
        "text": " they got database as a service if you are done with running a Postgres or a MongoDB or a MySQL"
      },
      {
        "start": 164568,
        "stop": 164936,
        "text": " database and you just want to have somebody else as an expert run it and manage it and back it up"
      },
      {
        "start": 164936,
        "stop": 165472,
        "text": " and take care of it and love on it for you they'll do that. They got a great dashboard their objects"
      },
      {
        "start": 165472,
        "stop": 166016,
        "text": " storage is super cool like use that as your own backup strategy guys go check out the object"
      },
      {
        "start": 166016,
        "stop": 166528,
        "text": " storage and connect it to a backup tool you're really going to be cooking with gas then that's"
      },
      {
        "start": 166528,
        "stop": 167096,
        "text": " a really great way to get some good solid off-site backups it's a great way to use 100 bucks too so go"
      },
      {
        "start": 167096,
        "stop": 167704,
        "text": " to linode.com/ssh for the best customer support super fast rigs great networking and a Linux"
      },
      {
        "start": 167704,
        "stop": 168184,
        "text": " culture that runs deep well there's a lot of reasons to choose Linode so go put it over the top"
      },
      {
        "start": 168184,
        "stop": 168648,
        "text": " get that 100 bucks and support the show linode.com/ssh."
      },
      {
        "start": 168648,
        "stop": 169248,
        "text": " My daughter helped me this morning clean out the server it hasn't been powered on for about four"
      },
      {
        "start": 169248,
        "stop": 169688,
        "text": " months and before that I don't think it's had a proper cleaning and certainly since I was here"
      },
      {
        "start": 169688,
        "stop": 170240,
        "text": " last September but some of the fans looked a little bit more crusty than that so we were"
      },
      {
        "start": 170240,
        "stop": 170680,
        "text": " outside on the patio with a little paint brush you know dusting out the fans and she was she was"
      },
      {
        "start": 170680,
        "stop": 171232,
        "text": " helping you know our kids do which got me thinking about different you know the hard drives that are"
      },
      {
        "start": 171232,
        "stop": 171832,
        "text": " in there and things like that and I just want to underscore the importance of directed airflow to"
      },
      {
        "start": 171832,
        "stop": 172664,
        "text": " the audience right now so my server here is a in a fractal define r5 case and it was missing just one"
      },
      {
        "start": 172664,
        "stop": 173224,
        "text": " of the five and a quarter inch blanking plates on the front of the cd-rom drives there's two of them"
      },
      {
        "start": 173296,
        "stop": 173832,
        "text": " so it's missing one of those and it's got two I think they're 120s they might be 140 mil fans"
      },
      {
        "start": 173832,
        "stop": 174408,
        "text": " directly underneath to pull air in at the front of the case last night the hard drives were running"
      },
      {
        "start": 174408,
        "stop": 175000,
        "text": " at about 50 celsius and this is in an ambient temperature of about 24 celsius so they were"
      },
      {
        "start": 175000,
        "stop": 175488,
        "text": " running pretty warm and so I thought this morning I'll just make a little blanking plate out of some"
      },
      {
        "start": 175488,
        "stop": 175992,
        "text": " duct tape and some cardboard and stick it over that little hole at the front just doing that"
      },
      {
        "start": 175992,
        "stop": 176624,
        "text": " lowered the drive temps by 11 celsius I couldn't believe it that's way more than I would expect"
      },
      {
        "start": 176624,
        "stop": 177024,
        "text": " geez man I come to think of it I've got a bad airflow situation right now with my hard drives"
      },
      {
        "start": 177024,
        "stop": 177440,
        "text": " I have the case cracked at the moment that's probably not good yeah just a little thing and I"
      },
      {
        "start": 177440,
        "stop": 177928,
        "text": " didn't expect it to make such a difference either but I think it just goes to show that with hard"
      },
      {
        "start": 177928,
        "stop": 178424,
        "text": " drives you've got to have the airflow directed in just the right way so it's actually going across"
      },
      {
        "start": 178424,
        "stop": 178984,
        "text": " them and not doing any kind of weird turbulence stuff anyway speaking of hard drives did you see"
      },
      {
        "start": 178984,
        "stop": 179744,
        "text": " this uh back blaze latest hard drive blog post that came out indeed I love this post they've been"
      },
      {
        "start": 179744,
        "stop": 180672,
        "text": " doing this like forever now since 2013 they select 10 drive models and then they of course have a ton"
      },
      {
        "start": 180672,
        "stop": 181272,
        "text": " of data like smart metrics and whatnot and they look at different models and different size ranges"
      },
      {
        "start": 181272,
        "stop": 182080,
        "text": " four terabytes eight terabytes 12 terabytes and now 14 terabytes to see what kind of reliability data"
      },
      {
        "start": 182080,
        "stop": 182944,
        "text": " that they can find and I always kind of find this a little stress-inducing I have to be honest with"
      },
      {
        "start": 182944,
        "stop": 183656,
        "text": " you like anything these days it seems to me that there's only two maybe three companies if we're"
      },
      {
        "start": 183656,
        "stop": 184216,
        "text": " being generous involved in what is a global market you know we were actually sat having dinner the"
      },
      {
        "start": 184216,
        "stop": 184856,
        "text": " other day looking around on the table and I made a joke that I bet you on this table there were like"
      },
      {
        "start": 184856,
        "stop": 185248,
        "text": " five or six different companies worth of condiments I said I bet you there's only two or three companies"
      },
      {
        "start": 185248,
        "stop": 185736,
        "text": " behind all these different things turned out it was two it was Nestle and some other company I'd"
      },
      {
        "start": 185736,
        "stop": 186272,
        "text": " never heard of but the Nestle have so many subsidiaries that you just you can't even"
      },
      {
        "start": 186272,
        "stop": 186928,
        "text": " fathom it they are just so unbelievably huge and the same factors are at play in the hard drive"
      },
      {
        "start": 186928,
        "stop": 187440,
        "text": " market so you've got Seagate and Western Digital and over the years those two companies have"
      },
      {
        "start": 187440,
        "stop": 188240,
        "text": " swallowed up everybody else including Hitachi Global Storage Tech, HGST, Toshiba, Samsung used"
      },
      {
        "start": 188240,
        "stop": 188848,
        "text": " to have a hard drive division there were loads of others and so quite often on the internet"
      },
      {
        "start": 188848,
        "stop": 189552,
        "text": " people will get into slinging wars about PlayStation versus Xbox or Apple Mac versus PC or"
      },
      {
        "start": 189552,
        "stop": 190104,
        "text": " Linux versus Windows and the hard drives are absolutely no different people are some people"
      },
      {
        "start": 190104,
        "stop": 190856,
        "text": " swear by Seagate some people swear by Western Digital and I think what this blog post just goes"
      },
      {
        "start": 190856,
        "stop": 191584,
        "text": " to show is that the entire internet's full of s***. Yeah and like they even dig into how even some"
      },
      {
        "start": 191584,
        "stop": 192208,
        "text": " drives that are labeled a Western Digital on the outside are actually an HGST on the inside and"
      },
      {
        "start": 192336,
        "stop": 192920,
        "text": " there's just so much shenanigans going on in the hard drive market I did not really fully"
      },
      {
        "start": 192920,
        "stop": 193600,
        "text": " appreciate how bad it has gotten until I read through all of this and honestly it just seems"
      },
      {
        "start": 193600,
        "stop": 194016,
        "text": " like outside of two years things just really start to get pretty shaky I mean there's definitely some"
      },
      {
        "start": 194016,
        "stop": 194600,
        "text": " models that last longer but beyond two years and I'm just like yikes and I've got I've got several"
      },
      {
        "start": 194600,
        "stop": 195208,
        "text": " oh I don't know 20-ish drives that are probably about four or five years old that I'm relying on"
      },
      {
        "start": 195208,
        "stop": 195768,
        "text": " right now. Oh that's getting to the danger zone bro. And they just have a lot of data right they've"
      },
      {
        "start": 195768,
        "stop": 196344,
        "text": " got a ton of disks they've got years of data. They do and they you know they're putting consumer grade"
      },
      {
        "start": 196344,
        "stop": 197040,
        "text": " drives through what are ostensibly enterprise grade workloads you know they're in data centers"
      },
      {
        "start": 197040,
        "stop": 197568,
        "text": " full of lots of other drives full of lots of other vibrations yes you could argue that the"
      },
      {
        "start": 197568,
        "stop": 198016,
        "text": " temperature controls and maintenance schedules might be a bit better than your average home user"
      },
      {
        "start": 198096,
        "stop": 198488,
        "text": " but you know the other environmental conditions like the vibrations I mentioned"
      },
      {
        "start": 198488,
        "stop": 199032,
        "text": " probably balance it out so that it's a fairly average picture of what's going on and I don't"
      },
      {
        "start": 199032,
        "stop": 199560,
        "text": " know of anybody else that publishes data on the scale that Backblaze does certainly not for drives"
      },
      {
        "start": 199560,
        "stop": 200128,
        "text": " that I can buy you know I'm sure AWS buy specific white label drives that are just for Amazon because"
      },
      {
        "start": 200128,
        "stop": 200656,
        "text": " they buy at such volume whereas Backblaze will buy model numbers that you and I mere mortals can go"
      },
      {
        "start": 200656,
        "stop": 201288,
        "text": " ahead and buy which is lovely. For me I'm looking at this data and I see that you know like you say"
      },
      {
        "start": 201288,
        "stop": 201880,
        "text": " two or three years after that kind of lifespan I'm going to want to start thinking about rotating my"
      },
      {
        "start": 201880,
        "stop": 202472,
        "text": " drives maybe not all at once because the bathtub curve and all you know the sheer cost of buying"
      },
      {
        "start": 202472,
        "stop": 203160,
        "text": " multiple hard drives all at once but it just goes to show you that you know probably every year you"
      },
      {
        "start": 203160,
        "stop": 203960,
        "text": " should be replacing 20% of your hard drive so that within a five-year span you are replacing the"
      },
      {
        "start": 203960,
        "stop": 204448,
        "text": " entire lot completely. There's lots of things you can do with all hard drives you can put them in"
      },
      {
        "start": 204448,
        "stop": 204920,
        "text": " backup servers you can make clocks out of them you could make coasters you could do all sorts of"
      },
      {
        "start": 204920,
        "stop": 205496,
        "text": " you'd sell them if you want to so it's not like they go completely to waste and you know every"
      },
      {
        "start": 205496,
        "stop": 205960,
        "text": " if you think about the the kind of storage increases that we see every five years as well"
      },
      {
        "start": 205960,
        "stop": 206640,
        "text": " you might go from a a four terabyte drive to a 16 terabyte drive in the same slot and then suddenly"
      },
      {
        "start": 206640,
        "stop": 207208,
        "text": " you don't need as many drives anymore and your five-year 20% become I don't know this there's"
      },
      {
        "start": 207208,
        "stop": 207720,
        "text": " a lot to consider. I'm looking at it thinking okay if you're really serious about data integrity"
      },
      {
        "start": 207720,
        "stop": 208080,
        "text": " you're probably looking at after about two years you're going to want to start rotating those disks"
      },
      {
        "start": 208080,
        "stop": 208600,
        "text": " to a different job at least maybe they're not done but maybe whatever your like really critical data"
      },
      {
        "start": 208600,
        "stop": 209392,
        "text": " is newer disks go in. I don't practice that I really don't but geez I think at some point what"
      },
      {
        "start": 209392,
        "stop": 210008,
        "text": " I've got to do is I've got to figure out a budget for just rolling disk replacements and you know"
      },
      {
        "start": 210008,
        "stop": 210368,
        "text": " we've had these ups and downs in the pricing market for these drives that's something the"
      },
      {
        "start": 210368,
        "stop": 211024,
        "text": " black the backblaze article touches on as well and so it sort of wrecked my ability to kind of just"
      },
      {
        "start": 211024,
        "stop": 211376,
        "text": " incrementally buy because there was periods where it was super cheap so you wanted to buy a lot and"
      },
      {
        "start": 211376,
        "stop": 211752,
        "text": " there's periods where it's super expensive so I didn't want to buy any and what we really need is"
      },
      {
        "start": 211752,
        "stop": 212376,
        "text": " just hard drive price stability in a way where I can just okay you know every year we're gonna buy"
      },
      {
        "start": 212376,
        "stop": 212784,
        "text": " 10 disks or something like that you know we're gonna buy it throughout the year or whatever."
      },
      {
        "start": 212784,
        "stop": 213360,
        "text": " Well you talk about dollar averaging with bitcoin in other aspects of your life you should do dollar"
      },
      {
        "start": 213360,
        "stop": 213856,
        "text": " averaging with hard drives. Yeah disk averaging yeah like once a month. And the way I look at it"
      },
      {
        "start": 213856,
        "stop": 214600,
        "text": " is every black friday I spend anywhere between 200 and 250 is my my kind of sweet spot in air quotes"
      },
      {
        "start": 214600,
        "stop": 215232,
        "text": " per drive dollars I'm talking about the best terabytes per dollar that I can get in that price"
      },
      {
        "start": 215232,
        "stop": 215712,
        "text": " range is typically what I'll buy every black friday and there were decent deals around prime"
      },
      {
        "start": 215712,
        "stop": 216416,
        "text": " day this year if you look on shucks.top so shuck stop you can get a good idea of the overall"
      },
      {
        "start": 216416,
        "stop": 217048,
        "text": " a kind of shocking kind of hard drive pricing scene with a snapshot of you know what the drive"
      },
      {
        "start": 217048,
        "stop": 217440,
        "text": " fluctuations have been and when the last historical low was and that kind of stuff"
      },
      {
        "start": 217440,
        "stop": 218152,
        "text": " and and generally speaking you'll find that 200 to 250 dollar range is at the moment I think"
      },
      {
        "start": 218152,
        "stop": 218696,
        "text": " they're about 14 or 16 terabyte drives in that price range which is I think I think it's pretty"
      },
      {
        "start": 218696,
        "stop": 219416,
        "text": " decent. Oh man all right I needed to hear this this is good for me I just I hate the actions I'm"
      },
      {
        "start": 219416,
        "stop": 219960,
        "text": " going to have to take as a result I appreciate the backblaze continues to put that data out of course"
      },
      {
        "start": 219960,
        "stop": 220424,
        "text": " we'll have the whole write-up linked in the show notes there's some really good graphs and I don't"
      },
      {
        "start": 220424,
        "stop": 221048,
        "text": " know tell me if you see something in there but to me it it looks like looks like the smaller drives"
      },
      {
        "start": 221048,
        "stop": 221672,
        "text": " tend to be a little more reliable I'd like to know your take on it. So Alex we got some feedback"
      },
      {
        "start": 221672,
        "stop": 222272,
        "text": " from a listener about leak detectors from Deckbot. We did from Deckbot who's in the discord hello"
      },
      {
        "start": 222272,
        "stop": 222696,
        "text": " Deckbot I hope you're having a nice day. Yeah thanks for joining us live. Hey Chris and Alex"
      },
      {
        "start": 222696,
        "stop": 223208,
        "text": " in episode 75 you were discussing leak detectors in a previous job we used leak detector tape"
      },
      {
        "start": 223208,
        "stop": 223984,
        "text": " to detect flooding on the water fittings in semiconductor LPCVD furnaces I have no idea what"
      },
      {
        "start": 223984,
        "stop": 224608,
        "text": " that means but liquid propane I'm guessing but I don't know after that commercial maybe probably"
      },
      {
        "start": 224608,
        "stop": 225280,
        "text": " yeah these were about 10 feet of cloth tape with two wires running on the outside edge any liquid"
      },
      {
        "start": 225280,
        "stop": 225784,
        "text": " or heavy feet on the tape would cause the electrical circuit between the two wires to"
      },
      {
        "start": 225784,
        "stop": 226408,
        "text": " short and trigger the water leak error in the PLC and this would also power down the equipment"
      },
      {
        "start": 226408,
        "stop": 226904,
        "text": " these tapes were a few meters long and we'd also make the tape snake across the floor in three inch"
      },
      {
        "start": 226904,
        "stop": 227480,
        "text": " strips I like these much more than typical flood sensors since you can draw a box around a leak"
      },
      {
        "start": 227480,
        "stop": 228040,
        "text": " prone device like a water heater or sink rather than waiting for the compartment holding the faulty"
      },
      {
        "start": 228040,
        "stop": 228592,
        "text": " devices to fill up enough to trigger a flood sensor while in my professional life they will"
      },
      {
        "start": 228592,
        "stop": 229224,
        "text": " remain as any drop of water or isopropyl alcohol misplaced on the tape powered off the furnace"
      },
      {
        "start": 229224,
        "stop": 229704,
        "text": " I wish I had the few extra bucks to add a few of these to my home assistant to watch for failed"
      },
      {
        "start": 229704,
        "stop": 230208,
        "text": " sump pumps and rusted out water heaters there'll be a link in the show notes to Deckbot's"
      },
      {
        "start": 230208,
        "stop": 230688,
        "text": " recommendation of these water leak detectors but you went a different route this week Chris no"
      },
      {
        "start": 230688,
        "stop": 231152,
        "text": " I did I mean this does look really great because the whole rope right is essentially a sensor and"
      },
      {
        "start": 231152,
        "stop": 231704,
        "text": " that that does seem pretty clever but I actually decided to go with a recommendation that we got"
      },
      {
        "start": 231704,
        "stop": 232368,
        "text": " into the show I got a Shelly flood sensor here and these Shelly flood sensors are wi-fi sensors"
      },
      {
        "start": 232368,
        "stop": 232888,
        "text": " that have little contacts on the bottom of them that detect water and they also have a temperature"
      },
      {
        "start": 232888,
        "stop": 233584,
        "text": " sensor in them and they're reasonably priced somewhere around 30 us bucks no hub required"
      },
      {
        "start": 233584,
        "stop": 234336,
        "text": " when it arrives it produces its own wi-fi network you join that wi-fi network and then you go to the"
      },
      {
        "start": 234336,
        "stop": 235016,
        "text": " web address like it's a 192.168.0.1 kind of a thing and you configure it to join your actual wi-fi"
      },
      {
        "start": 235016,
        "stop": 235600,
        "text": " network and then pretty much shortly after that home assistant detects it and says hey would you"
      },
      {
        "start": 235600,
        "stop": 236344,
        "text": " like to use the Shelly integration now this my friends this is where a choice will be made this"
      },
      {
        "start": 236344,
        "stop": 236824,
        "text": " is where early into the process you will reach a fork in the road you must choose if you want to go"
      },
      {
        "start": 236824,
        "stop": 237520,
        "text": " with native Shelly integration or if you want to use MQTT because of course everything in home"
      },
      {
        "start": 237520,
        "stop": 238232,
        "text": " assistant is just three steps away from using MQTT and the Shelly flood is no different now I"
      },
      {
        "start": 238360,
        "stop": 238824,
        "text": " because I had really no time to mess around just decided to use the native integration"
      },
      {
        "start": 238824,
        "stop": 239360,
        "text": " I had heard that in the past there was some issues but those issues had been resolved so I thought"
      },
      {
        "start": 239360,
        "stop": 240000,
        "text": " okay self we'll use the native Shelly integration so I went ahead and did that and now as we're"
      },
      {
        "start": 240000,
        "stop": 240640,
        "text": " looking right here at it during the show I have what everybody has and that is that now the Shelly"
      },
      {
        "start": 240640,
        "stop": 241288,
        "text": " temperature sensor is completely offline home assistant can no longer talk to it because the"
      },
      {
        "start": 241288,
        "stop": 241856,
        "text": " way the system is supposed to work is that when the temperature drops or when it detects a leak"
      },
      {
        "start": 241856,
        "stop": 242560,
        "text": " the device is supposed to wake up join your wi-fi and report back to home assistant and you can kind"
      },
      {
        "start": 242560,
        "stop": 243120,
        "text": " of configure that threshold of is it one percent is it you know one degree in temperature is it"
      },
      {
        "start": 243120,
        "stop": 243560,
        "text": " 0.5 degrees at two degrees in temperature what's the what's the threshold to wake up the device"
      },
      {
        "start": 243560,
        "stop": 244048,
        "text": " and then report back however that doesn't seem to be working for me clearly I should have gone"
      },
      {
        "start": 244048,
        "stop": 244496,
        "text": " the mqtt route which the rest of the internet would tell you as well I'm not particularly"
      },
      {
        "start": 244496,
        "stop": 245160,
        "text": " interested in doing that for reasons but I may eventually however my overall experience with"
      },
      {
        "start": 245160,
        "stop": 245896,
        "text": " the Shelly was pretty good and I am kind of in the process of looking at getting rid of some of"
      },
      {
        "start": 245896,
        "stop": 246456,
        "text": " my z-wave devices I am considering when I get back from my September west coast tour"
      },
      {
        "start": 246696,
        "stop": 247064,
        "text": " thinking about doing a nuke and pave and redoing my home assistant setup"
      },
      {
        "start": 247064,
        "stop": 247744,
        "text": " you have been threatening that for a number of months now I'm so annoyed dude I'm so annoyed"
      },
      {
        "start": 247744,
        "stop": 248264,
        "text": " I really just don't want to I have you know 60 z-wave devices or something stupid like that and"
      },
      {
        "start": 248264,
        "stop": 248744,
        "text": " I just don't want to go through and reset them up so I'm going to eliminate some of them and I'm also"
      },
      {
        "start": 248744,
        "stop": 249272,
        "text": " going to eliminate some of my home kit devices and I think I'm going to look at different Shelly"
      },
      {
        "start": 249272,
        "stop": 249832,
        "text": " devices that are wi-fi capable to see what I can replace with and so I kind of wanted to get some"
      },
      {
        "start": 249832,
        "stop": 250240,
        "text": " experience with these Shelly devices to see if I liked them to see if they'd be a candidate and I"
      },
      {
        "start": 250240,
        "stop": 250752,
        "text": " had some new plumbing in jups that I want to put a leak sensor on anyways and so this just seemed"
      },
      {
        "start": 250752,
        "stop": 251136,
        "text": " like a great opportunity to try it and I also kind of would like to know what the temperature is in"
      },
      {
        "start": 251136,
        "stop": 251744,
        "text": " that area so great this device does both and I like that it uses wi-fi it's not z-wave or zigbee"
      },
      {
        "start": 251832,
        "stop": 252344,
        "text": " they claim you can get 12 to 18 months of battery life it uses one of those three volt lithium"
      },
      {
        "start": 252344,
        "stop": 252976,
        "text": " cr123a a little batteries little duracells or whatever from wherever and the fact that"
      },
      {
        "start": 252976,
        "stop": 253464,
        "text": " homelessness and just detects it within seconds and offers up an integration in theory if that"
      },
      {
        "start": 253464,
        "stop": 253976,
        "text": " integration worked the way I wanted is a really nice experience and there is a ton of documentation"
      },
      {
        "start": 253976,
        "stop": 254440,
        "text": " to actually make this thing work the way I want do you know what I thought alex is when I was using"
      },
      {
        "start": 254440,
        "stop": 255168,
        "text": " this one of the things that struck me was there are areas where the home assistant developers could"
      },
      {
        "start": 255168,
        "stop": 255768,
        "text": " be closing the gap to make this a better user experience like when you connect something like"
      },
      {
        "start": 255768,
        "stop": 256592,
        "text": " a flood sensor you gotta figure there's a pretty like a 95 chance that if you get a flood connect"
      },
      {
        "start": 256592,
        "stop": 257168,
        "text": " if home assistant sees a flood sensor connect to the system and start receiving data you probably"
      },
      {
        "start": 257168,
        "stop": 257768,
        "text": " want an alert when the flood sensor detects a flood right like you can almost probably some"
      },
      {
        "start": 257768,
        "stop": 258288,
        "text": " people that don't but probably like 90 95 of the use cases they want to know when the flood detector"
      },
      {
        "start": 258288,
        "stop": 258848,
        "text": " detects a flood and there are lots of ways you can do this man I could get a notification of matrix"
      },
      {
        "start": 258848,
        "stop": 259448,
        "text": " and telegram I could rig up some push notifications I mean there's a lot of ways a lot of really great"
      },
      {
        "start": 259448,
        "stop": 260032,
        "text": " ways you can solve push notifications in home assistant but a nothing tells you you need to"
      },
      {
        "start": 260032,
        "stop": 260616,
        "text": " do it b nothing helps you do it and c nothing's like I push a button and now I'm getting push"
      },
      {
        "start": 260616,
        "stop": 261240,
        "text": " notifications from this integration and to me this just seems like a no-brainer Nebu Casa"
      },
      {
        "start": 261240,
        "stop": 261784,
        "text": " integration like if you're paying for the monthly Nebu Casa home assistant service"
      },
      {
        "start": 261784,
        "stop": 262288,
        "text": " it seems like a no-brainer that they could be routing push services through that to the app"
      },
      {
        "start": 262288,
        "stop": 262776,
        "text": " that I already also have connected to the Nebu Casa cloud service and the Nebu Casa servers"
      },
      {
        "start": 262776,
        "stop": 263264,
        "text": " offer push notification capabilities for developers so like the infrastructure is there"
      },
      {
        "start": 263264,
        "stop": 263856,
        "text": " like everything's there I just need a button that says get push notifications about this and oh by"
      },
      {
        "start": 263856,
        "stop": 264280,
        "text": " the way if you're a home assistant member you get those push notifications automatically like that"
      },
      {
        "start": 264280,
        "stop": 264808,
        "text": " just seems like a no-brainer value add that they could do and you would need something in particular"
      },
      {
        "start": 264808,
        "stop": 265360,
        "text": " that would work with iOS's time sensitive notifications and whatever the equivalent is"
      },
      {
        "start": 265360,
        "stop": 265712,
        "text": " on Android because you need something that'll break through like do not disturb because for"
      },
      {
        "start": 265712,
        "stop": 266296,
        "text": " a flood sensor like I'm in I'm in I'm in a recording focus mode right now nothing but my wife"
      },
      {
        "start": 266296,
        "stop": 266800,
        "text": " and maybe a kid can get through this but a leak sensor I'd also like to get through so you need"
      },
      {
        "start": 266800,
        "stop": 267280,
        "text": " something that could actually support time sensitive notifications on iOS and I've conveniently"
      },
      {
        "start": 267280,
        "stop": 267784,
        "text": " linked the documentation for that from Apple's developer portal in the show notes you know I'd"
      },
      {
        "start": 267784,
        "stop": 268208,
        "text": " like to see things like that as part of the works with home assistant program that we covered last"
      },
      {
        "start": 268208,
        "stop": 268920,
        "text": " week on the show you know you might just imagine if Shelly were on that program and as part of that"
      },
      {
        "start": 268920,
        "stop": 269664,
        "text": " program there was a bunch of magic that became available to those developers such as exactly"
      },
      {
        "start": 269664,
        "stop": 270504,
        "text": " what you just articulated yeah that'd be so great however I gotta say all that aside really impressed"
      },
      {
        "start": 270504,
        "stop": 271088,
        "text": " with the Shelly setup you know the fact that it was super quick to connect to had a really easy"
      },
      {
        "start": 271088,
        "stop": 271568,
        "text": " to use admin interface built into it anybody that's probably used a Shelly has seen this before"
      },
      {
        "start": 271568,
        "stop": 272232,
        "text": " that even though this device isn't functioning with home assistant the way I want I've decided to go"
      },
      {
        "start": 272232,
        "stop": 272712,
        "text": " ahead and pick up a couple of other products from them because I was overall very impressed and so"
      },
      {
        "start": 272712,
        "stop": 273400,
        "text": " I'm getting the Shelly plus H&T which is their e-ink humidity and temperature sensor that has"
      },
      {
        "start": 273400,
        "stop": 273992,
        "text": " a little display and then of course reports back to home assistant over wi-fi we'll see how this"
      },
      {
        "start": 273992,
        "stop": 274496,
        "text": " works I'm assuming probably going to be the same thing MQTT would be probably a better route to go"
      },
      {
        "start": 274496,
        "stop": 275008,
        "text": " but I'm going to give it a shot that looks remarkably similar to the Xiaomi sensors that"
      },
      {
        "start": 275008,
        "stop": 275744,
        "text": " I have which are BLE is this a wi-fi thing it is yeah because those BLE ones I have are about 90%"
      },
      {
        "start": 275744,
        "stop": 276688,
        "text": " reliable which is just about enough but if it's yeah they look really great no bluetooth is ideal"
      },
      {
        "start": 276688,
        "stop": 277296,
        "text": " to me I'm coming around to the idea of just having everything I can on wi-fi and just like saturate"
      },
      {
        "start": 277296,
        "stop": 277600,
        "text": " that iot network because I mean that's you know that's what I have it for the other nice thing"
      },
      {
        "start": 277600,
        "stop": 278272,
        "text": " though about it look at this it's 39 it's 39.50 for this Shelly plus H&T it's a pre-order right"
      },
      {
        "start": 278272,
        "stop": 278776,
        "text": " now but it's shipping I think like mid-august or early august and it's e-ink is yours are the BLE"
      },
      {
        "start": 278776,
        "stop": 279320,
        "text": " ones also e-ink for the display no I don't think so I think they use those typical kind of LCD"
      },
      {
        "start": 279320,
        "stop": 279976,
        "text": " segment displays yeah so they're saying you know at least a year of battery life with the e-ink"
      },
      {
        "start": 279976,
        "stop": 280880,
        "text": " display and then it has USB-C for always on power or you know charging so one of the things I think"
      },
      {
        "start": 280880,
        "stop": 281424,
        "text": " I'm going to do is I'll have mine connected to USB power permanently and so then they'd be reporting"
      },
      {
        "start": 281424,
        "stop": 282216,
        "text": " constantly I just noticed this sucker needs four AA batteries yeah that's quite a lot right I'll"
      },
      {
        "start": 282216,
        "stop": 282640,
        "text": " just do continuous USB so that way it's always reporting because I think that's the difference"
      },
      {
        "start": 282640,
        "stop": 283048,
        "text": " right if it's on battery power it wants to save that battery power so it shuts everything down"
      },
      {
        "start": 283048,
        "stop": 283784,
        "text": " and home assistant loses connection with it so the Shelly plus H&T I've already ordered it'll be a bit"
      },
      {
        "start": 283784,
        "stop": 284240,
        "text": " and then I have not ordered yet but I think this is going to be one of the next things I try from"
      },
      {
        "start": 284240,
        "stop": 285144,
        "text": " them is the Shelly plug which is this is the US edition and also again wi-fi it's the smallest wi-fi"
      },
      {
        "start": 285144,
        "stop": 285824,
        "text": " plug I've ever seen I've only seen z-wave devices this small and that means it doesn't block the"
      },
      {
        "start": 285824,
        "stop": 286424,
        "text": " other power port on a like a wall plug there you could stack two of them on one wall outlet"
      },
      {
        "start": 286424,
        "stop": 287296,
        "text": " doesn't require a hub that looks to me like they're reusing the the housing of the Tekin SP20 and"
      },
      {
        "start": 287296,
        "stop": 288088,
        "text": " actually the cloud free shop smart plug I thought so too I thought it looked very similar I did try"
      },
      {
        "start": 288088,
        "stop": 288432,
        "text": " to come I thought the same thing I tried to compare some pictures and I thought maybe I"
      },
      {
        "start": 288432,
        "stop": 289000,
        "text": " saw a few small housing differences but it's like the same exact size the buttons in the same place"
      },
      {
        "start": 289000,
        "stop": 289536,
        "text": " I wonder if there's some kind of regulatory shortcut they've taken there with you know"
      },
      {
        "start": 289536,
        "stop": 290080,
        "text": " getting that particular device through the FCC or something like that just an interesting observation"
      },
      {
        "start": 290080,
        "stop": 290512,
        "text": " not all these smart plugs let you pull like a lot of power through this thing can go up to like 2500"
      },
      {
        "start": 290512,
        "stop": 290888,
        "text": " watts it can have going through it which is great if you want to have like a space heater or a really"
      },
      {
        "start": 290888,
        "stop": 291520,
        "text": " powerful other device on there and it does power metering so it'll do live power collection stats"
      },
      {
        "start": 291520,
        "stop": 291928,
        "text": " I'm hoping that that'll just feed right into home assistant but we shall see when I do finally get"
      },
      {
        "start": 291928,
        "stop": 292448,
        "text": " around to ordering these so those are what I'm looking at right now is these shellies and I'm"
      },
      {
        "start": 292448,
        "stop": 292992,
        "text": " hoping that this will be kind of the components I can put together combined with keeping like the"
      },
      {
        "start": 292992,
        "stop": 293584,
        "text": " best of my z-wave devices like I love my AOTech multi sensors I'm hoping that I'll keep some of"
      },
      {
        "start": 293584,
        "stop": 294096,
        "text": " my z-wave devices I'll eliminate some of the ones that are kind of a pain in my butt I'll eliminate"
      },
      {
        "start": 294096,
        "stop": 294712,
        "text": " some of the home kit devices and I'll replace them with some shelly shelly and maybe something else"
      },
      {
        "start": 294712,
        "stop": 295120,
        "text": " I'm actually would really like to know people's recommendation and what they've done here I'd be"
      },
      {
        "start": 295120,
        "stop": 295656,
        "text": " interested to see what you think of replacing the firmware on a couple of the shelly devices it's"
      },
      {
        "start": 295656,
        "stop": 296160,
        "text": " a pretty common thing to do some people put TAS motor on them I've done that in the past and it's"
      },
      {
        "start": 296160,
        "stop": 296704,
        "text": " worked out just fine other people swear by putting ESP home on them instead which opens up a similar"
      },
      {
        "start": 296704,
        "stop": 297328,
        "text": " level of configuration to what you can do with the the default shelly firmware so a couple of options"
      },
      {
        "start": 297328,
        "stop": 297696,
        "text": " for you to try and I'd be curious to get your feedback on that and is there any reason not to"
      },
      {
        "start": 297696,
        "stop": 298296,
        "text": " just keep the shelly firmware it's a great question I mean it's the do you fully own it unless you have"
      },
      {
        "start": 298296,
        "stop": 299120,
        "text": " a fully open firmware on there question because you can perhaps you know honestly for us that"
      },
      {
        "start": 299120,
        "stop": 299608,
        "text": " might just be enough of a reason did you see home assistant did announce today as we're recording"
      },
      {
        "start": 299608,
        "stop": 300112,
        "text": " they do have their first works with home assistant partner announced yeah it's great isn't it I do"
      },
      {
        "start": 300112,
        "stop": 300536,
        "text": " wish they'd announced the part the the program and the partner at the same time that would have"
      },
      {
        "start": 300536,
        "stop": 300952,
        "text": " been a much better announcement if you ask me but I'm extremely pleased to see that they've got"
      },
      {
        "start": 300952,
        "stop": 301480,
        "text": " Leviton on there which is a huge brand you'll see those guys in Home Depot and lots of other"
      },
      {
        "start": 301480,
        "stop": 302000,
        "text": " big DIY stores around the earth so great job to the home assistant team there yeah that's a good"
      },
      {
        "start": 302000,
        "stop": 302512,
        "text": " get makes me kind of want to go check out some of their gear and their their z-wave devices oh here"
      },
      {
        "start": 302512,
        "stop": 303960,
        "text": " we go again visit humio.com hce that's h-u-m-i-o.com hce to ingest and view all of your logs in one"
      },
      {
        "start": 303960,
        "stop": 304664,
        "text": " place humio is a centralized log management and observability platform here we go this is great"
      },
      {
        "start": 304664,
        "stop": 305232,
        "text": " you guys the company was founded by developers in denmark in 2016 as an alternative to legacy"
      },
      {
        "start": 305232,
        "stop": 305720,
        "text": " logging solutions that were just crazy expensive I had to deal with some of those in the old days"
      },
      {
        "start": 305720,
        "stop": 306168,
        "text": " but I think the real beauty of humio is that it can take logs from any source and then make them"
      },
      {
        "start": 306168,
        "stop": 306728,
        "text": " usable you don't need to constantly massage and tweak the format it doesn't need a schema you just"
      },
      {
        "start": 306728,
        "stop": 307280,
        "text": " pump all your logs in there and they're ready when you need them and the dashboard is great the"
      },
      {
        "start": 307280,
        "stop": 307768,
        "text": " platform's pretty crazy actually humio's index-free architecture means that you can ingest over a"
      },
      {
        "start": 307768,
        "stop": 308312,
        "text": " petabyte of data per day and then search that with sub-second latency and what's just so great is"
      },
      {
        "start": 308312,
        "stop": 308768,
        "text": " humio is 80 percent cheaper than competing platforms like splunk or elastic thanks really"
      },
      {
        "start": 308768,
        "stop": 309200,
        "text": " to reduced hardware and the computational footprint I think the best way to get going"
      },
      {
        "start": 309200,
        "stop": 309816,
        "text": " with humio is probably their community edition the humio community edition is the largest no-cost"
      },
      {
        "start": 309816,
        "stop": 310344,
        "text": " data ingestion offering on the market today allowing you to ingest up to 16 gigabytes per"
      },
      {
        "start": 310344,
        "stop": 310952,
        "text": " day with seven days of retention and it's not a trial period you just got that for the long haul"
      },
      {
        "start": 310952,
        "stop": 311424,
        "text": " this is perfect for us self-hosters who just want to get your logs in somewhere and get a single"
      },
      {
        "start": 311424,
        "stop": 311856,
        "text": " view of everything going on in your entire environment this is it right here rather than"
      },
      {
        "start": 311856,
        "stop": 312208,
        "text": " having to do the separate places to look thing where you're checking all these different places"
      },
      {
        "start": 312208,
        "stop": 312624,
        "text": " and you miss something humio brings it all together and then you can correlate them in one"
      },
      {
        "start": 312624,
        "stop": 313128,
        "text": " place which makes troubleshooting easier you can look at your download speeds water consumption"
      },
      {
        "start": 313128,
        "stop": 313536,
        "text": " router information I put all of my router stats in there I've got electricity stats in there you can"
      },
      {
        "start": 313536,
        "stop": 314008,
        "text": " visualize it with humio it'll help you monitor power consumption we have a listener in australia"
      },
      {
        "start": 314008,
        "stop": 314592,
        "text": " who does just that they go off grid they got solar they're bringing all of that into home assistant"
      },
      {
        "start": 314592,
        "stop": 315056,
        "text": " and node red so they're getting real-time information on what's using power they're"
      },
      {
        "start": 315056,
        "stop": 315400,
        "text": " troubleshooting technical problems their neighbors think is the greatest thing ever"
      },
      {
        "start": 315400,
        "stop": 315832,
        "text": " you got to go check out humio and see what you can do for your environment get all of your logs"
      },
      {
        "start": 315832,
        "stop": 316360,
        "text": " into one place I mean when it's your hobby you want it easy and quick right you don't want it to"
      },
      {
        "start": 316360,
        "stop": 317152,
        "text": " be the job so go get started with humio community edition for free right now at humio.com/hce"
      },
      {
        "start": 317152,
        "stop": 317584,
        "text": " that's h-u-m-i-o.com/h-c-e"
      },
      {
        "start": 317584,
        "stop": 318240,
        "text": " all right so stewart wants a better smoke detector hey christen the badger I was wondering if you had"
      },
      {
        "start": 318240,
        "stop": 318728,
        "text": " a suggestion for a smoke detector I've been using the trusty home assistant for about three years"
      },
      {
        "start": 318728,
        "stop": 319248,
        "text": " and so far have managed to avoid the z things thanks to shelly esp home and a few other useful"
      },
      {
        "start": 319248,
        "stop": 319968,
        "text": " tools all the smoke detectors I've seen seem to depend on z wave or zigbee or whatever are there"
      },
      {
        "start": 319968,
        "stop": 320624,
        "text": " any other hybrid ones where it works well but simply provides an interface via wi-fi to notify"
      },
      {
        "start": 320624,
        "stop": 321072,
        "text": " if away wouldn't such a thing be nice and just to kind of go on top of that Jonathan wrote in and"
      },
      {
        "start": 321072,
        "stop": 321640,
        "text": " said I'm not actually so sure about these z waves smoke detectors guys time appropriate greetings"
      },
      {
        "start": 321640,
        "stop": 322160,
        "text": " um I had one for a couple of years I ended up having to disconnect it when all of a sudden it"
      },
      {
        "start": 322160,
        "stop": 322688,
        "text": " started having false alarms every other day I just couldn't find a solution and I had to tear them"
      },
      {
        "start": 322688,
        "stop": 323352,
        "text": " down yikes because I have those z wave ones that you find on amazon I have those right now so"
      },
      {
        "start": 323352,
        "stop": 323816,
        "text": " hopefully they don't start giving me false alarms all the time if there's one device that you don't"
      },
      {
        "start": 323816,
        "stop": 324392,
        "text": " want to be giving you false alarms or going wrong in any way it's a smoke detector and in a lot of"
      },
      {
        "start": 324392,
        "stop": 324736,
        "text": " ways it's worse when you're not home you know you get the alert on your phone you're like is there"
      },
      {
        "start": 324736,
        "stop": 325240,
        "text": " actually a fire I don't know so our friends over at shelly boy maybe shelly should be advertising"
      },
      {
        "start": 325240,
        "stop": 326024,
        "text": " this week they do have a wi-fi hubless smoke detector coming soon it's not yet available"
      },
      {
        "start": 326024,
        "stop": 326824,
        "text": " however their gas detector which can detect uh natch gas and propane those are available and"
      },
      {
        "start": 326824,
        "stop": 327280,
        "text": " shipping so I imagine it's probably not too long until the smoke detector is available so you could"
      },
      {
        "start": 327280,
        "stop": 327720,
        "text": " always consider shelly perhaps but we'd love any ideas from the audience if you want to boost it in"
      },
      {
        "start": 327720,
        "stop": 328488,
        "text": " or go to self-hosted.show/contact yes we would now shiram writes in every time you guys mention"
      },
      {
        "start": 328488,
        "stop": 329152,
        "text": " jellyfin on your show and that's quite often I get a huge smile on my face I'm a jellyfin user and my"
      },
      {
        "start": 329152,
        "stop": 329664,
        "text": " girlfriend loves it a lot as well I recently discovered a jellyfin feature which I'm excited"
      },
      {
        "start": 329664,
        "stop": 330256,
        "text": " about and wanted to share you can change the complete look and feel of the jellyfin ui web"
      },
      {
        "start": 330256,
        "stop": 330944,
        "text": " and app by adding custom css which then gets applied to all of your users people have made"
      },
      {
        "start": 330944,
        "stop": 331544,
        "text": " very cool looking skins with lots of interactions this can be configured in the admin dashboard"
      },
      {
        "start": 331544,
        "stop": 332032,
        "text": " general branding section of the settings there'll be a link to the documentation in the show notes"
      },
      {
        "start": 332032,
        "stop": 332576,
        "text": " maybe you guys already knew about this but I still felt like sharing keep making podcasts"
      },
      {
        "start": 332576,
        "stop": 333104,
        "text": " cheers shiram I kind of expect now the next time I come over to your house and I turn on the tv"
      },
      {
        "start": 333104,
        "stop": 333736,
        "text": " I am going to get a fully badger branded jellyfin experience at Alex's house I'm just going to brand"
      },
      {
        "start": 333736,
        "stop": 334368,
        "text": " it with those lady badges you used last week might as well get you the source material right yeah"
      },
      {
        "start": 334368,
        "stop": 334768,
        "text": " that's a neat idea I could definitely see it too like in an office space I've been in a dentist"
      },
      {
        "start": 334768,
        "stop": 335264,
        "text": " office where they had some videos that were looping on a tv it could be great for that that's just it"
      },
      {
        "start": 335264,
        "stop": 335728,
        "text": " or a school or something some kind of educational environment or even for your kids or something"
      },
      {
        "start": 335728,
        "stop": 336216,
        "text": " where you wanted to make it absolutely clear that it was a kid-friendly platform or something I"
      },
      {
        "start": 336216,
        "stop": 337008,
        "text": " don't know yeah I'm still a Plex guy I wish that jellyfin was just a little bit better it's getting"
      },
      {
        "start": 337008,
        "stop": 337544,
        "text": " so it is getting close it's getting really really close and I'm excited for the future but as of"
      },
      {
        "start": 337544,
        "stop": 338080,
        "text": " today I'm still a Plex guy my Plex server is off at the moment because it's too dang hot so I just"
      },
      {
        "start": 338080,
        "stop": 338648,
        "text": " decided to just turn things off you know we got some boosts this week and I want to take a moment"
      },
      {
        "start": 338648,
        "stop": 339152,
        "text": " and let you know that we have some links in the show notes because one of the things that we don't"
      },
      {
        "start": 339152,
        "stop": 339760,
        "text": " really mention but it is intensely awesome in my opinion is that the boosts are all self-hosted"
      },
      {
        "start": 339760,
        "stop": 340280,
        "text": " open source and it's all a peer-to-peer network it's a messaging network that's peer-to-peer and"
      },
      {
        "start": 340280,
        "stop": 341024,
        "text": " then arrives on my server that runs here locally at the studio up in my office it's a completely"
      },
      {
        "start": 341024,
        "stop": 341592,
        "text": " distributed peer-to-peer free software messaging system for you to send your feedback with a little"
      },
      {
        "start": 341592,
        "stop": 342096,
        "text": " bit of value attached into the show and it is awesome and I don't talk about it much because"
      },
      {
        "start": 342096,
        "stop": 342536,
        "text": " it's you know related to bitcoin but when you think about the technology that's being used like my"
      },
      {
        "start": 342536,
        "stop": 343112,
        "text": " setup upstairs is an umbral box which has a controller system that has a bunch of docker"
      },
      {
        "start": 343112,
        "stop": 343536,
        "text": " containers underneath that it's orchestrating that's doing all kinds of stuff to do to run all"
      },
      {
        "start": 343536,
        "stop": 344152,
        "text": " of that locally and I just love that it's become a great way for people to send messages into the"
      },
      {
        "start": 344152,
        "stop": 344800,
        "text": " show so if you want to boost in get a new podcast app at newpodcastapps.com Marcel came in with"
      },
      {
        "start": 344800,
        "stop": 345592,
        "text": " 1997 sats he says Alex I'm curious what service you use to ship things overseas do you have any"
      },
      {
        "start": 345592,
        "stop": 346072,
        "text": " advice on this I am moving overseas soon and I'm debating shipping all of my stuff or maybe just"
      },
      {
        "start": 346072,
        "stop": 346704,
        "text": " buying new what do you think? Oh man this was a whole process we when we emigrated we moved from"
      },
      {
        "start": 346704,
        "stop": 347168,
        "text": " London to Raleigh as I'm sure most people know listening to this podcast because I talk about it"
      },
      {
        "start": 347168,
        "stop": 347784,
        "text": " all the damn time but essentially on the day in question we actually moved out of London all I had"
      },
      {
        "start": 347784,
        "stop": 348296,
        "text": " with me was a couple of suitcases and a backpack and we didn't really have an awful lot with us"
      },
      {
        "start": 348296,
        "stop": 349016,
        "text": " but for the preceding two or three months before the big move we actually used a service I think"
      },
      {
        "start": 349016,
        "stop": 349576,
        "text": " it was from Seven Seas Worldwide and they had this kind of I think it was like three by six foot by"
      },
      {
        "start": 349576,
        "stop": 350168,
        "text": " eight foot container that we could rent a cube of I think it's like a 40-foot container and they"
      },
      {
        "start": 350168,
        "stop": 350752,
        "text": " give you this wooden pallet crate thing and so what we ended up doing was taping out on the floor"
      },
      {
        "start": 350752,
        "stop": 351328,
        "text": " and I will always remember this for the rest of my life because we got rid of all the furniture in"
      },
      {
        "start": 351328,
        "stop": 351920,
        "text": " our house in London and in the bedroom was this taped cube that I'd measured the height and the"
      },
      {
        "start": 351920,
        "stop": 352496,
        "text": " width and I'd put masking tape on the floor and I got boxes and right next to it because it was the"
      },
      {
        "start": 352496,
        "stop": 353128,
        "text": " whole house was being renovated and completely reflored ready to sell it I was cramped in this"
      },
      {
        "start": 353128,
        "stop": 353744,
        "text": " little corridor next to like eight ten feet worth of boxes on this little roll out camp bed mattress"
      },
      {
        "start": 353744,
        "stop": 354376,
        "text": " with a sleeping bag thing it was a fun memory but yeah Seven Seas Worldwide and what happened was"
      },
      {
        "start": 354376,
        "stop": 354824,
        "text": " they came to our house in London and there was a man with a van he picked up we picked up all the"
      },
      {
        "start": 354824,
        "stop": 355208,
        "text": " boxes and put them in the back of his van the crate was in the back of the van already loaded"
      },
      {
        "start": 355208,
        "stop": 355784,
        "text": " I guess with like a forklift truck or something they then sealed it up in front of us put screws"
      },
      {
        "start": 355784,
        "stop": 356440,
        "text": " in it and a seal across it and the next thing we saw they gave us that sort of semi-regular"
      },
      {
        "start": 356440,
        "stop": 356984,
        "text": " shipping updates like we knew when it had left Folkestone in England we knew when it had arrived"
      },
      {
        "start": 356984,
        "stop": 357576,
        "text": " onto the east coast I think it came in through New Jersey in the States and then they give you I"
      },
      {
        "start": 357576,
        "stop": 357976,
        "text": " think like a two-week grace period to go and pick it up at the other end before they start charging"
      },
      {
        "start": 357976,
        "stop": 358584,
        "text": " your storage fees and so we just waited for it to come in tell us it had cleared customs and then"
      },
      {
        "start": 358584,
        "stop": 359104,
        "text": " they said right you've got two weeks off you go so we rented a van drove up to New York or New Jersey"
      },
      {
        "start": 359104,
        "stop": 359608,
        "text": " and then you were the man with the van yeah yeah I mean some of these services do offer door-to-door"
      },
      {
        "start": 359608,
        "stop": 360056,
        "text": " service but we were being a bit frugal and so we were willing to do that last little bit of"
      },
      {
        "start": 360056,
        "stop": 360648,
        "text": " the adventure on our own you must have still had to pick and choose what went what you got rid of"
      },
      {
        "start": 360648,
        "stop": 361072,
        "text": " what you tried to resell there must have still been a lot of that it's not a very big amount of"
      },
      {
        "start": 361072,
        "stop": 361816,
        "text": " space let me tell you it was you know we I brought with me no soft furnishings nothing you know no"
      },
      {
        "start": 361816,
        "stop": 362440,
        "text": " couches no no beds no I mean it was a few there was a couple of do-thays in there maybe but honestly"
      },
      {
        "start": 362440,
        "stop": 363200,
        "text": " I think we gave most of that stuff to family and friends tables chairs everything was I was"
      },
      {
        "start": 363200,
        "stop": 363848,
        "text": " ruthless absolutely ruthless our bikes made it in there and there was a couple of you know a couple"
      },
      {
        "start": 363848,
        "stop": 364456,
        "text": " of bits of tech in you know like big floor standing speakers and and that kind of stuff but yeah for"
      },
      {
        "start": 364456,
        "stop": 364912,
        "text": " the most part we just thought we're moving to America you know the voltages are going to be"
      },
      {
        "start": 364912,
        "stop": 365576,
        "text": " different for a lot of the equipment it's a chance for us you know just turn 30 to kind of push the"
      },
      {
        "start": 365576,
        "stop": 366120,
        "text": " reset button on a lot of the hand-me-down stuff that we've had over the years so my advice such"
      },
      {
        "start": 366120,
        "stop": 367144,
        "text": " as it is would be try and it's expensive first of all I think we paid like three thousand I might be"
      },
      {
        "start": 367144,
        "stop": 367592,
        "text": " I might be completely off base with that it was in the two to three grand range I think to ship"
      },
      {
        "start": 367592,
        "stop": 368208,
        "text": " all that stuff over it took about four months but my advice would be sell as much as you can at your"
      },
      {
        "start": 368208,
        "stop": 368696,
        "text": " origin and buy as much as you can at your destination whether it's all used at the destination"
      },
      {
        "start": 368776,
        "stop": 369168,
        "text": " or what have you you know whilst the other stuff comes in from the boat you know because a lot of"
      },
      {
        "start": 369168,
        "stop": 369696,
        "text": " our kitchen stuff like pots and pans and cutlery and all that kind of stuff dishes that was all on"
      },
      {
        "start": 369696,
        "stop": 370192,
        "text": " the boat I ended up on the first night I was there going to Walmart and just filling up my trolley"
      },
      {
        "start": 370192,
        "stop": 371096,
        "text": " with like 500 worth of basic stuff like towels and plates and it was a real experience particularly"
      },
      {
        "start": 371096,
        "stop": 371520,
        "text": " as that week there was a hurricane coming to Raleigh so most of the rest of Walmart had been"
      },
      {
        "start": 371520,
        "stop": 372048,
        "text": " picked completely clean like I couldn't buy a tin of tuna but I could go and buy a spatula you know"
      },
      {
        "start": 372048,
        "stop": 372760,
        "text": " it was okay welcome to Raleigh the Walmart's been ransacked there's a storm coming yeah dude it was"
      },
      {
        "start": 372760,
        "stop": 373288,
        "text": " an experience not one I would ever wish to actually repeat because it was you know it's one of those"
      },
      {
        "start": 373288,
        "stop": 373936,
        "text": " things it was super stressful and I bet yeah but at the same time I am so glad I did it and I wish"
      },
      {
        "start": 373936,
        "stop": 374376,
        "text": " I wish Marcel the absolute best of luck with his move feel free to hit me up for any other questions"
      },
      {
        "start": 374376,
        "stop": 374808,
        "text": " you've got on Discord or Twitter or anything I'll happily share my experience in a bit more detail"
      },
      {
        "start": 374808,
        "stop": 375400,
        "text": " and there you are now visiting again which is pretty great it's been weird like we've done a"
      },
      {
        "start": 375400,
        "stop": 375984,
        "text": " whole lap of England this time up to the the north and back down to the south again and I'm used to"
      },
      {
        "start": 375984,
        "stop": 376576,
        "text": " driving long distances in the states now like four hours six hours nine hour drives do not phase me"
      },
      {
        "start": 376576,
        "stop": 377032,
        "text": " in the slightest but a couple of days ago when we're driving from Middlesbrough to Norwich it was"
      },
      {
        "start": 377032,
        "stop": 377592,
        "text": " supposed to be a four hour drive it took us six hours and one of those hours it wasn't even like"
      },
      {
        "start": 377592,
        "stop": 378200,
        "text": " we were stuck in traffic it was just sort of stop start that kind of annoying BS sort of traffic on"
      },
      {
        "start": 378200,
        "stop": 378824,
        "text": " the A1M past Peterborough but then the worst part was the service station that we went into so the"
      },
      {
        "start": 378824,
        "stop": 379496,
        "text": " best way I can describe this to you as an American is it's a bit like a rest stop but a lot worse"
      },
      {
        "start": 379496,
        "stop": 380152,
        "text": " a lot more cramped and not very nice this particular one it serves both carriageways so"
      },
      {
        "start": 380152,
        "stop": 380664,
        "text": " there's a big roundabout above the motorway both directions come into this thing and they get"
      },
      {
        "start": 380664,
        "stop": 381232,
        "text": " funneled into these into the services off the roundabout first warning sign should have been"
      },
      {
        "start": 381232,
        "stop": 381824,
        "text": " that there was a queue to get into the damn place uh-huh finally after like 15 minutes we make it"
      },
      {
        "start": 381824,
        "stop": 382544,
        "text": " inside we have a wee we go and get a coffee whatever it took us 45 minutes to get out of the car park"
      },
      {
        "start": 382544,
        "stop": 383368,
        "text": " I just I was absolutely raging I was fuming I was oh man trying my best not to be angry in front of"
      },
      {
        "start": 383368,
        "stop": 383816,
        "text": " the baby because she doesn't like that yeah but it's really hard not to get angry when you think"
      },
      {
        "start": 383816,
        "stop": 384336,
        "text": " I've got to be somewhere to be because I'm remote working in an hour yeah it'd be hard to be at my"
      },
      {
        "start": 384336,
        "stop": 384960,
        "text": " best I'm just sat here in traffic yikes so anyway I've had a lot of a lot of memories of why we left"
      },
      {
        "start": 384960,
        "stop": 385568,
        "text": " in the first place about how crowded England is and how expensive everything is and everything else"
      },
      {
        "start": 385568,
        "stop": 386232,
        "text": " it I do like it to visit but I don't necessarily think I'll see myself moving back anytime soon"
      },
      {
        "start": 386232,
        "stop": 386896,
        "text": " it's nice in short bursts but I found it quite an adjustment to be back interesting yeah I"
      },
      {
        "start": 386896,
        "stop": 387584,
        "text": " could totally understand that Ankh Bhujan with 8520 sets says he absolutely loves the self-hosted"
      },
      {
        "start": 387584,
        "stop": 388072,
        "text": " podcast and wanted to say thanks for the show he says Chris and Alex you guys make a good on-air"
      },
      {
        "start": 388072,
        "stop": 388624,
        "text": " team do you have any tips for building a blueprint or maybe instructions for your self-hosted setup"
      },
      {
        "start": 388624,
        "stop": 389328,
        "text": " and what you would do maybe in the case of one of you dying I don't expect my SO to keep my 30"
      },
      {
        "start": 389328,
        "stop": 390128,
        "text": " plus services running but there are certain pieces of data such as family media scan docs etc that"
      },
      {
        "start": 390128,
        "stop": 390624,
        "text": " would really suck to be lost how much time do you invest in this well we just talked about this a"
      },
      {
        "start": 390624,
        "stop": 391288,
        "text": " little bit I think Alex you have the right note I don't think Ankh should go diagramming things and"
      },
      {
        "start": 391288,
        "stop": 391824,
        "text": " making essentially a Visio map of the infrastructure I don't think anybody's going to be able to"
      },
      {
        "start": 391824,
        "stop": 392456,
        "text": " interpret that in his absence I think your route a simple printout just the basics is probably the"
      },
      {
        "start": 392456,
        "stop": 393208,
        "text": " better way to go I think we've talked about this before and the conclusion we came to was sadly"
      },
      {
        "start": 393208,
        "stop": 394000,
        "text": " nobody else cares about your setup quite as much as you do I know it's a hard pill to swallow but"
      },
      {
        "start": 394000,
        "stop": 394648,
        "text": " I mean if I think about deaths in my life where we've lost a family member or something"
      },
      {
        "start": 394712,
        "stop": 395400,
        "text": " you know there's been a meticulously crafted stamp collection involved for example I'm just not"
      },
      {
        "start": 395400,
        "stop": 395968,
        "text": " interested I don't know enough about it I don't really understand the why behind it and so you"
      },
      {
        "start": 395968,
        "stop": 396376,
        "text": " take it to a collector and hope you get a good price for it you know when you sell it on it's"
      },
      {
        "start": 396376,
        "stop": 397040,
        "text": " it's probably a similar situation when all of my hardware you know when I if I part if and when I"
      },
      {
        "start": 397040,
        "stop": 397680,
        "text": " pass you know all of my all of my crap and that extends to digital media as well now the one"
      },
      {
        "start": 397680,
        "stop": 398184,
        "text": " exception I would place on that is things like photographs and documents and things so I would"
      },
      {
        "start": 398184,
        "stop": 398552,
        "text": " try and make sure that there are clear instructions for how family members can access that kind of"
      },
      {
        "start": 398552,
        "stop": 399216,
        "text": " thing written down somewhere but beyond that largely speaking I think it's just uh you know"
      },
      {
        "start": 399216,
        "stop": 399672,
        "text": " your media collection for example you just got to accept that's that's your hobby that's something"
      },
      {
        "start": 399672,
        "stop": 400304,
        "text": " you enjoy but other people probably will just pay for Netflix I think there is a I mean I can't I"
      },
      {
        "start": 400304,
        "stop": 400872,
        "text": " wish I could think of a better term a market opportunity for this honestly when it comes to"
      },
      {
        "start": 400872,
        "stop": 401520,
        "text": " photos and certain documents I would like it to just be super straightforward for my spouse to"
      },
      {
        "start": 401520,
        "stop": 401920,
        "text": " get access to that stuff or you know you think about like if you've got bitcoin stored and you"
      },
      {
        "start": 401920,
        "stop": 402272,
        "text": " pass away and maybe there's thousands of dollars worth of value in there like how do you pass that"
      },
      {
        "start": 402272,
        "stop": 402960,
        "text": " on to them or photos which some people would consider to be absolutely priceless so I I'm"
      },
      {
        "start": 402960,
        "stop": 403576,
        "text": " surprised that this hasn't been properly addressed in some like you know like Synology doesn't have"
      },
      {
        "start": 403576,
        "stop": 404280,
        "text": " an add-on for this right there's not like there's not like a QNAP app to do this Home System hasn't"
      },
      {
        "start": 404280,
        "stop": 404696,
        "text": " solved it yet either but it does seem like somebody should the thing is with photos in"
      },
      {
        "start": 404696,
        "stop": 405352,
        "text": " particular though is in the old days photos were quite limited I mean maybe you know a roll of film"
      },
      {
        "start": 405352,
        "stop": 406152,
        "text": " had what 24 36 shots on it right you had a few photo albums it was a real process whereas now"
      },
      {
        "start": 406152,
        "stop": 406784,
        "text": " you know I take a dozen or more photos every single day yeah like for someone else to go"
      },
      {
        "start": 406784,
        "stop": 407208,
        "text": " through that in any kind of detail it's not going to mean an awful lot to them sure I wish there"
      },
      {
        "start": 407208,
        "stop": 407888,
        "text": " was a curated album of life moments or life events or what have you that they could access but they're"
      },
      {
        "start": 407888,
        "stop": 408408,
        "text": " not going to want to see every single time my daughter ate a strawberry or you know you know"
      },
      {
        "start": 408408,
        "stop": 409056,
        "text": " this is a feature in photo prism right like import a deceased member's photo library not to be morbid"
      },
      {
        "start": 409056,
        "stop": 409472,
        "text": " about this but just think about it like what a photo prism let you do that and then you could"
      },
      {
        "start": 409472,
        "stop": 409896,
        "text": " train it what type of photos that you're the most interested in give it like a you know go through"
      },
      {
        "start": 409896,
        "stop": 410456,
        "text": " like 50 of them flag the ones you think is best have it built a model of some kind and then it"
      },
      {
        "start": 410456,
        "stop": 411168,
        "text": " just auto generates like a best of from their photo album for you and that's honestly even that is"
      },
      {
        "start": 411168,
        "stop": 411552,
        "text": " probably more effort than most people would be willing to go through but having something like"
      },
      {
        "start": 411552,
        "stop": 412032,
        "text": " that would be nice something that just tries to pull out some of the best gets rid of the"
      },
      {
        "start": 412032,
        "stop": 412384,
        "text": " thousands of like you know pictures of your feet that you took while you're opening the app"
      },
      {
        "start": 412592,
        "stop": 413120,
        "text": " absolutely now if you want to come to London and take lots more pictures of your feet with me in"
      },
      {
        "start": 413120,
        "stop": 413712,
        "text": " front of the London Eye make sure you're going to the meetup page at meetup.com/JupiterBroadcasting"
      },
      {
        "start": 413712,
        "stop": 414120,
        "text": " for all the latest details on that meetup are you going to post pictures on twitter so we can see"
      },
      {
        "start": 414120,
        "stop": 414624,
        "text": " them I will do my best yeah but I plan on the day in question to actually be busy meeting people"
      },
      {
        "start": 414624,
        "stop": 415144,
        "text": " that's that's kind of the idea right yeah that's true okay other people take pictures for Alex"
      },
      {
        "start": 415144,
        "stop": 415688,
        "text": " would you because otherwise I'm not going to get any pictures we need like a nominated driver like"
      },
      {
        "start": 415688,
        "stop": 416128,
        "text": " a nominated photographer all right well we'll wrap it up thank you everybody who else boosted"
      },
      {
        "start": 416128,
        "stop": 416984,
        "text": " in trevdev user 5619 and of course cast p land boosted in with 3690 sats go grab boost cli or"
      },
      {
        "start": 416984,
        "stop": 417488,
        "text": " a new podcast app and we'll have links to shelly flood and the other stuff that we talked about"
      },
      {
        "start": 417488,
        "stop": 417848,
        "text": " including the links to the information about the lightning network if you want to figure out how"
      },
      {
        "start": 417848,
        "stop": 418256,
        "text": " to set up your own channels if you're going to be boosting frequently and all that stuff and then"
      },
      {
        "start": 418256,
        "stop": 418992,
        "text": " last but not least let's say big thank you to our SREs our site reliability engineers our members"
      },
      {
        "start": 418992,
        "stop": 419440,
        "text": " who support the show they get an ad free show and they get the post show something only our members"
      },
      {
        "start": 419440,
        "stop": 420144,
        "text": " get access to you can join us at self-hosted.show/sre thank you you give us the runway to say yay or nay"
      },
      {
        "start": 420144,
        "stop": 420776,
        "text": " two individual sponsors that approach us that don't fit and that really I mean that makes you"
      },
      {
        "start": 420776,
        "stop": 421320,
        "text": " our number one customer and I think that's that's a big deal Alex where can people get a hold of you"
      },
      {
        "start": 421320,
        "stop": 421712,
        "text": " for like meetup stuff between now and when the meetup actually starts what's the best avenue to"
      },
      {
        "start": 421712,
        "stop": 422288,
        "text": " get you quick I think discord's probably the best place at Alex KTZ there you go of course the"
      },
      {
        "start": 422288,
        "stop": 422936,
        "text": " podcast is on twitter at self-hosted.show and the whole dang network at jupiter signal and of course"
      },
      {
        "start": 422936,
        "stop": 423432,
        "text": " if you're on the west coast we got a whole bunch of meetups coming in September yes we do and if"
      },
      {
        "start": 423432,
        "stop": 423904,
        "text": " you're interested in coming to the JPL tour those of you that listen to LUT probably already have"
      },
      {
        "start": 423904,
        "stop": 424432,
        "text": " all the details there are a limited number of spots available I think it's in the region of 15"
      },
      {
        "start": 424432,
        "stop": 425064,
        "text": " or something like that where can folks go to enter the raffle that you're running to to get a spot on"
      },
      {
        "start": 425064,
        "stop": 425712,
        "text": " that talk Chris. Linuxunplugged.com/jpl it's just a quick next cloud form and then we're going to"
      },
      {
        "start": 425712,
        "stop": 426120,
        "text": " pull some names we only have about 15 slots so we're going to pull some names and we're going to"
      },
      {
        "start": 426120,
        "stop": 426736,
        "text": " pull a few backup names the only thing that we ask is that please make it like if you sign up"
      },
      {
        "start": 426736,
        "stop": 427224,
        "text": " please make sure you can be there you know please make it because there's only so many slots so"
      },
      {
        "start": 427224,
        "stop": 428024,
        "text": " that's at linuxunplugged.com/jpl and that will be on September the 29th I believe at about noon on"
      },
      {
        "start": 428024,
        "stop": 429136,
        "text": " the west coast yes exactly so thanks for listening everybody that was self-hosted.show/76"
      }
    ],
    "processing_time": {
      "secs": 2805,
      "nanos": 82045034
    }
  },
  "metadata": {
    "title": "Self-Hosted 76: Solid as a Rock",
    "pictures": [],
    "duration": {
      "secs": 4267,
      "nanos": 926000000
    },
    "unique_id": "http://selfhosted.show/76"
  },
  "episode": {
    "title": "Solid as a Rock | Self-Hosted 76",
    "description": "Alex runs us through his new and improved off-site backup setup, and Chris is trying out some Shelly devices.",
    "content": "<p><p>Alex runs us through his new and improved off-site backup setup, and Chris is trying out some Shelly devices.</p><p>Sponsored By:</p><ul><li><a href=\"https://linode.com/ssh\" rel=\"nofollow\">Linode</a>: <a href=\"https://linode.com/ssh\" rel=\"nofollow\">Receive a $100 60-day credit towards your new account. </a> Promo Code: linode.com/ssh</li><li><a href=\"https://humio.com/hce\" rel=\"nofollow\">Humio</a>: <a href=\"https://humio.com/hce\" rel=\"nofollow\">Take logs from any source and make them usable. Get started with Humio Community Edition for free.</a></li></ul><p><a href=\"https://jupitersignal.memberful.com/checkout?plan=53744\" rel=\"payment\">Support Self-Hosted</a></p><p>Links:</p><ul><li><a href=\"https://www.meetup.com/jupiterbroadcasting/\" title=\"Jupiter Broadcasting Meetup Page\" rel=\"nofollow\">Jupiter Broadcasting Meetup Page</a></li><li><a href=\"https://tailscale.com/kb/1097/install-opnsense/\" title=\"Tailscale mesh network using OPNsense\" rel=\"nofollow\">Tailscale mesh network using OPNsense</a> &mdash; OPNsense is an open source router and firewall platform built using FreeBSD. Tailscale can be installed on an OPNsense platform, joining it to your WireGuard-based mesh network.</li><li><a href=\"https://github.com/mimugmail/opn-repo\" title=\"OPNsense repo by mimugmail\" rel=\"nofollow\">OPNsense repo by mimugmail</a> &mdash; Here you'll find source of a couple of plugins but it's mainly just for tracking bugs or new feature requests.</p>\n\n<p></li><li><a href=\"https://samuelsson.dev/install-adguard-home-on-an-opnsense-router/\" title=\"Install AdGuard Home on an OPNsense router\" rel=\"nofollow\">Install AdGuard Home on an OPNsense router</a></li><li><a href=\"https://www.backblaze.com/blog/hard-drive-life-expectancy/\" title=\"Hard Drive Life Expectancy\" rel=\"nofollow\">Hard Drive Life Expectancy</a> &mdash; Using the Drive Stats data we’ve collected since 2013, we have selected 10 drive models that have a sufficient number of both drives and drive days to produce Kaplan-Meier life expectancy curves we can use to easily visualize their life expectancy. Using these life expectancy curves we’ll compare drive models in cohorts of 4TB, 8TB, 12TB, and 14TB to see what we can find.</li><li><a href=\"https://shelly.cloud/products/shelly-flood-smart-home-automation-sensor/\" title=\"Shelly Flood\" rel=\"nofollow\">Shelly Flood</a></li><li><a href=\"https://community.home-assistant.io/t/shelly-flood-notification-on-water-detection/329536\" title=\"Shelly Flood Notification on Water Detection\" rel=\"nofollow\">Shelly Flood Notification on Water Detection</a></li><li><a href=\"https://peyanski.com/home-assistant-and-shelly-flood-detect-leaks/\" title=\"SHELLY FLOOD Detect any leakages immediately\" rel=\"nofollow\">SHELLY FLOOD Detect any leakages immediately</a> &mdash; I will show you how to use Home Assistant and Shelly Flood Sensor to detect any leakages at your home immediately. We will use some Home Assistant automations and MQTT protocol.</li><li><a href=\"https://developer.apple.com/documentation/usernotifications/unnotificationinterruptionlevel/timesensitive\" title=\"UNNotificationInterruptionLevel.timeSensitive\" rel=\"nofollow\">UNNotificationInterruptionLevel.timeSensitive</a> &mdash; The system presents the notification immediately, lights up the screen, and can play a sound, but won’t break through system notification controls.\n</li><li><a href=\"https://shelly.cloud/shelly_plus_h-t/\" title=\"Shelly Plus H&T\" rel=\"nofollow\">Shelly Plus H&amp;T</a> &mdash; With over 1 year of battery life, Shelly Plus H&amp;T will make sure that you are always aware of the temperature and humidity levels in your home. Enhanced with a faster processor, Shelly Plus H&amp;T monitors even the slightest change in the conditions and will help you prevent dryness or mold while maintaining comfortable conditions at the premises.</li><li><a href=\"https://shelly.cloud/shelly-plus-plug-us/\" title=\"Shelly Plus Plug US\" rel=\"nofollow\">Shelly Plus Plug US</a> &mdash; Shelly Plus Plug US will monitor and control lighting, heating, or any other connected electrical appliance at home.</li><li><a href=\"https://www.home-assistant.io/blog/2022/07/27/leviton-partner/\" title=\"Leviton joins as a Works with Home Assistant partner\" rel=\"nofollow\">Leviton joins as a Works with Home Assistant partner</a> &mdash; Today we are happy to announce our first Works with Home Assistant partner: Leviton!</li><li><a href=\"https://shelly.cloud/products/shelly-smoke-smart-home-automation-sensor/\" title=\"Shelly Smoke\" rel=\"nofollow\">Shelly Smoke</a> &mdash; When there is smoke detected, Shelly Smoke activates a Voice and Light alarm, and sends a notification instantly.</li><li><a href=\"https://jellyfin.org/docs/general/clients/css-customization.html\" title=\"Jellyfin CSS Customization\" rel=\"nofollow\">Jellyfin CSS Customization</a> &mdash; Custom CSS provides customization such as changing colors, changing layouts, and item size and behavior. Below is a list of various tweaks that can be applied.</li><li><a href=\"https://cointelegraph.com/bitcoin-for-beginners/what-is-the-lightning-network-in-bitcoin-and-how-does-it-work\" title=\"What is the Lightning Network?\" rel=\"nofollow\">What is the Lightning Network?</a> &mdash; The Lightning Network was proposed in 2015 by two researchers, Thaddeus Dryja and Joseph Poon, in a paper titled “The Bitcoin Lightning Network.” Their writings were based on previous discussions of payment channels made by Satoshi Nakamoto, the anonymous creator of Bitcoin. Nakamoto described payment channels to fellow developer Mike Hearn, who published the conversations in 2013. </li><li><a href=\"https://umbrel.com/\" title=\"Umbrel \" rel=\"nofollow\">Umbrel </a> &mdash; Run a personal server in your home, self-host open source apps like Nextcloud and Bitcoin node, break away from big tech, and take full control of your data. For free.</li><li><a href=\"https://nixbitcoin.org/\" title=\"nix-bitcoin\" rel=\"nofollow\">nix-bitcoin</a> &mdash; nix-bitcoin is a collection of Nix packages and NixOS modules for easily installing full-featured Bitcoin nodes with an emphasis on security.</li><li><a href=\"https://podcastindex.org/apps?appTypes=app&elements=Value\" title=\"Grab a New Podcast app\" rel=\"nofollow\">Grab a New Podcast app</a> &mdash; Get a Podcasting 2.0 compatible app.</li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-8655",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15465028/e84a8786-c81c-49f6-8d5e-a3db9fe8778e.mp3",
      "length": "60327219",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-07-30T14:16:00+02:00"
  },
  "speedup": 1.5214977
}