{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 1800,
        "text": " I'm feeling that big 80 energy. We're just one shy as I'm prepping to hit the road. Episode 80 is going to be from the road because this is my last in-studio self-hosted. I'm doing all the things, all the pre-flight checks, you know, doing all the updates, Alex. I'm getting everything ready to go, except for Home Assistant, obviously."
      },
      {
        "start": 1800,
        "stop": 2500,
        "text": " You're a madman. You should do all that stuff when you get back because things right now are presumably working fine-ish."
      },
      {
        "start": 2500,
        "stop": 2900,
        "text": " I got a week, right? So I got enough time to fix it if it breaks."
      },
      {
        "start": 2900,
        "stop": 3100,
        "text": " No, you don't. You're prepping for a road trip."
      },
      {
        "start": 3100,
        "stop": 3800,
        "text": " But this is how I avoid doing it on the trip because, you know, when you sit there and you see the thing needs updates, it's so tempting."
      },
      {
        "start": 3800,
        "stop": 4000,
        "text": " Yeah, I suppose so."
      },
      {
        "start": 4000,
        "stop": 5400,
        "text": " So this is how I avoid it is I do it now before the trip, you know, and I go around to like if the sensor's got low battery, like I got a couple like in my bays and stuff, I'm just going to replace them now. Just going to get all that done. Some minor fixes, you know, stuff like that."
      },
      {
        "start": 5500,
        "stop": 6600,
        "text": " That's a good idea. Absolutely. So, you know, what's got me thinking is three years ago, Memorial Day weekend was when we went to see Wendell, which means self-hosted is three years old somehow."
      },
      {
        "start": 6600,
        "stop": 6900,
        "text": " Well, happy show birthday, buddy. How about that?"
      },
      {
        "start": 6900,
        "stop": 7100,
        "text": " Thank you very much, friend guy."
      },
      {
        "start": 7100,
        "stop": 7300,
        "text": " That was pretty good there, pal. I like that."
      },
      {
        "start": 7300,
        "stop": 7500,
        "text": " I'm not your buddy guy."
      },
      {
        "start": 7600,
        "stop": 8900,
        "text": " Hey there, pal. Yeah. Wow. That goes by fast, but also slow, but yet really fast. It seems like just, I don't know, a year ago we were in the Smoky Mountains on the Tale of the Dragon."
      },
      {
        "start": 8900,
        "stop": 9000,
        "text": " That's it."
      },
      {
        "start": 9000,
        "stop": 9700,
        "text": " Doesn't seem like it was that long ago, but 80 episodes almost. That feels like a long time ago."
      },
      {
        "start": 9800,
        "stop": 11000,
        "text": " There's a suggestion that for each decade now of episodes we have a rich area of musical history to tap into, so we can really lean heavily on the 80s tunes for the next 10 episodes."
      },
      {
        "start": 11000,
        "stop": 11900,
        "text": " Ah, I like this idea. What happens when we get to like, you know, episode 200 or something? What do we do? Do we go into the future? Do we..."
      },
      {
        "start": 11900,
        "stop": 12200,
        "text": " 200. Oh my goodness. That's a long way away."
      },
      {
        "start": 12300,
        "stop": 12800,
        "text": " That's a self-hosted franchise, I would imagine, you know, with the self-hosted blog and the self-hosted YouTube channel and the self-hosted..."
      },
      {
        "start": 12800,
        "stop": 13500,
        "text": " We'll have been bought out by Google and then we'll have unmerged from Google, of course, because that's how JB rolls."
      },
      {
        "start": 13500,
        "stop": 13900,
        "text": " Yeah, yeah. You gotta do both. Let's be honest."
      },
      {
        "start": 13900,
        "stop": 14100,
        "text": " It's not a one-way deal, are you?"
      },
      {
        "start": 14200,
        "stop": 15300,
        "text": " Man, you know what? You get married, you get divorced, you get married again. You know, it's really that second marriage you want to stick. It's that second wife, I always say."
      },
      {
        "start": 15300,
        "stop": 16200,
        "text": " Well, I wanted to get an update from you on that new fancy shiny ARK Intel GPU. How did that go? I know you ended up receiving it, but I imagine now you've had a chance to actually plug it into something."
      },
      {
        "start": 16300,
        "stop": 17200,
        "text": " Yeah, it's plugged into my little test box behind me. I ordered the Intel ARK GPU, as you say, the ASRock A380 is the model number."
      },
      {
        "start": 17200,
        "stop": 18100,
        "text": " And I got a notification, I think it was on Reddit or something, saying, you know, these GPUs will be in stock on Newegg tomorrow."
      },
      {
        "start": 18100,
        "stop": 18900,
        "text": " So I went and ordered one, or pre-ordered one, I think it was, and it shipped. I didn't actually expect to actually get one as soon as I did."
      },
      {
        "start": 19000,
        "stop": 19500,
        "text": " The thing is, when it arrived and I plugged it in, I thought, OK, cool, right, I'm going to plug it in."
      },
      {
        "start": 19500,
        "stop": 20200,
        "text": " And I'd read online with Gamers Nexus and a few others that the drivers weren't particularly good on Windows."
      },
      {
        "start": 20200,
        "stop": 20500,
        "text": " I'm like, well, I don't really care, I'm not going to be gaming on it."
      },
      {
        "start": 20500,
        "stop": 21500,
        "text": " My primary use case for this thing is to stick it in a server, pass it through, and then maybe get rid of my Blue Iris dedicated box."
      },
      {
        "start": 21600,
        "stop": 22400,
        "text": " Because I could use the Quick Sync functionality that's built into this GPU for hardware encoding, maybe Blue Iris, maybe Plex, whatever."
      },
      {
        "start": 22400,
        "stop": 23300,
        "text": " So I installed Proxmox on my system behind me, got the pass-through working in five minutes because it's super easy on Proxmox these days."
      },
      {
        "start": 23300,
        "stop": 23900,
        "text": " Code 43 in the Windows VM, just like we used to get with NVIDIA back in the day."
      },
      {
        "start": 24000,
        "stop": 25200,
        "text": " Something in the drivers, and I don't know what because I'm not clever enough to figure that out, but Code 43 basically is the wamp, wamp, sad trombone moment when you get the drivers installed."
      },
      {
        "start": 25200,
        "stop": 26000,
        "text": " So pass-through to a Windows VM was no go, and I thought, OK, can't be that difficult to do pass-through to a Linux VM."
      },
      {
        "start": 26000,
        "stop": 26300,
        "text": " How wrong I was, Chris, how wrong I was."
      },
      {
        "start": 26300,
        "stop": 26800,
        "text": " Yeah, is it just too freaking new? Is that the problem?"
      },
      {
        "start": 26900,
        "stop": 27000,
        "text": " I don't know anybody that has one of these."
      },
      {
        "start": 27000,
        "stop": 27600,
        "text": " Michael Larivel over at Phoronix has one too, thankfully, and he's written a couple of articles about this thing."
      },
      {
        "start": 27600,
        "stop": 29700,
        "text": " And this graphics card is so new that of course because Intel ship all their drivers as part of the Linux kernel, I need to go and download the 6.0 RC release from GitHub and actually run mainline kernel and compile it and pass a couple of kernel arguments to force it to use the GPU."
      },
      {
        "start": 29800,
        "stop": 30100,
        "text": " So how's that going, Alex? How's that been going?"
      },
      {
        "start": 30100,
        "stop": 30500,
        "text": " It's more effort than I'd imagined so far, Chris. I'm going to be honest with you."
      },
      {
        "start": 30500,
        "stop": 31900,
        "text": " And it's like one of those things where, how motivated are you right now? Because if you wait three months, it's probably going to be done for you, right? It's like, how much do you just want to do it right now versus just wait?"
      },
      {
        "start": 32000,
        "stop": 34600,
        "text": " Well, I'd love to do it right now because I actually think as part of the public service angle that this show kind of fills, that a media server oriented card like this that has a lot of really exciting new hardware encoding stuff on it with the AV1 encoders, I'd like to give the people an idea of how well this thing does or does not perform with Plex, with Jellyfin, with Handbrake and FFmpeg and all those kinds of things."
      },
      {
        "start": 34700,
        "stop": 35000,
        "text": " I suppose all of those things actually lead to FFmpeg under the hood, really."
      },
      {
        "start": 35000,
        "stop": 35900,
        "text": " But I follow what you mean. It's like, people want to know, is this worth their money? Is this worth actually investing in? Is this the next way to build my next media server?"
      },
      {
        "start": 35900,
        "stop": 37300,
        "text": " Yeah, because potentially you could, that old Xeon that you've got chugging along, you could throw this graphics card in there and potentially have a very low power, highly performant hardware encoding set up for your media server."
      },
      {
        "start": 37400,
        "stop": 38200,
        "text": " You could do that with an AMD chip as well, or even an Intel CPU that doesn't have a latest quicksync in there, you know, like an old third or fourth gen, something like that."
      },
      {
        "start": 38200,
        "stop": 39300,
        "text": " So lots of options if we can get it working. And I've been really busy playing Factorio this week. And that's not the best excuse in the world as to why I haven't done my homework, teacher."
      },
      {
        "start": 39300,
        "stop": 39600,
        "text": " But the factory must grow, you know?"
      },
      {
        "start": 39600,
        "stop": 40000,
        "text": " Are you playing this on your new shiny Steam Deck by chance?"
      },
      {
        "start": 40100,
        "stop": 40600,
        "text": " Actually, no. That also arrived this week. It's been an expensive month."
      },
      {
        "start": 40600,
        "stop": 41400,
        "text": " Hold on a second here now. Hold on, hold on. So you get a new Steam Deck, you're playing a Steam game, but you're not playing it on the Steam Deck."
      },
      {
        "start": 41500,
        "stop": 43100,
        "text": " So here's the thing about Factorio particularly, and a lot of the games I seem to like are these kind of isometric kind of city builders where you need a big canvas to see all the different bits and bobs all, you know, gesticulating on the screen."
      },
      {
        "start": 43100,
        "stop": 43800,
        "text": " And unfortunately, the 1280 by 800 little screen that the Steam Deck has ain't quite it, chief, you know?"
      },
      {
        "start": 43800,
        "stop": 44400,
        "text": " And it would struggle. It would struggle mightily if you tried to hook that thing up to a monitor that big."
      },
      {
        "start": 44400,
        "stop": 45100,
        "text": " I've experimented and when you go much higher on the resolution, you start to leave the optimal zone of the Steam hardware."
      },
      {
        "start": 45100,
        "stop": 46100,
        "text": " I've been really, really impressed with the Steam Deck for the, you know, sort of casual gaming like Forza Horizon or F1 2022 or whatever."
      },
      {
        "start": 46100,
        "stop": 46800,
        "text": " You know, playing those sorts of games, like I'm taking a flight to LA soon, it's going to be amazing on the plane to be able to do that kind of stuff."
      },
      {
        "start": 46900,
        "stop": 48000,
        "text": " But for more air quotes, serious gaming like Factorio, it's not quite the right fit, but my goodness is an impressive device overall."
      },
      {
        "start": 48000,
        "stop": 49000,
        "text": " And what a fantastic retro emulator. Absolutely the most solid retro emulator experience I've had for the Super Nintendo."
      },
      {
        "start": 49100,
        "stop": 50000,
        "text": " I got the nostalgia feels like it was the good old days playing the Super Nintendo on a CRT. It just is so tight, the way everything works."
      },
      {
        "start": 50000,
        "stop": 50700,
        "text": " And then also there's just like the Teenage Mutant Ninja Turtles game, Shredder's Revenge, also just plays incredible on the deck."
      },
      {
        "start": 50700,
        "stop": 51100,
        "text": " And you can hook up controllers to it either over Bluetooth or over USB."
      },
      {
        "start": 51100,
        "stop": 52000,
        "text": " And so like, for example, my son and I are sitting there, I set the deck down and we both have controllers and we're playing Turtles Shredder's Revenge."
      },
      {
        "start": 52000,
        "stop": 52700,
        "text": " On the deck. And it's great for that kind of stuff. And it's killer, killer for anything that works really good with a controller."
      },
      {
        "start": 52700,
        "stop": 53300,
        "text": " I saw you pop up in my notifications in Steam saying Chris Lasse is now playing Turtles. I was like, yes, good for him."
      },
      {
        "start": 53300,
        "stop": 54400,
        "text": " Yeah, it's great for that. It is. I really think that they've got something there. And the fact that it's open, that you can install stuff, you can get to the desktop, you can tinker with it."
      },
      {
        "start": 54500,
        "stop": 55000,
        "text": " I love that trend. And I hope that takes off. Others see this, I hope."
      },
      {
        "start": 55000,
        "stop": 55900,
        "text": " It's a first generation device, so it's not perfect. But again, besides the battery life at two hours, which on a flight is going to be a bit of a problem."
      },
      {
        "start": 55900,
        "stop": 57300,
        "text": " I mean, at home, it's absolutely not a problem because I just plug in a cable. For a first generation device, I think Valve must be absolutely commended for everything they've done to progress and further the Linux narrative with Proton."
      },
      {
        "start": 57400,
        "stop": 58600,
        "text": " Everything they've done over the last, I guess, seven or eight years since they announced that very first Alienware Steam box, I suppose. That's what this has been leading. It's been coming since then, really."
      },
      {
        "start": 58600,
        "stop": 60200,
        "text": " There have been a few things happened in the meantime that have kind of made this possible, I suppose. Like AMD's propensity to create gaming console quality mobile chips. Things like what go in the Switch and what have you. Although that's Nvidia, that one."
      },
      {
        "start": 60300,
        "stop": 60600,
        "text": " And their work to upstream those, right? So that stuff's just in the kernel."
      },
      {
        "start": 60600,
        "stop": 61900,
        "text": " That's just it. And I was saying to someone the other day, I got the one with the anti-glare screen and the 512 SSD that's in there. So it wasn't a cheap device. I think it was about $650 or so."
      },
      {
        "start": 62000,
        "stop": 64500,
        "text": " I would pay that again quite happily just to support Valve and what they're doing. And I think voting with your wallet really is the only way to send a true message. There's so many companies out there, like Nintendo, that want to lock people into gaming so hard that when you buy a new Nintendo Switch, for example, which I did when my wife was pregnant, I realized that actually I have to spend another couple hundred bucks on games for this thing."
      },
      {
        "start": 64600,
        "stop": 65500,
        "text": " Whereas when I buy my Steam Deck, I've got the last 10 years of my Steam library sat there ready to go. And we could have an argument about Steam DRM probably till we're blue in the face."
      },
      {
        "start": 65500,
        "stop": 67200,
        "text": " But the fact is that I didn't get locked into a proprietary ecosystem. I'm running Linux, so I can go under the hood and, as you say, run like Emu Deck, all of that emulation stuff as well on the same device. And it's just so, so cool."
      },
      {
        "start": 67300,
        "stop": 68100,
        "text": " I'd be curious to know if anybody out there in the audience has integrated the Deck into their home lab setup somehow. Is there something there?"
      },
      {
        "start": 68100,
        "stop": 70000,
        "text": " I had a real wow moment. I've got a USB-C monitor just here. And it's got Ethernet in the back of it as well as a couple of USB ports. One cable into the Steam Deck charged it, gave me Ethernet, and gave me a 4K output to display to do all the tinkering. And I'm like, \"Okay, this is convergence in action right here.\""
      },
      {
        "start": 70100,
        "stop": 71900,
        "text": " No, it works! It actually works. They've done it, Jim! Yeah, I'm really impressed as well. So let us know how you're using it, if you've picked up a Steam Deck. And if you're considering it, it's a thumbs up from both of us. I agree with Alex. I think one of the best things is you take it out of the box, you log in, and you've got games. You don't have to go spend a bunch of money."
      },
      {
        "start": 72000,
        "stop": 73300,
        "text": " I just need an 18TB hard drive to go in that thing now. Even though I've got the 512 one, F1 is 100GB, The Witcher is 100GB, Red Dead is 3 or 4 games and it's full. You know what I mean?"
      },
      {
        "start": 73400,
        "stop": 75200,
        "text": " I do know what you mean. We've been getting a lot of feedback around our topic in episode 78. It seems like it had a big impact on a lot of people. That story that Google flagged a dad and then auto-batched up his entire Google account history from the early aughts and sent it to the cops."
      },
      {
        "start": 75300,
        "stop": 76900,
        "text": " That seems to have really stuck with people. And I think it stuck with both you and I a lot too. We've talked off air that you and I are still thinking about it. It feels like something's changed, a real line has been crossed by Google. Like the risk/reward calculation about using Google services has changed. And for some of us, pretty dramatically."
      },
      {
        "start": 76900,
        "stop": 77400,
        "text": " Last episode I was talking to you in Chrome and this time I'm talking to you in Firefox."
      },
      {
        "start": 77500,
        "stop": 78300,
        "text": " Interesting. I've also switched to using Firefox. I just cold turkey quit. I exported my bookmarks and just switched over."
      },
      {
        "start": 78300,
        "stop": 79900,
        "text": " I actually looked into self-hosting the Firefox sync server. There's a couple of things that go into it as well. If you want to go into the weeds of it, you've got to self-host the authentication server as well. And it really starts to get pretty complicated pretty fast."
      },
      {
        "start": 80000,
        "stop": 81000,
        "text": " So I didn't end up doing that for now, but it is something I'm going to keep an eye on. There's a Rust-based implementation of the sync server that's fairly new. There's an older one which is no longer supported by Mozilla."
      },
      {
        "start": 81000,
        "stop": 82300,
        "text": " So there's a few options there, but I suppose if I think about it, what's the sync session syncing? My browser history and my bookmarks, really. Passwords are in Bitwarden, they're not being synced."
      },
      {
        "start": 82300,
        "stop": 82500,
        "text": " Extensions, I suppose."
      },
      {
        "start": 82600,
        "stop": 83800,
        "text": " Extensions, yeah, of course. So I don't really know what the future holds, but I still have to use Chrome through work because Red Hat are a Google Suite company. I mean, I guess I could use Firefox, but it's easier to use Chrome."
      },
      {
        "start": 83800,
        "stop": 85300,
        "text": " Even still Mozilla feels like a way less bigger threat, you know, like a galactically smaller threat than Google. I feel like for me what's shifted is I now see all of Google services as a bit of a minefield."
      },
      {
        "start": 85400,
        "stop": 86700,
        "text": " And you could see how they can really compound a screw you really good. And now, like, am I going to one day find out that they are also parsing communications to try to detect things that could be harmful for children in our communications?"
      },
      {
        "start": 86700,
        "stop": 87000,
        "text": " Well, you know they are. You know that if they're not, the NSA are already."
      },
      {
        "start": 87000,
        "stop": 87900,
        "text": " So it just kind of compounds, the risk kind of compounds the more you use Google. So when I get back from the road trip, I'm going to cancel Google Fi. I had kind of gotten it over the years."
      },
      {
        "start": 88000,
        "stop": 88400,
        "text": " I have a T-Mobile SIM coming tomorrow. I've already cancelled my Google Fi."
      },
      {
        "start": 88400,
        "stop": 89300,
        "text": " Yeah, I almost did it. And I was like, this might be really stupid to go on a road, to be right about to go on a road trip to cancel cell service. But when I get back, I'm done."
      },
      {
        "start": 89300,
        "stop": 89900,
        "text": " You know why I did it before the trip? It's because I'm flying Delta and they have free Wi-Fi with T-Mobile."
      },
      {
        "start": 89900,
        "stop": 90500,
        "text": " Well, okay, there you go. That's the incentive you needed. I think that's great."
      },
      {
        "start": 90600,
        "stop": 91500,
        "text": " Thinking about it, you know I'm a big proponent of tail scale. I realised I actually used the Google authentication for tail scale, which is a problem, so I'm going to have to fix that."
      },
      {
        "start": 91500,
        "stop": 92300,
        "text": " Probably going to move to head scale as a result of all this. Finally, finally do the self-hosted thing, you know, eat my own dog food."
      },
      {
        "start": 92300,
        "stop": 93500,
        "text": " But there's so much stuff on the web that tracks you. When you actually start reading and looking into the privacy stuff, this might sound obvious to some people, but it hadn't occurred to me that every time you see that little login with Facebook button on a web page,"
      },
      {
        "start": 93500,
        "stop": 93900,
        "text": " whether you use it or not, they're using that to track where you are."
      },
      {
        "start": 93900,
        "stop": 94100,
        "text": " Yeah, they're getting info, aren't they?"
      },
      {
        "start": 94100,
        "stop": 94300,
        "text": " It's gross."
      },
      {
        "start": 94300,
        "stop": 94900,
        "text": " It is gross. And a lot of people use it because it takes care of the username and authentication."
      },
      {
        "start": 94900,
        "stop": 95500,
        "text": " You know, it's a tricky one. It's a really tricky one. I don't really know what the solution is there."
      },
      {
        "start": 95500,
        "stop": 96100,
        "text": " I really got to figure out where I draw the line with Google because I've also got the setup for Google apps."
      },
      {
        "start": 96200,
        "stop": 97100,
        "text": " Prozac boosted in with a row of ducks along this line of thinking. He said, \"I don't know how I feel after listening to Episode 78. I left Google a long time ago and I switched to DuckDuckGo."
      },
      {
        "start": 97100,
        "stop": 97700,
        "text": " My mail is in a paid service in Norway, yada, yada, yada, but I guess I'm still magnifying my tinfoil hat."
      },
      {
        "start": 97700,
        "stop": 98600,
        "text": " Now that the new normal is for our tech overseers to be the judge and the jury, that makes me a complete target because I'm not in the system, a system that says maybe I'm guilty by default."
      },
      {
        "start": 98700,
        "stop": 99200,
        "text": " It's a no-win game unless a large number of people get away from those services."
      },
      {
        "start": 99200,
        "stop": 99800,
        "text": " So in other words, you almost put a target on your back by not participating in these systems, is what Prozac is saying."
      },
      {
        "start": 99800,
        "stop": 100600,
        "text": " Do you though? I mean, there's already, there's so much noise. I guess he has a point actually."
      },
      {
        "start": 100600,
        "stop": 101000,
        "text": " There's so much signal to noise that they've got to process with these things."
      },
      {
        "start": 101100,
        "stop": 101800,
        "text": " So that's where machine learning comes in, is to help do that. And a machine can't do much learning if you're not part of the system, I suppose."
      },
      {
        "start": 101800,
        "stop": 103100,
        "text": " Yeah, that's true. You're protected in the like automatically flagging you because the machine learning thingy just misunderstood what you took a picture of or what you had a voicemail about or something. You're like avoiding all of that trap."
      },
      {
        "start": 103200,
        "stop": 104400,
        "text": " There's a dystopian future playing out here though already, isn't there? Where if you're not part of the Amazon or the Google ecosystem, you're not allowed to buy Prime."
      },
      {
        "start": 104400,
        "stop": 105100,
        "text": " You're not allowed to buy stuff off Amazon. You're not allowed to, I don't know, whatever the problem would be."
      },
      {
        "start": 105200,
        "stop": 106300,
        "text": " And Josh in the chat says, don't put all your eggs in one basket. And to that, I would just counter that there's only three or four baskets to really choose from with big tech in air quotes."
      },
      {
        "start": 106300,
        "stop": 106800,
        "text": " There's really not as much choice as you might imagine when it comes to the internet."
      },
      {
        "start": 106800,
        "stop": 107900,
        "text": " Has anyone out there successfully cut off Amazon completely? I mean, how do you do that? Especially in the day and age where a lot of people can't get stuff, but Amazon can still get it."
      },
      {
        "start": 108000,
        "stop": 108500,
        "text": " Can you imagine if somehow your social credit score prohibited you from accessing AWS based services?"
      },
      {
        "start": 108500,
        "stop": 108700,
        "text": " It already does. They won't let me on."
      },
      {
        "start": 108700,
        "stop": 109700,
        "text": " No, I don't mean as a customer. I mean as an end user. You are not allowed to load any traffic that traverses Amazon's network somewhere."
      },
      {
        "start": 109700,
        "stop": 109800,
        "text": " That'd be pretty awful."
      },
      {
        "start": 109800,
        "stop": 110000,
        "text": " That'd be most of the internet, wouldn't it?"
      },
      {
        "start": 110100,
        "stop": 111100,
        "text": " What about this concept of just don't put all your eggs in one basket? Like, so maybe Mozilla's handling your syncing and maybe Fastmail's handling your email."
      },
      {
        "start": 111100,
        "stop": 111700,
        "text": " Trevdev boosted insane. He switched to Fastmail. I know, I think you mentioned you're looking at Fastmail."
      },
      {
        "start": 111700,
        "stop": 111900,
        "text": " Yeah, yeah. I've been with Fastmail for a while now."
      },
      {
        "start": 111900,
        "stop": 112800,
        "text": " I use ProtonMail for some things. You're still using somebody else's service, but you're kind of spreading the risk out. Is that better?"
      },
      {
        "start": 112900,
        "stop": 114600,
        "text": " Well, I mean I found it interesting. You think talking about email specifically, there's a link in the show notes. There was a blog post doing the rounds this week about a guy who's been self-hosting email for 23 years and has finally thrown in the towel and basically gave all the reasons that you might imagine as to why he stopped."
      },
      {
        "start": 114700,
        "stop": 116000,
        "text": " Email is not distributed anymore. He says you cannot create another first class node in this network. Email is now an oligarchy, a service that is gate kept by a few big companies which does not follow the principles of net neutrality."
      },
      {
        "start": 116000,
        "stop": 116800,
        "text": " First they cut off the residential IPs, then they cut off the VPSs. Now they've basically cut off all self-hosters."
      },
      {
        "start": 116900,
        "stop": 118300,
        "text": " The emails are just simply not getting delivered anymore. After running a mail service since 1999, the day he got a broadband service, and ever since then he's been running a mail server and he says now it's just completely he's throwing in the towel."
      },
      {
        "start": 118300,
        "stop": 119500,
        "text": " He says hell-banning everybody except other big email providers is a lazy way to fight spam and it's dishonest. He uses spam as a scapegoat to nerf deliverability and stifle competition."
      },
      {
        "start": 119600,
        "stop": 120600,
        "text": " Absolutely. It's all about stifling competition in my opinion and the issue isn't necessarily that your IP gets blacklisted and you get sent straight to spam."
      },
      {
        "start": 120600,
        "stop": 121800,
        "text": " The issue is that you get part of a block of IPs and your mail just simply gets rejected before it even gets that far. And what do you do then? You're completely SOL."
      },
      {
        "start": 121900,
        "stop": 122700,
        "text": " The only best option if you find you can't self-host your mail is you need to at least own your domain. Don't have an @gmail domain. Don't have an iCloud."
      },
      {
        "start": 122700,
        "stop": 123900,
        "text": " Apple would love to tell you that they have the most private system. Actually I probably believe them that they do actually of all of them. Of the big three or four I suppose."
      },
      {
        "start": 123900,
        "stop": 124200,
        "text": " With that, what's it called, iCloud Plus or something?"
      },
      {
        "start": 124200,
        "stop": 124300,
        "text": " For now."
      },
      {
        "start": 124400,
        "stop": 124900,
        "text": " As they begin to monetize services and things like that, they're going to have to drive revenue from advertising."
      },
      {
        "start": 124900,
        "stop": 125500,
        "text": " And they're launching more and more resources and staff around their advertising department. So we shall see."
      },
      {
        "start": 125500,
        "stop": 126400,
        "text": " Carlos, the guy that had this email, shutting down his email server, he says it's a huge invisible problem that really isn't getting fixed."
      },
      {
        "start": 126400,
        "stop": 127100,
        "text": " Email is basically going to the big tech companies. I think he's right. I think the future for that kind of stuff is matrix."
      },
      {
        "start": 127200,
        "stop": 127900,
        "text": " I mean not that it's going to replace email, but for something that you can self-host and federate and is truly decentralized and open."
      },
      {
        "start": 127900,
        "stop": 128600,
        "text": " I just wonder where email will be in ten years time. Answers on the postcard. selfhosted.show/contact."
      },
      {
        "start": 128600,
        "stop": 128800,
        "text": " Yeah, let us know."
      },
      {
        "start": 128800,
        "stop": 129400,
        "text": " Okay, then photos. I just have a quick update. You mentioned Image last week."
      },
      {
        "start": 129400,
        "stop": 129700,
        "text": " Image. I-M-M-I-C-H."
      },
      {
        "start": 129800,
        "stop": 130500,
        "text": " A little bit of knowledge from Fuzzy Missborn. He says, I think he might be a lawyer, he says the Fourth Amendment only protects against government searches."
      },
      {
        "start": 130500,
        "stop": 131000,
        "text": " So a EULA can and does allow for Google to search all of your photos."
      },
      {
        "start": 131000,
        "stop": 131500,
        "text": " I think it came up, does the Fourth Amendment protect you here?"
      },
      {
        "start": 131500,
        "stop": 131700,
        "text": " Fuzzy Missborn says it does not."
      },
      {
        "start": 131700,
        "stop": 132100,
        "text": " I think I tried to sound intelligent and say they needed a warrant or something."
      },
      {
        "start": 132100,
        "stop": 132300,
        "text": " I wish they did. I wish they did."
      },
      {
        "start": 132400,
        "stop": 133600,
        "text": " So I gave Image a try, which is a self-hosted photo and video backup solution that's aiming to have a client on Android and iOS that auto-backs you up just like Google Photos does."
      },
      {
        "start": 133600,
        "stop": 133900,
        "text": " Only you self-host it all yourself."
      },
      {
        "start": 133900,
        "stop": 134700,
        "text": " And the basic UI of the web app is very much like the early days of Google Photos."
      },
      {
        "start": 134700,
        "stop": 134900,
        "text": " Yeah, it looks pretty promising, huh?"
      },
      {
        "start": 135000,
        "stop": 136200,
        "text": " I'm very excited about this. However, having used it for a bit, I'm also a little sad because I realized after using it, we're like five years out."
      },
      {
        "start": 136200,
        "stop": 137100,
        "text": " I mean, you're going to get really basic functionality where you can look at your photos and probably put them in albums and you can probably upload them."
      },
      {
        "start": 137100,
        "stop": 137600,
        "text": " Although it sounds like iOS is giving the developer a hard time. He's an iOS user himself."
      },
      {
        "start": 137700,
        "stop": 138400,
        "text": " But they just did a big update this week and they got Android auto backup working, they got deduplication working, they got dark mode on mobile."
      },
      {
        "start": 138400,
        "stop": 138700,
        "text": " But iOS users, he's having a hard time with the background killing."
      },
      {
        "start": 138700,
        "stop": 138900,
        "text": " Yeah, it's those background APIs, huh?"
      },
      {
        "start": 138900,
        "stop": 139100,
        "text": " There's a lot of finesse there to get that working."
      },
      {
        "start": 139100,
        "stop": 140200,
        "text": " Yeah, and I think that's where Apple probably have an anti-competitive advantage in that they have system access, system level access to APIs that normal, mortal developers just simply don't have."
      },
      {
        "start": 140300,
        "stop": 141400,
        "text": " It might just be for iOS users, the solution is to just let iCloud have the photos for a bit, pull them off of iCloud with the backup scripts we've talked about on the show before and then upload them to something like this."
      },
      {
        "start": 141400,
        "stop": 142200,
        "text": " I do think image is probably the emerging leader in the pack of all of these different photos apps."
      },
      {
        "start": 142200,
        "stop": 142700,
        "text": " I mean, I wrote for Ars Technica, I guess, 18 months ago, a couple of years. I can't remember when exactly."
      },
      {
        "start": 142800,
        "stop": 143600,
        "text": " I did a round up of all the runners and riders at the time, you know, Photo Prism and there was about 10 or 12 in that list at the time."
      },
      {
        "start": 143600,
        "stop": 145100,
        "text": " And I think image has come along out of nowhere since that article really. And really, if he delivers, which so far the developer has given us absolutely no reason to believe that he won't deliver on his promise."
      },
      {
        "start": 145100,
        "stop": 145600,
        "text": " If he delivers on it, then I think this is probably going to be the app to beat."
      },
      {
        "start": 145700,
        "stop": 146700,
        "text": " Agreed. You know, we get Photo Prism recommended a lot and it is part of a solution, definitely. But this is a complete, this is like give it to your family, give them this app."
      },
      {
        "start": 146700,
        "stop": 147500,
        "text": " It just auto uploads in the background, that kind of stuff. That's really exciting. And it's pretty easy to get up and running in Docker. It just takes a few seconds."
      },
      {
        "start": 147500,
        "stop": 148100,
        "text": " So here's the thing. I mean, it's been architected as microservices. So, you know, it's what four or five containers all linked together."
      },
      {
        "start": 148200,
        "stop": 149600,
        "text": " But for me, I think we're at a point where these services need some kind of financial incentive to be able to have the resources to beat Google or Apple or whoever."
      },
      {
        "start": 149600,
        "stop": 150600,
        "text": " I mean, Google's budget for Google Photos must be astronomical for the development, for all the machine learning bills that it has, etc, etc."
      },
      {
        "start": 150700,
        "stop": 151700,
        "text": " Now, obviously, we're outsourcing a bunch of that cost to our servers, to our hard drives, to our CPUs, whatever. So the argument sort of kind of goes away."
      },
      {
        "start": 151700,
        "stop": 153000,
        "text": " But with that comes a lot of vertical integrations that Google can do with, you know, matching lots and lots of different dogs and making their algorithms better and more accurate and that kind of thing."
      },
      {
        "start": 153000,
        "stop": 153200,
        "text": " I'm sure it's very valuable for them in that regard."
      },
      {
        "start": 153300,
        "stop": 154200,
        "text": " So I wonder, you know, if you're listening to this show, if you were in the market to pay for this app, let's just, for example, say Image."
      },
      {
        "start": 154200,
        "stop": 155500,
        "text": " If you were to pay a subscription to support the development of this application, not to unlock any functionality like what Plex do, for example, just simply, I guess, sort of like the Home Assistant model to say,"
      },
      {
        "start": 155600,
        "stop": 156600,
        "text": " \"Here's five bucks a month to support this developer's ability to go to the grocery store. Is five bucks, would you be willing to pay that for a completely self-hosted application?\""
      },
      {
        "start": 156600,
        "stop": 157800,
        "text": " Where does the line draw? Because I know personally subscription fatigue is real, but also I'm fatigued of giving up my privacy to these big companies."
      },
      {
        "start": 157900,
        "stop": 158900,
        "text": " I remember one of the things you said to me in the car on the way to Wendell was, \"We can't have self-hosted just be cloud bad, local good, because the cloud isn't all bad.\""
      },
      {
        "start": 158900,
        "stop": 160000,
        "text": " And I don't wish to sit here and say that cloud is all bad at all. You know, just bash on Dropbox, bash on Google, bash on all these big companies, because they do offer a lot of cool stuff."
      },
      {
        "start": 160100,
        "stop": 161000,
        "text": " At the same time, you've got to draw a line somewhere, and I feel like that line is inching, inching. It's moving like the border in Georgia."
      },
      {
        "start": 161000,
        "stop": 162400,
        "text": " I think the part that's really shifted is the automatic just batching up and transferring of your Google account to the authorities, where they can review your chat history with your wife and your friends, to see all the stupid stuff you said, you know, for the last 15 years."
      },
      {
        "start": 162500,
        "stop": 163500,
        "text": " I think that's where the line got crossed, and that's the new calculus, and so that's why I'm willing to look at things like Image. Yeah, I'm looking, you know, I'm looking, does he take GitHub sponsorships?"
      },
      {
        "start": 163500,
        "stop": 164700,
        "text": " I'm looking at this. I don't like the buy me a coffee stuff. His work is worth more than a cup of coffee. I also don't like calling it a tip. It's not a tip."
      },
      {
        "start": 164800,
        "stop": 165600,
        "text": " He's working really hard. In fact, he even says in this Reddit thread that he posted, he likes, he'd like to be able to do this full time, because he thinks it's a full time job, and I agree."
      },
      {
        "start": 165600,
        "stop": 167700,
        "text": " After using it, the reason I got sad is I realized this is a massive undertaking, like huge. I didn't really connect with it until I actually used it in its current state, which is super early, and he says right here, you know, he'd love some more GitHub sponsorships, because he would love to eventually work on this project full time."
      },
      {
        "start": 167700,
        "stop": 169200,
        "text": " I think he's gonna need to, and I don't know if there is the will out there to sponsor something like this. Maybe that's changed. I don't love that it's gonna be through a GitHub sponsorship or the buy me a coffee thing. I wish it was a better system than that."
      },
      {
        "start": 169200,
        "stop": 169700,
        "text": " If only there was a free and open decentralized way to send people money."
      },
      {
        "start": 169700,
        "stop": 170300,
        "text": " That wasn't under the control of capricious tech companies that have lots of things to protect."
      },
      {
        "start": 170300,
        "stop": 170500,
        "text": " What could that be, Chris, huh?"
      },
      {
        "start": 170600,
        "stop": 170800,
        "text": " I don't know, Alex. I don't know."
      },
      {
        "start": 171000,
        "stop": 171900,
        "text": " Leno.com/SSH. Go there to get $100 and 60 day credit on your new account. It's a great way to support the show while checking out something really awesome."
      },
      {
        "start": 171900,
        "stop": 173000,
        "text": " It is the Geeks cloud with 11 data centers around the world. They've been hard at work for nearly 19 years, creating the best experience to run your applications on Linux in the cloud under your control."
      },
      {
        "start": 173100,
        "stop": 174000,
        "text": " This is my go to cloud platform. It is a model in which they have actual support. I love this about Linode."
      },
      {
        "start": 174000,
        "stop": 174600,
        "text": " But on top of that, they've continued to invest in their hardware aggressively over that 19 years."
      },
      {
        "start": 174600,
        "stop": 175400,
        "text": " In this last few months, MVME storage has been rolled out to the rigs. They're constantly updating the CPU's as new models become available."
      },
      {
        "start": 175500,
        "stop": 176500,
        "text": " They are their own ISP, so they always have the optimal routes. And then they have a bunch of really great services like S3 compatible object storage, which can really change your offsite game."
      },
      {
        "start": 176500,
        "stop": 177200,
        "text": " Easy to use API with lots of libraries that you can take advantage of. Cloud firewalls, physical boxes if that's your thing."
      },
      {
        "start": 177200,
        "stop": 178300,
        "text": " I mean, there's really like a thousand reasons I could list. I think that's why they did the hundred bucks, because then you can just go there and try it yourself and see what I'm talking about."
      },
      {
        "start": 178400,
        "stop": 179000,
        "text": " I mean, it's incredible. I wouldn't host JB's new website anywhere else. And the other thing I love about Linode is they get the big picture."
      },
      {
        "start": 179000,
        "stop": 179600,
        "text": " They invest in the community. You know, they're making a road trip possible. They're making these meetups possible. They're supplying the swag."
      },
      {
        "start": 179600,
        "stop": 180500,
        "text": " They're not going to make a million bucks off us taking a road trip to go meet the audience. They're investing in the community because they know long term that pays dividends."
      },
      {
        "start": 180500,
        "stop": 181100,
        "text": " After you've used Linode for a minute, you'll understand. If you're like me, you'll also start to use some of the more advanced features as well."
      },
      {
        "start": 181200,
        "stop": 182000,
        "text": " And then you're really going to love it. So for the best customer support, super fast rigs, super fast networking and a Linux culture that runs deep."
      },
      {
        "start": 182000,
        "stop": 182600,
        "text": " Those are just some of the reasons I choose to use Linode. I think you'll find your own. Go get that hundred bucks and try it."
      },
      {
        "start": 182600,
        "stop": 183700,
        "text": " Put it over the top. Kick the tires. Linode.com/SSH. Support the show. Get a hundred dollars to try out something awesome. That's Linode.com/SSH."
      },
      {
        "start": 184000,
        "stop": 184600,
        "text": " So it was our third birthday this week. Home Assistant also celebrates a birthday. Nine years old."
      },
      {
        "start": 184600,
        "stop": 186000,
        "text": " That's impressive. Yep. September 17th, 2013. Polis made his first commit for Home Assistant. And then today they announced, as we record, version 22.9, which is their birthday release."
      },
      {
        "start": 186100,
        "stop": 187000,
        "text": " They've revamped the automation screen. I don't know if you've had a chance to look at it, but they now have collapsible cards for triggers, conditions and actions."
      },
      {
        "start": 187000,
        "stop": 187700,
        "text": " And they also have an overflow menu where they've moved some of the less common used things and some of the more frequently commonly used things."
      },
      {
        "start": 187700,
        "stop": 188900,
        "text": " But it is a nicer UI overall. And they've added a new weekly schedule calendar element. So you can actually you get a seven day calendar and you can draw on there like it's your meeting calendar."
      },
      {
        "start": 189000,
        "stop": 189700,
        "text": " So that's kind of nice. It's actually it looks like a pretty clever way to to solve that particular problem. Big revamp in the UI, Alex."
      },
      {
        "start": 189700,
        "stop": 190800,
        "text": " I updated today. I don't really notice a difference, but I haven't built an automation since. You updated to a .0 release. You are raw dog. You are braver than I."
      },
      {
        "start": 190800,
        "stop": 191900,
        "text": " I do it for the show. I do it so you don't have to. Right. Yes, that's right. I do remember saying to you before the show that when stuff breaks, I think we call that content in the business, right?"
      },
      {
        "start": 191900,
        "stop": 192900,
        "text": " That's probably true. There was a lot of talk. I watched the release announcement, which is like long, and there was a lot of talk in there about improvements to Bluetooth."
      },
      {
        "start": 192900,
        "stop": 193500,
        "text": " Bluetooth speed. If you're using they stress you really need to be using Home Assistant OS to take advantage of all these improvements."
      },
      {
        "start": 193500,
        "stop": 194100,
        "text": " But a lot of speed improvements for Bluetooth communication. ESP to 32 devices can be used as Bluetooth proxies."
      },
      {
        "start": 194200,
        "stop": 195100,
        "text": " Home Assistant is actually now selling some Bluetooth proxies, easy for me to say, in their online store. Big improvements for Bluetooth devices."
      },
      {
        "start": 195100,
        "stop": 195600,
        "text": " And they think it's going to open up to a lot more devices. Wow. Nice. Yeah, it is nice. That's a good area to improve."
      },
      {
        "start": 195600,
        "stop": 196000,
        "text": " If only you had received your Home Assistant yellow by now, though."
      },
      {
        "start": 196000,
        "stop": 196900,
        "text": " It was supposed to be here yesterday, but I got an updated email saying it should promptly arrive after I've been gone for about a week on the road."
      },
      {
        "start": 197000,
        "stop": 197600,
        "text": " I'll have to wait until I get back, I guess. One of these days we'll do a show and we'll be able to actually review it, whereas all the YouTubers had theirs like a year ago."
      },
      {
        "start": 197600,
        "stop": 198300,
        "text": " Yeah, maybe ours will be like a better, though. It'll be like the final edition. Yeah, maybe. The shipping one, maybe."
      },
      {
        "start": 198300,
        "stop": 198800,
        "text": " What do they call it? Like a production sample, not an engineering sample. Right, right."
      },
      {
        "start": 198800,
        "stop": 199600,
        "text": " Zigbee users are going to be happy to know that there's now a Zigbee backup and restore option in Home Assistant. So that's actually really nice."
      },
      {
        "start": 199700,
        "stop": 200100,
        "text": " Hey, that's you. You're a Zigbee user these days. I am now. I'm a big Zigbee guy now, don't you know?"
      },
      {
        "start": 200100,
        "stop": 201200,
        "text": " And it turns out I didn't realize this, but I would have been SOL if I had done like a restore of Home Assistant on like maybe on a new device or something."
      },
      {
        "start": 201200,
        "stop": 201600,
        "text": " I guess none of my Zigbee stuff would have worked. I had not even realized that."
      },
      {
        "start": 201600,
        "stop": 202000,
        "text": " Nor had I. So you literally just said that. I know. Thank you, Chris."
      },
      {
        "start": 202100,
        "stop": 203000,
        "text": " Good to know, right? They now have fixed that and you can back up and restore your Zigbee stuff, but also they now have a really slick migration assistant."
      },
      {
        "start": 203000,
        "stop": 203800,
        "text": " If you just maybe like want to move to a new radio, you want to upgrade your Zigbee radio for some reason, they'll handle all that migration stuff because I guess some of that's written to the controller."
      },
      {
        "start": 203800,
        "stop": 204300,
        "text": " I think that's really neat to see there because Zigbee is going to be the future. We'll see."
      },
      {
        "start": 204300,
        "stop": 204600,
        "text": " They did actually do some updates for their C-Wave support as well."
      },
      {
        "start": 204700,
        "stop": 206000,
        "text": " I did see the Verge pick up this week that they were controlling a HomeKit compatible, I think the headline was, \"This is why it matters that I can control HomeKit from somewhere else.\""
      },
      {
        "start": 206000,
        "stop": 206300,
        "text": " And I was like, yeah, okay. Good headline, chaps. Well done."
      },
      {
        "start": 206300,
        "stop": 206700,
        "text": " I might have grabbed a Matter related story for the member post show."
      },
      {
        "start": 206700,
        "stop": 206900,
        "text": " Oh yeah? Okay. I can't wait to get there."
      },
      {
        "start": 206900,
        "stop": 207100,
        "text": " I may have. I may have."
      },
      {
        "start": 207200,
        "stop": 207800,
        "text": " So there's just been a few UI updates. You can see processor and memory usage in the Home Assistant UI, which is nice for people using it on a hardware device."
      },
      {
        "start": 207800,
        "stop": 208500,
        "text": " And then a couple of integrations. There's so much more in the release announcements. These are just my highlights, but a couple of integrations that caught my eye."
      },
      {
        "start": 208500,
        "stop": 209800,
        "text": " The Android IP Webcam app is now available as an integration into Home Assistant so you can easily set up tablets that you're using as a dashboard or your Android phones as cameras that feed into Home Assistant now."
      },
      {
        "start": 209900,
        "stop": 210500,
        "text": " Super easy to do. That's slick. And then also there's an integration now for the fully kiosked browser."
      },
      {
        "start": 210500,
        "stop": 212200,
        "text": " So if you're using a tablet with a fully kiosked browser to display Home Assistant, there's now an integration that allows you to control certain things, get information about the tablet, like its battery level, what current page is displaying, how much RAM is available."
      },
      {
        "start": 212300,
        "stop": 214000,
        "text": " You can also do things like you can remotely refresh the kiosk page, bring it to the front, lock the device. You can turn motion detection on and off the screensaver on and off from Home Assistant now for your Android tablets that you might have around your house or should have around your house acting as a dashboard for Home Assistant."
      },
      {
        "start": 214000,
        "stop": 214200,
        "text": " I just think that's a neat integration."
      },
      {
        "start": 214300,
        "stop": 215400,
        "text": " I had one of those aha moments with Home Assistant this week when I bought an Elgato key light to make my face look more beautiful from my camera."
      },
      {
        "start": 215400,
        "stop": 216200,
        "text": " For those of you listening on audio, it makes zero difference, of course, but for the live stream, I mean, you can see how many gray hairs I have."
      },
      {
        "start": 216200,
        "stop": 216600,
        "text": " That's what brings the people to JupiterTube, Alex. That's what it is."
      },
      {
        "start": 216700,
        "stop": 217900,
        "text": " Exactly. Yeah. But when I plugged in this Elgato light, it connected to my network via the app on my phone and then within a minute or two, Home Assistant picked it up and was like, there's an Elgato integration. Do you want to enable it?"
      },
      {
        "start": 217900,
        "stop": 218500,
        "text": " And I was like, click. Yes, I do. Boom, boom, done. Moments like that remind me that actually this stuff's super cool."
      },
      {
        "start": 218600,
        "stop": 219700,
        "text": " I love that. I had the same experience, obviously, with the Shelly devices. They just get on the Wi-Fi network and boom, Home Assistant just sees it. You click a button."
      },
      {
        "start": 219700,
        "stop": 220400,
        "text": " I just set up another Shelly smart plug on my test bench upstairs. I have a super secret rig that I'm testing right now."
      },
      {
        "start": 220400,
        "stop": 221100,
        "text": " And so one of the things that I do in my test is I want to know what the power usage is in various scenarios."
      },
      {
        "start": 221200,
        "stop": 221800,
        "text": " And what I used to do, Alex, is I used to get a kilowatt. I don't know if you've seen these kilowatt devices."
      },
      {
        "start": 221800,
        "stop": 222300,
        "text": " And then I would run a benchmark and I would walk over to the kilowatt and I would write down what the power usage was."
      },
      {
        "start": 222300,
        "stop": 222800,
        "text": " And then when the benchmark end, I'd walk over to the kilowatt and I'd write down what the power usage was."
      },
      {
        "start": 222800,
        "stop": 223700,
        "text": " And now with the Shelly, I just pull it into Home Assistant and then I can just look back over the entire review period and see what the power usage was."
      },
      {
        "start": 223800,
        "stop": 224400,
        "text": " And, you know, that's so freaking valuable for me. So there's a lot of interesting ways you can use Home Assistant."
      },
      {
        "start": 224400,
        "stop": 224800,
        "text": " Are you exporting any of this stuff to Influx so you could do historical data?"
      },
      {
        "start": 224800,
        "stop": 224900,
        "text": " That's a good idea."
      },
      {
        "start": 224900,
        "stop": 225700,
        "text": " There's an exporter built into Home Assistant that you can enable, which will ship out that data to Influx DB, which is a time series database."
      },
      {
        "start": 225700,
        "stop": 226700,
        "text": " And then you could put, if you wanted to, a Grafana front end in front of that and make pretty graphs or query it based on whatever query logic you want to use."
      },
      {
        "start": 226700,
        "stop": 227200,
        "text": " So I found that very useful for stuff like hard drive data, where I want to know what the temperatures were from season to season."
      },
      {
        "start": 227200,
        "stop": 228400,
        "text": " So I can actually look and see on average how warm or cool my basement is, just simply based on the fact that my hard drives are 10 degrees warmer on average in the summer than they are in the winter."
      },
      {
        "start": 228400,
        "stop": 228900,
        "text": " That's a great idea. I'd love to know that data. I don't care so much for the bench stuff, but boy, for tubes."
      },
      {
        "start": 229000,
        "stop": 229900,
        "text": " With Influx, you've got to be careful though, because it's writing constantly. Obviously not an SD card, otherwise that will burn out pretty dang quickly."
      },
      {
        "start": 229900,
        "stop": 230400,
        "text": " So I don't know, just some kind of SSD or something is probably the way to go for that."
      },
      {
        "start": 230400,
        "stop": 231200,
        "text": " That's a good tip. I have one other Home Assistant related tip. If you have hacks, do you still use hacks at all?"
      },
      {
        "start": 231200,
        "stop": 231500,
        "text": " The HACS Community Store, right?"
      },
      {
        "start": 231600,
        "stop": 232500,
        "text": " The Home Assistant Community Store. I believe, I don't remember if it's in there or if you have to go find the repo, but there is a tail scale integration now."
      },
      {
        "start": 232500,
        "stop": 233100,
        "text": " So my Home Assistant Blue has tail scale."
      },
      {
        "start": 233100,
        "stop": 233900,
        "text": " When you're on the Home Assistant OS, it's not like you can just SSH in and install the tail scale package and get it on your tail scale network."
      },
      {
        "start": 234000,
        "stop": 234900,
        "text": " I already have one Home Assistant system that is subscribed to Nebacasa Cloud, and I don't know how to have two different Home Assistant systems on one Nebacasa Cloud account."
      },
      {
        "start": 234900,
        "stop": 235700,
        "text": " So instead of getting two Nebacasa Cloud accounts with two different email addresses, I just put one Home Assistant on tail scale."
      },
      {
        "start": 235700,
        "stop": 235900,
        "text": " And it's working great."
      },
      {
        "start": 235900,
        "stop": 236300,
        "text": " It's better than that, darling. It's an official add-on these days."
      },
      {
        "start": 236300,
        "stop": 236600,
        "text": " Is it? Well, there you go."
      },
      {
        "start": 236700,
        "stop": 237400,
        "text": " I have to say it's been working really well for me, and it's how I am doing remote control of one of my Home Assistant instances now, and I give it a big thumbs up."
      },
      {
        "start": 237400,
        "stop": 238000,
        "text": " Not a sponsored thing, just telling you this. One of the things I've done recently, I still think it's worth paying for Nebacasa if you don't."
      },
      {
        "start": 238000,
        "stop": 238600,
        "text": " So I'm not saying avoid paying. I just didn't want to have two accounts."
      },
      {
        "start": 238600,
        "stop": 238800,
        "text": " Although I did consider it, actually."
      },
      {
        "start": 238800,
        "stop": 239300,
        "text": " I did consider doing it, but I just didn't want to have to manage it with two different logins and all that kind of stuff."
      },
      {
        "start": 239400,
        "stop": 239900,
        "text": " Lord Pandemic asks in the chat room, \"Anyone know if you can use Nebacasa and Tailscale at the same time?\""
      },
      {
        "start": 239900,
        "stop": 240100,
        "text": " I think the answer to that would be yes."
      },
      {
        "start": 240100,
        "stop": 240900,
        "text": " With Tailscale, if you use the split DNS functionality, so let's say you have a specific subdomain that you use just for your LAN stuff."
      },
      {
        "start": 240900,
        "stop": 241300,
        "text": " For me, I have a couple of letters which delineate the site that I'm at, for example."
      },
      {
        "start": 241300,
        "stop": 241800,
        "text": " So let's just say AB would be site 1 and CD would be site 2."
      },
      {
        "start": 241800,
        "stop": 242200,
        "text": " So it would be AB.domain.com and CD.domain.com."
      },
      {
        "start": 242300,
        "stop": 242800,
        "text": " In Tailscale, you can go into their magic DNS settings and do what's called split DNS."
      },
      {
        "start": 242800,
        "stop": 243500,
        "text": " And actually have Tailscale route to the specific DNS server in that local subnet, in that location,"
      },
      {
        "start": 243500,
        "stop": 243900,
        "text": " and look up the Home Assistant domain name in your LAN that way."
      },
      {
        "start": 243900,
        "stop": 244500,
        "text": " But if you're also paying for Nebacasa, you've pretty much got it open to the internet anyway."
      },
      {
        "start": 244500,
        "stop": 245200,
        "text": " I know it's obfuscated through a long series of letters and numbers, but it's security through obscurity, that one."
      },
      {
        "start": 245200,
        "stop": 245300,
        "text": " And it's open to anybody."
      },
      {
        "start": 245300,
        "stop": 246000,
        "text": " So if you're worried about people accessing your Home Assistant remotely, maybe the Nebacasa thing isn't,"
      },
      {
        "start": 246000,
        "stop": 246500,
        "text": " the remote access portion of it anyway, isn't the way to do that. Maybe Tailscale is."
      },
      {
        "start": 246500,
        "stop": 246700,
        "text": " But I'll leave that up to the listener."
      },
      {
        "start": 246700,
        "stop": 247500,
        "text": " And there is one key difference between the community Tailscale version that I'm using and the official add-on."
      },
      {
        "start": 247500,
        "stop": 248100,
        "text": " So the official add-on is kind of like a control panel for your devices in Tailscale."
      },
      {
        "start": 248100,
        "stop": 248700,
        "text": " But it does not put your Home Assistant instance on the Tailscale network."
      },
      {
        "start": 248700,
        "stop": 249200,
        "text": " So the community edition actually puts the machine on the network."
      },
      {
        "start": 249200,
        "stop": 249700,
        "text": " That's the difference. And you need that if you have a Home Assistant OS-based system."
      },
      {
        "start": 249700,
        "stop": 250300,
        "text": " If you're just rolling your own OS and then doing a container version of Home Assistant,"
      },
      {
        "start": 250300,
        "stop": 250700,
        "text": " you just install Tailscale on the base OS like you normally would and it'd be fine."
      },
      {
        "start": 250800,
        "stop": 251200,
        "text": " I'll put a link to both of them in the show notes so you can pick and choose the one that works best for you."
      },
      {
        "start": 251200,
        "stop": 251600,
        "text": " Because if you got like the Nebacasa Cloud thing, then you probably just want the Tailscale control panel"
      },
      {
        "start": 251600,
        "stop": 251800,
        "text": " where you can control devices and stuff."
      },
      {
        "start": 251800,
        "stop": 252300,
        "text": " But if you don't have Nebacasa yet or you got an additional Home Assistant box, you might want the full Tailscale stuff."
      },
      {
        "start": 252300,
        "stop": 252600,
        "text": " For that, you're going to need the community add-ons."
      },
      {
        "start": 252600,
        "stop": 253200,
        "text": " humio.com/hce"
      },
      {
        "start": 253200,
        "stop": 253600,
        "text": " That's where you go to ingest all of your logs in one place."
      },
      {
        "start": 253700,
        "stop": 254000,
        "text": " Humio is a centralized log management and observability platform."
      },
      {
        "start": 254000,
        "stop": 254600,
        "text": " The company was founded by developers in Denmark in 2016 as an alternative to legacy logging solutions"
      },
      {
        "start": 254600,
        "stop": 255200,
        "text": " that make it cost prohibitive to ingest and search tons of logs."
      },
      {
        "start": 255200,
        "stop": 255500,
        "text": " I mean, you know how many logs just one of your boxes produced these days."
      },
      {
        "start": 255500,
        "stop": 255700,
        "text": " What if you threw all of your systems in there?"
      },
      {
        "start": 255700,
        "stop": 256200,
        "text": " That's the real beauty of Humio is it takes the logs from any source and it makes them usable."
      },
      {
        "start": 256300,
        "stop": 256700,
        "text": " You don't have to constantly massage the format. You don't need to provide it a schema."
      },
      {
        "start": 256700,
        "stop": 257200,
        "text": " You just pump them all into Humio and they're there when you need them with a great dashboard."
      },
      {
        "start": 257200,
        "stop": 257400,
        "text": " And their platform is crazy fast."
      },
      {
        "start": 257400,
        "stop": 257900,
        "text": " Humio's index free architecture means you can ingest over a petabyte of data per day"
      },
      {
        "start": 257900,
        "stop": 258200,
        "text": " and then search that data with sub second latency."
      },
      {
        "start": 258200,
        "stop": 258800,
        "text": " But I'll tell you what, I think the best way to get going with Humio is probably the community edition."
      },
      {
        "start": 258900,
        "stop": 259400,
        "text": " Humio community edition is the largest no cost data ingestion offering on the market today,"
      },
      {
        "start": 259400,
        "stop": 259800,
        "text": " allowing you to ingest up to 16 gigs per day with seven day retention."
      },
      {
        "start": 259800,
        "stop": 260100,
        "text": " It's not a trial period. You get it for the long haul."
      },
      {
        "start": 260100,
        "stop": 260400,
        "text": " This is perfect for self-hosters who may be trying to do a little troubleshooting,"
      },
      {
        "start": 260400,
        "stop": 260700,
        "text": " figuring out what's going on. Maybe you want to put all your devices in there"
      },
      {
        "start": 260700,
        "stop": 261000,
        "text": " and get a view on your entire environment at once."
      },
      {
        "start": 261000,
        "stop": 261200,
        "text": " So much simpler when you're trying to troubleshoot."
      },
      {
        "start": 261200,
        "stop": 261600,
        "text": " You're actually going to every place to check every log,"
      },
      {
        "start": 261600,
        "stop": 261800,
        "text": " especially when you're dealing with Home Assistant."
      },
      {
        "start": 261800,
        "stop": 262100,
        "text": " Now, yeah, yeah, it'll it'll also take your Home Assistant logs."
      },
      {
        "start": 262100,
        "stop": 262400,
        "text": " It's great. You know, you could use it to monitor power consumption."
      },
      {
        "start": 262400,
        "stop": 262600,
        "text": " You could use it to monitor the health of your system."
      },
      {
        "start": 262600,
        "stop": 262900,
        "text": " You could use it to monitor your system log and more."
      },
      {
        "start": 262900,
        "stop": 263100,
        "text": " And the best part is Humio just figures it out."
      },
      {
        "start": 263100,
        "stop": 263400,
        "text": " So go try the community edition. It's awesome."
      },
      {
        "start": 263400,
        "stop": 263600,
        "text": " We already have listeners out there that are trying it out right now."
      },
      {
        "start": 263600,
        "stop": 264000,
        "text": " Some of them out in their off grid setups. Very jealous."
      },
      {
        "start": 264000,
        "stop": 264500,
        "text": " It's such a great system. And the best part is you get that forever."
      },
      {
        "start": 264500,
        "stop": 264700,
        "text": " That seven day retention, 16 gigs per day."
      },
      {
        "start": 264700,
        "stop": 265100,
        "text": " But you got to get started by going to humio.com/hce."
      },
      {
        "start": 265100,
        "stop": 265400,
        "text": " That's the community edition. It's free."
      },
      {
        "start": 265400,
        "stop": 265700,
        "text": " humio.com/hce"
      },
      {
        "start": 265700,
        "stop": 266200,
        "text": " I did something I should never do today."
      },
      {
        "start": 266200,
        "stop": 266300,
        "text": " Smoke crack?"
      },
      {
        "start": 266300,
        "stop": 266500,
        "text": " I updated to the iOS 16 beta."
      },
      {
        "start": 266500,
        "stop": 266700,
        "text": " Oh, you did?"
      },
      {
        "start": 266700,
        "stop": 266900,
        "text": " It's the release candidate in fairness."
      },
      {
        "start": 266900,
        "stop": 267200,
        "text": " I put that on my iPad. I didn't dare put it on the phone."
      },
      {
        "start": 267200,
        "stop": 267400,
        "text": " It's nice. Yeah. Works well."
      },
      {
        "start": 267400,
        "stop": 267600,
        "text": " I just wanted that lock screen. I just wanted to try out the"
      },
      {
        "start": 267600,
        "stop": 267700,
        "text": " Sure."
      },
      {
        "start": 267700,
        "stop": 267900,
        "text": " Literally just wanted to try the lock screen."
      },
      {
        "start": 267900,
        "stop": 268200,
        "text": " Yeah. It's always nice to know what apps might need updating or might break too."
      },
      {
        "start": 268200,
        "stop": 268500,
        "text": " You know, so that's if you got the ability."
      },
      {
        "start": 268500,
        "stop": 268700,
        "text": " And you work from home."
      },
      {
        "start": 268700,
        "stop": 269000,
        "text": " My favorite feature so far is the battery percentage."
      },
      {
        "start": 269000,
        "stop": 269200,
        "text": " Really?"
      },
      {
        "start": 269200,
        "stop": 269700,
        "text": " Oh, Apple. They give it so, so slowly."
      },
      {
        "start": 269700,
        "stop": 269900,
        "text": " They really do."
      },
      {
        "start": 269900,
        "stop": 270200,
        "text": " Yep. The, was it the iPhone 14 has always on display."
      },
      {
        "start": 270200,
        "stop": 270400,
        "text": " And I jokingly said to a buddy of mine,"
      },
      {
        "start": 270500,
        "stop": 270600,
        "text": " \"I'm going to come to 2014.\""
      },
      {
        "start": 270600,
        "stop": 270800,
        "text": " Yeah. My Pixel 3 has that."
      },
      {
        "start": 270800,
        "stop": 271300,
        "text": " Yeah. Now the satellite calling actually kind of legit."
      },
      {
        "start": 271300,
        "stop": 271500,
        "text": " That's pretty cool."
      },
      {
        "start": 271500,
        "stop": 271800,
        "text": " Yeah. I could see, you know, even though I'm not like some extreme hiker,"
      },
      {
        "start": 271800,
        "stop": 272100,
        "text": " I could see being on a back road somewhere and, you know,"
      },
      {
        "start": 272100,
        "stop": 272300,
        "text": " needed to make an emergency call."
      },
      {
        "start": 272300,
        "stop": 272500,
        "text": " Or you're in the middle of nowhere in your RV and there's a couple of dodgy"
      },
      {
        "start": 272500,
        "stop": 272700,
        "text": " looking dudes coming your way. You know what I'm saying?"
      },
      {
        "start": 272700,
        "stop": 272900,
        "text": " Yeah. That has happened. You're right."
      },
      {
        "start": 272900,
        "stop": 273300,
        "text": " And the thing is, is they said that it's not only going to be restricted to"
      },
      {
        "start": 273400,
        "stop": 273600,
        "text": " emergency calling, like there'll be some other limited functionality."
      },
      {
        "start": 273600,
        "stop": 273900,
        "text": " Like you can use Find My with it. So if you need to send..."
      },
      {
        "start": 273900,
        "stop": 274200,
        "text": " Oh, could I, could I order a pizza to the middle of Death Valley?"
      },
      {
        "start": 274200,
        "stop": 274600,
        "text": " Probably. Yeah, I think you probably could. I hope so."
      },
      {
        "start": 274600,
        "stop": 274800,
        "text": " Otherwise, what a waste."
      },
      {
        "start": 274800,
        "stop": 275000,
        "text": " I wonder what the delivery fees would be for that."
      },
      {
        "start": 275000,
        "stop": 275300,
        "text": " What you do is you sign up for DoorDash,"
      },
      {
        "start": 275300,
        "stop": 275500,
        "text": " you get the free membership delivery."
      },
      {
        "start": 275500,
        "stop": 275700,
        "text": " Right. Yes. Life hack."
      },
      {
        "start": 275700,
        "stop": 276000,
        "text": " Hey, you know what? Maybe we'll order a pizza at our Airbnb because"
      },
      {
        "start": 276000,
        "stop": 276200,
        "text": " the crew is getting together."
      },
      {
        "start": 276300,
        "stop": 276700,
        "text": " We have meetups coming up and the Jupiter Broadcasting crew is renting an"
      },
      {
        "start": 276700,
        "stop": 276900,
        "text": " Airbnb next to JPL."
      },
      {
        "start": 276900,
        "stop": 277200,
        "text": " So we have a whole series of meetups along the West Coast."
      },
      {
        "start": 277200,
        "stop": 277800,
        "text": " Meetup.com/JupiterBroadcasting, including one in Southern California near JPL."
      },
      {
        "start": 277800,
        "stop": 278100,
        "text": " Oh, I am so excited. We got the JPL tour."
      },
      {
        "start": 278100,
        "stop": 278600,
        "text": " We got the roadshow. You know, somehow I talked Brent into joining us again"
      },
      {
        "start": 278600,
        "stop": 278800,
        "text": " or he talked me. I'm not exactly sure."
      },
      {
        "start": 278800,
        "stop": 279200,
        "text": " This is one of those events that I can't quite believe is actually really happening."
      },
      {
        "start": 279200,
        "stop": 279700,
        "text": " Like, I just, it's just too cool for just a bunch of dudes, right? You know,"
      },
      {
        "start": 279700,
        "stop": 280000,
        "text": " it is too cool. I'm really excited about it."
      },
      {
        "start": 280000,
        "stop": 280200,
        "text": " I also am excited about all the meetups along the way."
      },
      {
        "start": 280200,
        "stop": 280400,
        "text": " We're going to do some geocache stashing."
      },
      {
        "start": 280400,
        "stop": 280600,
        "text": " So even if people can't make it to the meetup,"
      },
      {
        "start": 280600,
        "stop": 280800,
        "text": " if they're in that area later on, they might be like,"
      },
      {
        "start": 280800,
        "stop": 281000,
        "text": " go find like a swag bag or a box or something."
      },
      {
        "start": 281000,
        "stop": 281400,
        "text": " We're gonna have shirts and some Linode plushes and"
      },
      {
        "start": 281400,
        "stop": 281700,
        "text": " if you bump into a wild Brent to any of these meetups,"
      },
      {
        "start": 281700,
        "stop": 282100,
        "text": " I did seed him with a few of those self hosted stickers I made for London"
      },
      {
        "start": 282100,
        "stop": 282500,
        "text": " that were left over. So meetup.com/geobutterbroadcasting for these meetups"
      },
      {
        "start": 282500,
        "stop": 282900,
        "text": " and future ones. We will have future ones. And then we also have,"
      },
      {
        "start": 282900,
        "stop": 283200,
        "text": " we have what's called a space in Matrix."
      },
      {
        "start": 283200,
        "stop": 283500,
        "text": " It's like a way to organize several rooms together and we have what's called"
      },
      {
        "start": 283500,
        "stop": 284000,
        "text": " a meetup matrix space. So we have a chat room for Raleigh near Alex."
      },
      {
        "start": 284000,
        "stop": 284300,
        "text": " We have a chat room for Ohio for the Ohio Linux Fest."
      },
      {
        "start": 284300,
        "stop": 284600,
        "text": " We have a chat room for London. We have a chat room for the West Coast."
      },
      {
        "start": 284600,
        "stop": 284900,
        "text": " As we go, as we build out, we'll just add more chat rooms."
      },
      {
        "start": 285000,
        "stop": 285500,
        "text": " We'll have different East Coast and Central and I don't know, Australia."
      },
      {
        "start": 285500,
        "stop": 285700,
        "text": " I mean, no, it just kind of depends as we kind of spread out."
      },
      {
        "start": 285700,
        "stop": 285900,
        "text": " We'll build different ones."
      },
      {
        "start": 285900,
        "stop": 286200,
        "text": " You joke. We've had people in Matrix asking about an Australian meetup."
      },
      {
        "start": 286200,
        "stop": 286600,
        "text": " Does anybody know of a self hosted meetup app that we can run?"
      },
      {
        "start": 286600,
        "stop": 286900,
        "text": " I think we need to just, we just need to bite the ball and let people,"
      },
      {
        "start": 286900,
        "stop": 287200,
        "text": " you know, start setting up their own meetups, Alex."
      },
      {
        "start": 287200,
        "stop": 287500,
        "text": " True. Right. I think that'd be pretty cool."
      },
      {
        "start": 287500,
        "stop": 287800,
        "text": " If anybody does know, send it in. That'd be great."
      },
      {
        "start": 287900,
        "stop": 288000,
        "text": " We got some boosts into the show."
      },
      {
        "start": 288000,
        "stop": 288300,
        "text": " Our first one comes in from the Linux trucker 30,000 sats."
      },
      {
        "start": 288300,
        "stop": 288700,
        "text": " It says, I was listening to the latest show and I wanted to write in with my experience with Zigbee."
      },
      {
        "start": 288700,
        "stop": 289200,
        "text": " The first thing you both should do is switch over to Zigbee to MQTT."
      },
      {
        "start": 289200,
        "stop": 289500,
        "text": " It's so much better than ZHA."
      },
      {
        "start": 289500,
        "stop": 289700,
        "text": " It makes adding a new device a breeze."
      },
      {
        "start": 289700,
        "stop": 290000,
        "text": " Second, the Aquara brand is top notch."
      },
      {
        "start": 290000,
        "stop": 290400,
        "text": " In fact, the Aquara buttons are way better than the Tradify ones."
      },
      {
        "start": 290400,
        "stop": 290700,
        "text": " Or is it Tradify? How do you say that, you suppose, Alex?"
      },
      {
        "start": 290800,
        "stop": 291100,
        "text": " I say Tradify, but I have no idea."
      },
      {
        "start": 291100,
        "stop": 291800,
        "text": " It's like when I first read Harry Potter, I read Hermione as Hermeone or Herme one for like three years."
      },
      {
        "start": 291800,
        "stop": 292000,
        "text": " So don't ask me. I have no idea."
      },
      {
        "start": 292000,
        "stop": 292200,
        "text": " You've never said it out loud? Okay."
      },
      {
        "start": 292200,
        "stop": 292400,
        "text": " He also says the contact sensors are phenomenal."
      },
      {
        "start": 292400,
        "stop": 292700,
        "text": " I just wanted to let you know about a little gem I found."
      },
      {
        "start": 292700,
        "stop": 292900,
        "text": " It's called the KiwiSet Cover Kit."
      },
      {
        "start": 292900,
        "stop": 293300,
        "text": " It will connect with any deadbolt and turn it into a Zigbee lock."
      },
      {
        "start": 293300,
        "stop": 293600,
        "text": " Forget the August and all the other expensive ones."
      },
      {
        "start": 293700,
        "stop": 293800,
        "text": " This is a game changer."
      },
      {
        "start": 293800,
        "stop": 294200,
        "text": " You keep your existing locks, you keep your existing keys, you just make them Zigbee."
      },
      {
        "start": 294200,
        "stop": 294600,
        "text": " It uses double A batteries and it works all the time."
      },
      {
        "start": 294600,
        "stop": 295300,
        "text": " I'm sometimes gone overnight for a few days and anything smart I put in my home has always managed to break before I get back."
      },
      {
        "start": 295300,
        "stop": 295700,
        "text": " But the Aquara and the KiwiSet are both very reliable."
      },
      {
        "start": 295700,
        "stop": 295900,
        "text": " Thanks for the show."
      },
      {
        "start": 295900,
        "stop": 296100,
        "text": " Well, that's some really great recommendations, Linux Tracker."
      },
      {
        "start": 296100,
        "stop": 296200,
        "text": " Thank you."
      },
      {
        "start": 296300,
        "stop": 297200,
        "text": " Yeah, I need to make sure I'm grabbing devices that can be gone for a while and reconnect because sometimes things go offline and I don't get to it for a few days or I leave an area and leave a device behind."
      },
      {
        "start": 297200,
        "stop": 297400,
        "text": " That's good to know."
      },
      {
        "start": 297400,
        "stop": 297600,
        "text": " I don't know about going to MQTT though."
      },
      {
        "start": 297600,
        "stop": 298000,
        "text": " Well, I don't really add a device to my Zigbee network all that often."
      },
      {
        "start": 298000,
        "stop": 298800,
        "text": " I mean, I go through phases where I add a dozen at once and then nothing for six months."
      },
      {
        "start": 298800,
        "stop": 299000,
        "text": " And that's fairly simple."
      },
      {
        "start": 299100,
        "stop": 299300,
        "text": " You add the network thing on, it stays just in discovery mode."
      },
      {
        "start": 299300,
        "stop": 299500,
        "text": " You plug it in or whatever, you tap the button."
      },
      {
        "start": 299500,
        "stop": 299700,
        "text": " I mean, it's not that hard."
      },
      {
        "start": 299700,
        "stop": 299900,
        "text": " I don't know what I'm missing."
      },
      {
        "start": 299900,
        "stop": 300300,
        "text": " I feel like I should try it for science, but again, everything's just working, so I don't want to jinx it."
      },
      {
        "start": 300300,
        "stop": 300600,
        "text": " So why is Papa John boosted with 10,000 sets?"
      },
      {
        "start": 300600,
        "stop": 300900,
        "text": " He wants an update on your thoughts on iPhone versus Android."
      },
      {
        "start": 300900,
        "stop": 302000,
        "text": " He says he knows we've talked about this before, but he's looking at a Pixel phone currently and he's having a hard time choosing between Android and iOS because he needs a second phone for some personal applications he's going to be using."
      },
      {
        "start": 302000,
        "stop": 302500,
        "text": " He's been in the Android ecosystem for years, but he's not opposed to trying the fruit."
      },
      {
        "start": 302500,
        "stop": 303100,
        "text": " So he wants our thoughts and you're the most recent Android convert, so I'm curious what your update is."
      },
      {
        "start": 303100,
        "stop": 303400,
        "text": " Well, I've still got my OnePlus 7T knocking around."
      },
      {
        "start": 303400,
        "stop": 303700,
        "text": " It's actually, it's just my sofa phone."
      },
      {
        "start": 303700,
        "stop": 304300,
        "text": " Because I much prefer the Reddit client for Android, which is called Boost that I used to use."
      },
      {
        "start": 304300,
        "stop": 304600,
        "text": " I'm sorry, I'm sorry. I can't let that pass."
      },
      {
        "start": 304600,
        "stop": 304800,
        "text": " Your sofa phone, Alex?"
      },
      {
        "start": 304900,
        "stop": 305000,
        "text": " That's amazing."
      },
      {
        "start": 305000,
        "stop": 305800,
        "text": " Well, here's the thing. If I was to sell it, it's only worth like $70 or $80, so I'd just rather keep it."
      },
      {
        "start": 305800,
        "stop": 306700,
        "text": " I've got a sofa laptop, right? It's an old laptop. It's nothing fancy. I'm not going to throw it away, though. It still browses the web, so I'm just giving you a hard time."
      },
      {
        "start": 306700,
        "stop": 307300,
        "text": " In terms of feature parity and stuff like that, I mean, there's a few headline features."
      },
      {
        "start": 307300,
        "stop": 307700,
        "text": " Like if you want to watch a smartwatch, then there's only really one game in town."
      },
      {
        "start": 307800,
        "stop": 309000,
        "text": " If you want to integrate with your laptop and your tablet and AirPods and all that kind of stuff, there's only really truly one game in town that's actually worth the prices they charge."
      },
      {
        "start": 309000,
        "stop": 309600,
        "text": " From a usability perspective on both platforms, they've each got their quirks."
      },
      {
        "start": 309600,
        "stop": 310300,
        "text": " I really still strongly dislike the new Google material UI that they went with."
      },
      {
        "start": 310400,
        "stop": 310800,
        "text": " Those used to have 5 or 6 quick settings along the top in Android 10 and 11."
      },
      {
        "start": 310800,
        "stop": 311700,
        "text": " I thought that was a perfect balance and blend of screen real estate to usability and functionality if you long pressed them and all that kind of stuff."
      },
      {
        "start": 311700,
        "stop": 312400,
        "text": " I don't find Control Center on iOS to be particularly intuitive, although it does get the job done."
      },
      {
        "start": 312400,
        "stop": 313200,
        "text": " Just the way that Google took their UI, the direction they took it in last year with Android 12, I just don't like it."
      },
      {
        "start": 313300,
        "stop": 313600,
        "text": " So it's just personal preference on whether you like the UI or not."
      },
      {
        "start": 313600,
        "stop": 314700,
        "text": " But I think it boils down to this for me. I'm taking a lot of photos with a toddler running around and often they're in questionable lighting situations."
      },
      {
        "start": 314800,
        "stop": 316500,
        "text": " I've tried a lot of Android phones from OnePlus to Samsung to Pixels to another brand whose name escapes me, and nothing really came close to the iPhone with regards to that low-light performance of keeping up with a toddler."
      },
      {
        "start": 316500,
        "stop": 317400,
        "text": " For me, the camera at the moment as a fairly new parent is the most important thing about the device I have with me all the time."
      },
      {
        "start": 317500,
        "stop": 318700,
        "text": " Everything else I can kind of make do and make work and it doesn't quite feel as comfortable on iOS even a year in or so because I think I switched around Christmas."
      },
      {
        "start": 318700,
        "stop": 319500,
        "text": " But it's fine, it's good enough, I can get everything done that I need to get done. All my messaging is through Telegram and other places."
      },
      {
        "start": 319600,
        "stop": 320500,
        "text": " Switching from one platform to the other these days is really not a big deal. It might feel like it before you do it because I certainly felt that way."
      },
      {
        "start": 320500,
        "stop": 321000,
        "text": " But just try it. What's the worst that happens? You go back after six months."
      },
      {
        "start": 321000,
        "stop": 321600,
        "text": " Just avoid the iMessage trap because that can be a bit of a black hole. But yeah, I think Alex has nailed it."
      },
      {
        "start": 321600,
        "stop": 322400,
        "text": " I also find iOS to be on average more stable, the apps on average to be slightly better, a little more polished, a little more performant."
      },
      {
        "start": 322500,
        "stop": 323300,
        "text": " They're going to be native, not always. And then obviously the privacy situation is hopefully better with Apple, but I think you could argue either way."
      },
      {
        "start": 323300,
        "stop": 324100,
        "text": " Alright, last couple of boosts. We had a blank user from Podverse boost it in. He says, and we got this from a lot of people so I wanted to get this in here."
      },
      {
        "start": 324100,
        "stop": 324800,
        "text": " We did. I think I must have had about two dozen pings about this app, even though we talked about it. We just cut it from the show unfortunately."
      },
      {
        "start": 324900,
        "stop": 325900,
        "text": " There is an overseer fork for Jellyfin called JellySear and it does work great. And you know what? Fair enough. That I think is worth mentioning."
      },
      {
        "start": 325900,
        "stop": 326700,
        "text": " We also had authorities boost in with 5555 sat saying this episode has me moving from Plex to Jellyfin."
      },
      {
        "start": 326700,
        "stop": 327100,
        "text": " But the issue is I like Plex's remote feature for listening to music on the road."
      },
      {
        "start": 327100,
        "stop": 327600,
        "text": " What are your recommendations for streaming content from Jellyfin when outside your home network?"
      },
      {
        "start": 327700,
        "stop": 328200,
        "text": " I've come across a few articles that mentioned doing it with Tailscale, but I'm wondering if that would actually work seamlessly with the phone. Love the show."
      },
      {
        "start": 328200,
        "stop": 328900,
        "text": " So there is actually a couple of options here. Jellyamp is one of them. It's a web based player that you can also use on the desktop."
      },
      {
        "start": 328900,
        "stop": 329400,
        "text": " And it is not the same as Plexamp. I'm going to say that right up front. This is not the same."
      },
      {
        "start": 329400,
        "stop": 330300,
        "text": " But it does kind of accomplish what you're looking for potentially. And then I think the one that really has some promise is the Jellyfin audio player."
      },
      {
        "start": 330400,
        "stop": 331200,
        "text": " Which is now in open beta testing on iOS. Now this is a local app, all of Plexamp. And it actually looks really great."
      },
      {
        "start": 331200,
        "stop": 331800,
        "text": " You got to set it for the test flight beta. And I think there is an Android build as well. Yes, there is an Android build as well."
      },
      {
        "start": 331800,
        "stop": 332400,
        "text": " And that I think might be the way to go. So we'll put links to both of those in the show notes."
      },
      {
        "start": 332400,
        "stop": 333100,
        "text": " This is an area I'm going to look into as well because I have decided as well Jellyfin for me when I get back from the road trip."
      },
      {
        "start": 333200,
        "stop": 333900,
        "text": " I'm going Jellyfin both in the RV and I'm going Jellyfin here at the studio. I appreciate all of the hard work from the guys at Plex."
      },
      {
        "start": 333900,
        "stop": 334200,
        "text": " But I need a system that is just rock solid offline too."
      },
      {
        "start": 334200,
        "stop": 335000,
        "text": " There's a couple more as well of course with all these things. Particularly with Jellyfin it seems like there is a pretty good proliferation of clients."
      },
      {
        "start": 335000,
        "stop": 335900,
        "text": " There is one called Geli. G-E-L-L-I. As well as Finamp is another option as well."
      },
      {
        "start": 336000,
        "stop": 336600,
        "text": " So there's lots of options with Jellyfin. I think that's really the name of the game. With Plex it's almost like the Apple way."
      },
      {
        "start": 336600,
        "stop": 337400,
        "text": " Like this is how it is boys, this is what you do. Whereas with Jellyfin there's about 20 different clients you could use for different platforms."
      },
      {
        "start": 337400,
        "stop": 338300,
        "text": " There's one that I know I'm going to have to pry from my wife's cold dead fingers and that's Prolog, the audiobook app for iOS."
      },
      {
        "start": 338400,
        "stop": 339000,
        "text": " I'm really interested to see what Hadiya makes of you switching away from Plex because I know she loves the Prolog."
      },
      {
        "start": 339000,
        "stop": 339500,
        "text": " Ahhhh crap. You're right."
      },
      {
        "start": 339500,
        "stop": 340800,
        "text": " So if anybody in the audience has a good audiobook solution for Jellyfin that's in the same class as Prolog, let us know."
      },
      {
        "start": 340900,
        "stop": 341400,
        "text": " We know about Audiobookshelf already because we covered that previously so you can keep that one to yourself."
      },
      {
        "start": 341400,
        "stop": 342100,
        "text": " But if you know something that's in the Jellyfin ecosystem then let us know at selfhosted.show/contact."
      },
      {
        "start": 342100,
        "stop": 342800,
        "text": " Indeed that would be great. You can also send us a boost. I'm trying out Podverse right now. I think it's going to stick."
      },
      {
        "start": 342800,
        "stop": 343600,
        "text": " I like it because it's totally GPL which I think I've just decided with all of this recently sometimes I'm just going to pick the free software app."
      },
      {
        "start": 343700,
        "stop": 344600,
        "text": " Even if it's slightly not as optimal as say Overcast or something or Podcast Addict. I know people love that or Intennapod."
      },
      {
        "start": 344600,
        "stop": 345300,
        "text": " Intennapod is free software. But at least I'll know it will be around for a while. At least I know it's not going to rug pull me."
      },
      {
        "start": 345300,
        "stop": 345500,
        "text": " And those scruples are intact."
      },
      {
        "start": 345500,
        "stop": 346100,
        "text": " And they have iOS and Android versions. I like to flip flop sometimes. They have an F-Droid repo. I appreciate that."
      },
      {
        "start": 346200,
        "stop": 346800,
        "text": " It's a web player and it's embedded in the new JB website. So podverse.fm. I think that's a great one."
      },
      {
        "start": 346800,
        "stop": 347600,
        "text": " Also, Fountain is really great. And if you don't want to switch podcast players to Boost in check out things like Alby and of course Breeze."
      },
      {
        "start": 347600,
        "stop": 347800,
        "text": " We'll have links in the show notes if you want to try it out."
      },
      {
        "start": 347800,
        "stop": 348400,
        "text": " We do get that question a surprising amount about what do you recommend as a podcast player. So for you it's Podverse."
      },
      {
        "start": 348500,
        "stop": 349300,
        "text": " I've been looking at podcasts personally for many years. But I do think with all this Boost stuff you just earn Satch just for listening to other podcasts."
      },
      {
        "start": 349300,
        "stop": 349700,
        "text": " And then you can send them to creators just as a little tip to say thank you."
      },
      {
        "start": 349700,
        "stop": 350500,
        "text": " In the Fountain app check out Fountain FM. I'll put a link to my profile in Fountain. Sometimes I share clips on there and stuff."
      },
      {
        "start": 350500,
        "stop": 350700,
        "text": " And then I get a referral bonus. How about that?"
      },
      {
        "start": 350800,
        "stop": 351600,
        "text": " Because I think this Google Photos thing going right back to the beginning of the show, there's got to be more support for independent creators."
      },
      {
        "start": 351600,
        "stop": 352400,
        "text": " Because there was a plea you made in this week's Linux Unplugged that kind of resonated with me. I was just a lonely listener this week."
      },
      {
        "start": 352400,
        "stop": 353300,
        "text": " I wasn't in the episode. But where you were talking about the future of independent podcasting and making a plea for people to wake up and sort of see what's happening around."
      },
      {
        "start": 353400,
        "stop": 354500,
        "text": " Especially with dynamic ads. That's where I really think things are going sideways. The dynamic ad companies have figured out the best thing to do would be to get on as many podcasts as possible."
      },
      {
        "start": 354500,
        "stop": 355200,
        "text": " Even tiny podcasts and then just saturate all of them with ads. Sell one sponsor across a thousand podcasts at once and that's what they want to start doing."
      },
      {
        "start": 355200,
        "stop": 355800,
        "text": " And so if you like content like this you can always become a subscriber over at selfhosted.show/sre."
      },
      {
        "start": 355900,
        "stop": 356500,
        "text": " That's obviously a very direct way to fund the JB network and all the shows on it. Including this one of course."
      },
      {
        "start": 356500,
        "stop": 357500,
        "text": " But there are other ways as well through the boosts. That's what they're for. That's what they're part of the show for is to help support Chris's podcasting habit."
      },
      {
        "start": 357500,
        "stop": 357700,
        "text": " Yeah, it might be a podcast disease now Alex."
      },
      {
        "start": 357700,
        "stop": 357900,
        "text": " Oh yeah, maybe. Is it graduating?"
      },
      {
        "start": 357900,
        "stop": 358600,
        "text": " I think so. I think it went from hobby to career to disease now. It's all I do. Good thing I like it."
      },
      {
        "start": 358700,
        "stop": 359700,
        "text": " And so we do this show live every two weeks on a Wednesday. Although I think next week you might be on the road so the live thing is potentially up for debate. We'll see when we get there."
      },
      {
        "start": 359700,
        "stop": 360500,
        "text": " We'll give it a shot. Yeah, we'll try. I mean we may have to do offline if the bandwidth is rough but if we can do it we'll be at jupiter.tube on a Wednesday."
      },
      {
        "start": 360500,
        "stop": 361100,
        "text": " And you can get that converted to your local time at our brand new fancy shiny website jupiterbroadcasting.com/calendar."
      },
      {
        "start": 361200,
        "stop": 362000,
        "text": " That's right. The fancy new website jupiterbroadcasting.com with dynamic live, JB live embedding on the live page."
      },
      {
        "start": 362000,
        "stop": 362500,
        "text": " It's fully built in Hugo and completely self-hosted up on Linode and all that good stuff."
      },
      {
        "start": 362500,
        "stop": 363500,
        "text": " So go and take a look over on our GitHub if you want to contribute to that website. We've talked about it a bunch in LUP and Office Hours as well with the fantastic work that Brent's been doing over there."
      },
      {
        "start": 363600,
        "stop": 364200,
        "text": " And I really look forward to seeing some of you at the upcoming meetups. Meetup.com/JupiterBroadcasting."
      },
      {
        "start": 364200,
        "stop": 365000,
        "text": " As I've mentioned a few times selfhosted.show/contact is the place to go get in touch with us. You can find me on Twitter @ironicbadger."
      },
      {
        "start": 365000,
        "stop": 365800,
        "text": " I'm over there too @ChrisLAS. The show is @selfhostedshow and links to what we talked about today are at selfhosted.show/79."
      },
      {
        "start": 365800,
        "stop": 366000,
        "text": " [Music]"
      }
    ],
    "processing_time": {
      "secs": 2215,
      "nanos": 8126847
    }
  },
  "metadata": {
    "title": "Self-Hosted 79: Google is a Hostile Actor",
    "pictures": [],
    "duration": {
      "secs": 3643,
      "nanos": 536000000
    },
    "unique_id": "http://selfhosted.show/79"
  },
  "episode": {
    "title": "Self-Hosted 79 | Self-Hosted 79",
    "description": "We've made some changes since the last episode, and share why we have doubled down on Self-Hosting as much as possible.",
    "content": "<p>We&#39;ve made some changes since the last episode, and share why we have doubled down on Self-Hosting as much as possible. </p>\n\n<p><p>Plus, Chris tries out Immich, a high-performance Google Photos alternative.</p><p>Sponsored By:</p><ul><li><a href=\"https://linode.com/ssh\" rel=\"nofollow\">Linode</a>: <a href=\"https://linode.com/ssh\" rel=\"nofollow\">Receive a $100 60-day credit towards your new account. </a> Promo Code: linode.com/ssh</li><li><a href=\"https://humio.com/hce\" rel=\"nofollow\">Humio</a>: <a href=\"https://humio.com/hce\" rel=\"nofollow\">Take logs from any source and make them usable. Get started with Humio Community Edition for free.</a></li></ul><p><a href=\"https://jupitersignal.memberful.com/checkout?plan=53744\" rel=\"payment\">Support Self-Hosted</a></p><p>Links:</p><ul><li><a href=\"https://www.meetup.com/jupiterbroadcasting/events/\" title=\"Upcoming Jupiter Broadcasting Meetups\" rel=\"nofollow\">Upcoming Jupiter Broadcasting Meetups</a> &mdash; We've always got something planned. Check out our meetup page.</li><li><a href=\"https://bit.ly/meetupmatrix\" title=\"Meetup Space on Matrix\" rel=\"nofollow\">Meetup Space on Matrix</a> &mdash; A directory of our various meetup rooms on Matrix.</li><li><a href=\"https://www.nytimes.com/2022/08/21/technology/google-surveillance-toddler-photo.html\" title=\"A Dad Took Photos of His Naked Toddler for the Doctor. Google Flagged Him as a Criminal.\" rel=\"nofollow\">A Dad Took Photos of His Naked Toddler for the Doctor. Google Flagged Him as a Criminal.</a> &mdash; Google has an automated tool to detect abusive images of children. But the system can get it wrong, and the consequences are serious.</li><li><a href=\"https://cfenollosa.com/blog/after-self-hosting-my-email-for-twenty-three-years-i-have-thrown-in-the-towel-the-oligopoly-has-won.html\" title=\"After self-hosting my email for twenty-three years I have thrown in the towel. The oligopoly has won.\" rel=\"nofollow\">After self-hosting my email for twenty-three years I have thrown in the towel. The oligopoly has won.</a> &mdash; Email is now an oligopoly, a service gatekept by a few big companies which does not follow the principles of net neutrality.</li><li><a href=\"https://twitter.com/cfenollosa/status/1566484145446027265?t=sokDrW006I20Pkq6-RTIag&s=09\" title=\"Carlos Fenollosa on Twitter\" rel=\"nofollow\">Carlos Fenollosa on Twitter</a> &mdash; Email is now an oligopoly, a service gatekept by a few big companies which does not follow the principles of net neutrality.</li><li><a href=\"https://github.com/immich-app/immich\" title=\"Immich\" rel=\"nofollow\">Immich</a> &mdash;  High performance self-hosted photo and video backup solution. </li><li><a href=\"https://www.reddit.com/r/selfhosted/comments/x7fnzg/here_is_another_immichs_progress_update_and/\" title=\"Here is another Immich's progress update\" rel=\"nofollow\">Here is another Immich's progress update</a> &mdash; I apologize for the late update. August had been a very productive month for the project and the team. I hope you all had a great one as well.</li><li><a href=\"https://www.home-assistant.io/blog/2022/09/07/release-20229/\" title=\"2022.9: Home Assistant Birthday Release!\" rel=\"nofollow\">2022.9: Home Assistant Birthday Release!</a> &mdash; On September 17th, 2013 Paulus Schoutsen made the first commit for Home Assistant</li><li><a href=\"https://www.home-assistant.io/integrations/android_ip_webcam\" title=\"Android IP Webcam - Home Assistant\" rel=\"nofollow\">Android IP Webcam - Home Assistant</a> &mdash; The Android IP Webcam integration connects with Android IP Webcam to turn any Android phone or tablet into a network camera with multiple viewing options.</li><li><a href=\"https://www.home-assistant.io/integrations/fully_kiosk\" title=\"Fully Kiosk Browser - Home Assistant\" rel=\"nofollow\">Fully Kiosk Browser - Home Assistant</a> &mdash; Fully Kiosk Browser is a powerful kiosk browser for Android devices. It provides a number of features for monitoring and controlling your Android device. This integration gives you access to control your device and view the status in Home Assistant.</li><li><a href=\"https://www.home-assistant.io/integrations/tailscale/\" title=\"Tailscale - Home Assistant\" rel=\"nofollow\">Tailscale - Home Assistant</a> &mdash; This integration DOES NOT make your Home Assistant accessible via Tailscale VPN remotely!</li><li><a href=\"https://github.com/hassio-addons/addon-tailscale\" title=\"hassio-addons/addon-tailscale: Tailscale - Home Assistant Community Add-ons\" rel=\"nofollow\">hassio-addons/addon-tailscale: Tailscale - Home Assistant Community Add-ons</a> &mdash; Tailscale is a zero config VPN, which installs on any device in minutes, including your Home Assistant instance.</li><li><a href=\"https://tailscale.com/kb/1013/sso-providers/\" title=\"Supported SSO identity providers by Tailscale\" rel=\"nofollow\">Supported SSO identity providers by Tailscale</a> &mdash; Tailscale works on top of the SSO/IDP/IAM identity provider you or your company already use.</li><li><a href=\"https://github.com/m0ngr31/jellyamp\" title=\"Jellyamp\" rel=\"nofollow\">Jellyamp</a> &mdash; A stylish, cross-platform desktop client for listening to music from a Jellyfin server. Inspired by Plexamp.</li><li><a href=\"https://github.com/leinelissen/jellyfin-audio-player\" title=\"Jellyfin-audio-player\" rel=\"nofollow\">Jellyfin-audio-player</a> &mdash; This is a React Native-based audio streaming app for Jellyfin. </li><li><a href=\"https://podverse.fm/about\" title=\"Podverse.fm\" rel=\"nofollow\">Podverse.fm</a> &mdash; The GPL Podcasting 2.0 Client.</li><li><a href=\"https://fountain.fm/refer/chrislas-e72160c3c5\" title=\"Find ChrisLAS on Fountain.FM\" rel=\"nofollow\">Find ChrisLAS on Fountain.FM</a> &mdash; Fountain Streams you sats while you listen and has a great clips ecosystem for discovering new Podcasts.</li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-8795",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15630404/d9c142a0-da5b-46e1-8ede-a8ec931e67f5.mp3",
      "length": "51544634",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-09-09T03:05:00+02:00"
  },
  "speedup": 1.6449312
}