{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 400,
        "text": " Are you getting tired of the Thunderbolt single cable promise?"
      },
      {
        "start": 400,
        "stop": 500,
        "text": " I know I am."
      },
      {
        "start": 500,
        "stop": 700,
        "text": " I thought you were going to do an ad."
      },
      {
        "start": 700,
        "stop": 1000,
        "text": " Well then, friends, I have something special for you."
      },
      {
        "start": 1000,
        "stop": 1200,
        "text": " It's the super thunderbolt cable promise."
      },
      {
        "start": 1200,
        "stop": 1400,
        "text": " Petsovernightinthebox.com."
      },
      {
        "start": 1400,
        "stop": 1600,
        "text": " [Laughter]"
      },
      {
        "start": 1600,
        "stop": 2000,
        "text": " No, seriously, I just bought a CalDigit TS4 a couple of months ago."
      },
      {
        "start": 2000,
        "stop": 2300,
        "text": " You know, it's plugged into my MacBook with Thunderbolt 4 as well."
      },
      {
        "start": 2300,
        "stop": 2800,
        "text": " So, you know, the signal chain is extremely simple so far as Thunderbolt goes."
      },
      {
        "start": 2800,
        "stop": 3300,
        "text": " This thing is frustrating."
      },
      {
        "start": 3300,
        "stop": 3800,
        "text": " Very frustrating because when I wake it from sleep, my MacBook I mean,"
      },
      {
        "start": 3800,
        "stop": 4400,
        "text": " nine times out of ten I have to unplug and replug every USB device from the dock."
      },
      {
        "start": 4400,
        "stop": 4600,
        "text": " So I go over to the CalDigit website and I think,"
      },
      {
        "start": 4600,
        "stop": 4900,
        "text": " \"Okay, cool, there must be a firmware update for this thing.\""
      },
      {
        "start": 4900,
        "stop": 5500,
        "text": " Turns out a Thunderbolt 4 dock marketed primarily at Mac users,"
      },
      {
        "start": 5500,
        "stop": 5900,
        "text": " they don't have a Mac-based firmware update utility."
      },
      {
        "start": 5900,
        "stop": 6100,
        "text": " It's only for Windows."
      },
      {
        "start": 6100,
        "stop": 6400,
        "text": " No. No."
      },
      {
        "start": 6400,
        "stop": 6500,
        "text": " That's ridiculous."
      },
      {
        "start": 6500,
        "stop": 6600,
        "text": " That's embarrassing."
      },
      {
        "start": 6600,
        "stop": 6900,
        "text": " Seriously, it is embarrassing. I totally agree."
      },
      {
        "start": 6900,
        "stop": 7400,
        "text": " So luckily for me, I have a ThinkPad T48 TS which has Thunderbolt 3 on it."
      },
      {
        "start": 7400,
        "stop": 8100,
        "text": " So I wipe the thing, I put Windows on it specifically just to update the firmware on this dock."
      },
      {
        "start": 8100,
        "stop": 8600,
        "text": " I get all the way through the rigmarole of installing Windows, which is still a pain in the ass."
      },
      {
        "start": 8600,
        "stop": 9000,
        "text": " And then I go to update the firmware on the dock and it says,"
      },
      {
        "start": 9000,
        "stop": 9300,
        "text": " \"Thunderbolt firmware mismatch.\""
      },
      {
        "start": 9300,
        "stop": 9400,
        "text": " Thunderbolt 3, isn't it?"
      },
      {
        "start": 9400,
        "stop": 9500,
        "text": " Oh, no."
      },
      {
        "start": 9500,
        "stop": 10000,
        "text": " Right. So you can't update a Thunderbolt 4 device from a Thunderbolt 3 device?"
      },
      {
        "start": 10000,
        "stop": 10100,
        "text": " Oh, no you can."
      },
      {
        "start": 10100,
        "stop": 10900,
        "text": " So I got in touch with CalDigit support, which took me about a week and a half to get through the hoops I needed to get through via email."
      },
      {
        "start": 10900,
        "stop": 11900,
        "text": " They then informed me that my firmware on the T48 TS was out of date and I needed to use the firmware update tool to update the ThinkPad's firmware."
      },
      {
        "start": 11900,
        "stop": 12000,
        "text": " God."
      },
      {
        "start": 12000,
        "stop": 12900,
        "text": " And for some reason it wasn't working from Windows, so I wiped Windows and I used FwapD on Linux to update the firmware on this frickin' laptop."
      },
      {
        "start": 12900,
        "stop": 13100,
        "text": " You could have just used a live image, Alex."
      },
      {
        "start": 13100,
        "stop": 13200,
        "text": " Amazing. I love this."
      },
      {
        "start": 13200,
        "stop": 13400,
        "text": " Oh, Brent, I could have, couldn't I?"
      },
      {
        "start": 13400,
        "stop": 13500,
        "text": " Yeah."
      },
      {
        "start": 13500,
        "stop": 13700,
        "text": " I love this so much."
      },
      {
        "start": 13700,
        "stop": 14000,
        "text": " You must have been in a fugue state. You were just trying to get this done."
      },
      {
        "start": 14000,
        "stop": 14300,
        "text": " Oh, you know, I was losing the will to live slowly but surely."
      },
      {
        "start": 14300,
        "stop": 14700,
        "text": " Anyway, long story short, eventually I got the firmware update done."
      },
      {
        "start": 14700,
        "stop": 15000,
        "text": " It took way longer than it should have done."
      },
      {
        "start": 15000,
        "stop": 15600,
        "text": " We're talking like two weeks to finally get everything, all the moon and the stars aligned correctly to make this thing happen."
      },
      {
        "start": 15600,
        "stop": 15900,
        "text": " I go to open my laptop today to record this show and guess what?"
      },
      {
        "start": 15900,
        "stop": 16000,
        "text": " Uh-oh."
      },
      {
        "start": 16000,
        "stop": 16400,
        "text": " The USB devices didn't show up, so it was all for nothing."
      },
      {
        "start": 16400,
        "stop": 16600,
        "text": " Ah."
      },
      {
        "start": 16600,
        "stop": 17200,
        "text": " This does confirm my personal bias in that I think CalDigit makes the worst Thunderbolt docks."
      },
      {
        "start": 17200,
        "stop": 17900,
        "text": " And I know some podcasters out there, big talk, CalDigit, but I've never liked them."
      },
      {
        "start": 17900,
        "stop": 18300,
        "text": " And I've owned one CalDigit and I never went back."
      },
      {
        "start": 18300,
        "stop": 18700,
        "text": " And I've owned two OWC Thunderbolt docks and never had problems."
      },
      {
        "start": 18700,
        "stop": 18900,
        "text": " But I don't know if they've been Thunderbolt 4 docks."
      },
      {
        "start": 18900,
        "stop": 19100,
        "text": " They might have been Thunderbolt 3 docks."
      },
      {
        "start": 19100,
        "stop": 19400,
        "text": " But I also think the OWC docks look better."
      },
      {
        "start": 19400,
        "stop": 19600,
        "text": " I think they're better looking docks too."
      },
      {
        "start": 19600,
        "stop": 19800,
        "text": " So there's that. I'll put a link in the show notes."
      },
      {
        "start": 19800,
        "stop": 20200,
        "text": " I swear by my TS3 Plus, that thing has been extremely solid for me."
      },
      {
        "start": 20200,
        "stop": 20800,
        "text": " I had a bad experience with the TS3 Pro, the smaller one from CalDigit,"
      },
      {
        "start": 20800,
        "stop": 21600,
        "text": " where it caused a broadcast storm of packets on my network and literally took out my entire LAN until I unplugged the thing whenever the Mac went to sleep."
      },
      {
        "start": 21600,
        "stop": 22300,
        "text": " So, you know, out of the three CalDigit products I've bought, only one has functioned as advertised so far."
      },
      {
        "start": 22300,
        "stop": 22500,
        "text": " It's not going so well."
      },
      {
        "start": 22500,
        "stop": 23000,
        "text": " Alex, can I ask why you thought you should upgrade to the Thunderbolt 4?"
      },
      {
        "start": 23000,
        "stop": 23700,
        "text": " Well, I need, you know, in my house I have a home set up in my family room where I sort of hang out and record podcasts and stuff."
      },
      {
        "start": 23700,
        "stop": 24200,
        "text": " And then I have a home office downstairs and work provided me with a MacBook."
      },
      {
        "start": 24200,
        "stop": 25000,
        "text": " And so I thought, \"Oh, wouldn't it be great if I just had a Thunderbolt cable in each place and I can just plug in whatever computer I have and I'm good to go.\""
      },
      {
        "start": 25000,
        "stop": 25600,
        "text": " This TS4 has 2.5 gig ethernet as well, so I thought, \"Mmm, that's a tasty little upgrade.\""
      },
      {
        "start": 25600,
        "stop": 26100,
        "text": " I also love the idea. I've had some success, but again, it's all Thunderbolt 3."
      },
      {
        "start": 26100,
        "stop": 26700,
        "text": " I know this sounds weird, but I really love Thunderbolt and I wish it was more widely used."
      },
      {
        "start": 26700,
        "stop": 27200,
        "text": " There's definitely some uptake in the PC side of things, but it's still predominantly a Mac tech."
      },
      {
        "start": 27200,
        "stop": 27400,
        "text": " And it's so much better than USB."
      },
      {
        "start": 27400,
        "stop": 27600,
        "text": " It's just too expensive."
      },
      {
        "start": 27600,
        "stop": 28400,
        "text": " When it works, it's fantastic, but you know, you look at how USB is with USB hubs and switches and all that kind of stuff."
      },
      {
        "start": 28400,
        "stop": 29400,
        "text": " I need all that for Thunderbolt 2, however technically difficult it is to implement, and I need it to not cost $300 or $400 every time I want to buy a peripheral."
      },
      {
        "start": 29400,
        "stop": 29600,
        "text": " It reminds me of FireWire back in the day."
      },
      {
        "start": 29600,
        "stop": 30000,
        "text": " It is, very much. Same like, I think they're cousins."
      },
      {
        "start": 30000,
        "stop": 30200,
        "text": " Same kind of lineage."
      },
      {
        "start": 30200,
        "stop": 30600,
        "text": " Alex, I know that you've been continuing to de-Google like I have."
      },
      {
        "start": 30600,
        "stop": 30900,
        "text": " This trend has not slowed for me."
      },
      {
        "start": 30900,
        "stop": 31700,
        "text": " I am so far Google Photos free once again after getting sucked back in a year ago when they got me some free storage."
      },
      {
        "start": 31700,
        "stop": 32500,
        "text": " And I have yet to delete the photos, but I have a full side, like secondary system that's working all the way."
      },
      {
        "start": 32500,
        "stop": 32800,
        "text": " It's backing up. I'm trying Storage A for the first time."
      },
      {
        "start": 32800,
        "stop": 33400,
        "text": " I don't know if you've played around with those guys, but it's pretty cheap, decentralized S3 compatible storage."
      },
      {
        "start": 33400,
        "stop": 33800,
        "text": " And I'm using that with Duplicati to do backups. Like, I'm making moves, Alex!"
      },
      {
        "start": 33800,
        "stop": 34100,
        "text": " The de-Googling thing is continuing even while on the road."
      },
      {
        "start": 34100,
        "stop": 34500,
        "text": " Next step is I'm going to try out Graphene OS on my Pixel 3."
      },
      {
        "start": 34500,
        "stop": 34800,
        "text": " Not there yet, because I had to find the Pixel 3 first."
      },
      {
        "start": 34800,
        "stop": 35000,
        "text": " That's great to hear."
      },
      {
        "start": 35000,
        "stop": 35700,
        "text": " I've been looking at Photosync on iOS this week, which also supports S3 storage backends."
      },
      {
        "start": 35700,
        "stop": 36300,
        "text": " I'm not quite ready to talk about it in the show yet. I'm still figuring it out and making it work as I want to."
      },
      {
        "start": 36300,
        "stop": 36500,
        "text": " You figure it out."
      },
      {
        "start": 36500,
        "stop": 36600,
        "text": " Figure it out!"
      },
      {
        "start": 36600,
        "stop": 36900,
        "text": " We didn't welcome Brent to the show yet. Hello Brent, how are you?"
      },
      {
        "start": 36900,
        "stop": 37500,
        "text": " Oh hi, I'm doing well. I'm being reminded that almost exactly a year ago we were doing the same on the road trip."
      },
      {
        "start": 37500,
        "stop": 37900,
        "text": " I was sat in this very seat doing a self-hosted with you both."
      },
      {
        "start": 37900,
        "stop": 38300,
        "text": " And we were talking about de-Googling. We talked about Maps at that time."
      },
      {
        "start": 38300,
        "stop": 38600,
        "text": " So it's kind of our yearly review."
      },
      {
        "start": 38600,
        "stop": 39000,
        "text": " And the Maps thing is stuck. Since then I am still Google Maps free."
      },
      {
        "start": 39000,
        "stop": 39500,
        "text": " However, I realized kind of recently that I do use Waze on occasion."
      },
      {
        "start": 39500,
        "stop": 39800,
        "text": " And that is actually a Google product."
      },
      {
        "start": 39800,
        "stop": 40000,
        "text": " So there's that."
      },
      {
        "start": 40000,
        "stop": 40400,
        "text": " But I don't use it actually for nav, you know, but I just use it for the police stuff."
      },
      {
        "start": 40400,
        "stop": 40700,
        "text": " Apple Maps is surprisingly good these days."
      },
      {
        "start": 40700,
        "stop": 41100,
        "text": " Yeah, I'd say I've had a 90% success rate."
      },
      {
        "start": 41100,
        "stop": 41200,
        "text": " That's impressive."
      },
      {
        "start": 41200,
        "stop": 41600,
        "text": " I mean I can't say that I've given up Google Maps yet. I want to."
      },
      {
        "start": 41600,
        "stop": 41900,
        "text": " But maybe one day."
      },
      {
        "start": 41900,
        "stop": 42100,
        "text": " So anyway, talking about the de-Googling side of things."
      },
      {
        "start": 42100,
        "stop": 42500,
        "text": " I was focusing on audio for the last couple of weeks really."
      },
      {
        "start": 42500,
        "stop": 43200,
        "text": " And I have, for some reason, I've got about, it feels like nearly a dozen Google Home Minis dotted around this house."
      },
      {
        "start": 43200,
        "stop": 43900,
        "text": " I got for like $5 offers or free or I've just acquired an unbelievable number of these things over the years."
      },
      {
        "start": 43900,
        "stop": 44200,
        "text": " Also a couple of Chromecast audios."
      },
      {
        "start": 44200,
        "stop": 45300,
        "text": " So I've been using these things in home audio groups or speaker groups, I think is the Google phrase, to create a whole home audio solution."
      },
      {
        "start": 45300,
        "stop": 45800,
        "text": " I haven't been 100% happy with it, but it's honestly just been good enough."
      },
      {
        "start": 45800,
        "stop": 46100,
        "text": " And you know sometimes when you just want some tunes when you're in the shower or something like that."
      },
      {
        "start": 46100,
        "stop": 46500,
        "text": " Or just, you know, tidy in the house, you just want the same song playing everywhere."
      },
      {
        "start": 46500,
        "stop": 47100,
        "text": " However, as you all know, Google are not currently flavour of the month with me or Chris."
      },
      {
        "start": 47100,
        "stop": 48200,
        "text": " And the goal was, still is, whole home audio in sync through multiple different amplifiers and different speaker types and all that kind of stuff."
      },
      {
        "start": 48200,
        "stop": 49100,
        "text": " And so in my family room I have a discrete amplifier plugged into a pair of passive floor standing loudspeakers."
      },
      {
        "start": 49100,
        "stop": 50100,
        "text": " Downstairs I have another one in the kitchen area. Again it's just a normal amplifier, no smarts to it, no network connectivity, nothing like that."
      },
      {
        "start": 50100,
        "stop": 50700,
        "text": " And I've really struggled to integrate these into Home Assistant and the Smart Home in general."
      },
      {
        "start": 50700,
        "stop": 51000,
        "text": " And so I went on a bit of a mission this week to try and solve that."
      },
      {
        "start": 51000,
        "stop": 51400,
        "text": " And a few pieces of the puzzle had to fall into place to make this happen."
      },
      {
        "start": 51400,
        "stop": 52400,
        "text": " So first of all I thought I would tackle the audio playback side of these things because there's no network jack on these amplifiers."
      },
      {
        "start": 52400,
        "stop": 53300,
        "text": " So I needed to use some other hardware to act as a Spotify Connect endpoint and an Airplay endpoint for when I'm using Plexamp."
      },
      {
        "start": 53300,
        "stop": 54000,
        "text": " And I came across a bunch of feedback from a couple of years ago when I was talking about doing a similar thing whilst I was drumming."
      },
      {
        "start": 54000,
        "stop": 54700,
        "text": " And allowing people in the house to listen to the backing track that I'm playing along to through the speakers throughout the rest of the house."
      },
      {
        "start": 54700,
        "stop": 55300,
        "text": " I never actually acted on much of that feedback back then, I just sort of stuck with the Google Home thing and the Chromecast audios."
      },
      {
        "start": 55300,
        "stop": 55800,
        "text": " And like I said it sort of worked good enough but we are where we are today."
      },
      {
        "start": 55800,
        "stop": 56600,
        "text": " And so I tried a few things this week. One of them that's still on my to-do list that's very high up there, I just haven't got to it yet, is called Snapcast."
      },
      {
        "start": 56600,
        "stop": 57100,
        "text": " So if you're about to write an email telling me to check out Snapcast don't worry I'll get to it next time."
      },
      {
        "start": 57100,
        "stop": 57500,
        "text": " The first thing I tried was something called PiCorePlayer."
      },
      {
        "start": 57500,
        "stop": 58000,
        "text": " And the reason that I wanted to use this was because I've got a couple of Raspberry Pi's sat in the drawer behind me."
      },
      {
        "start": 58000,
        "stop": 58600,
        "text": " Well actually they're deployed now so they're out of the drawer and actually in use which is amazing."
      },
      {
        "start": 58600,
        "stop": 59800,
        "text": " But PiCorePlayer primarily for me was a vehicle to run the Spotify Connect software, the Shareport software for Airplay 1 compatibility."
      },
      {
        "start": 59800,
        "stop": 60200,
        "text": " And something called Logitech Media Server."
      },
      {
        "start": 60200,
        "stop": 60700,
        "text": " I don't know if you remember this, it's a really old piece of software, it's about 10 years old or so."
      },
      {
        "start": 60700,
        "stop": 61000,
        "text": " Does it do basic DLNA, is that what it does?"
      },
      {
        "start": 61000,
        "stop": 61600,
        "text": " Well I think back in the day Logitech made a piece of hardware called the SqueezeBox, do you remember that?"
      },
      {
        "start": 61600,
        "stop": 61900,
        "text": " Oh I do remember the SqueezeBox, yes."
      },
      {
        "start": 61900,
        "stop": 62700,
        "text": " And it was their kind of vision of what the smart home, smart media world should look like."
      },
      {
        "start": 62700,
        "stop": 63100,
        "text": " But they were just 10 years too early with it and I'm not exaggerating with that."
      },
      {
        "start": 63100,
        "stop": 63500,
        "text": " No everybody, the whole idea was rip your CDs and get them on this thing right?"
      },
      {
        "start": 63500,
        "stop": 64000,
        "text": " They were just before Spotify, it was before music in the cloud really."
      },
      {
        "start": 64000,
        "stop": 65300,
        "text": " Yeah and you had this kind of piece of hardware that sat on a coffee table or it was like a small little touchscreen, almost like a tablet but before touch screens were actually any good."
      },
      {
        "start": 65300,
        "stop": 66700,
        "text": " This media server kind of sat behind this thing and indexed your files and connected to internet radio was the sales pitch back then, of course now internet radio is Spotify and Pandora and all that other stuff."
      },
      {
        "start": 66700,
        "stop": 67400,
        "text": " You know it kind of created its own cloud in a way, which is sort of what you needed back then I suppose."
      },
      {
        "start": 67400,
        "stop": 68600,
        "text": " The idea, thinking about it now, is kind of a fun one and if you've got one out there you could sell it for a decent price depending on how good the condition is."
      },
      {
        "start": 68600,
        "stop": 68700,
        "text": " What?"
      },
      {
        "start": 68700,
        "stop": 69200,
        "text": " Yeah, like a decent condition one's going for 400 bucks online right now."
      },
      {
        "start": 69200,
        "stop": 69500,
        "text": " Because it's like a museum piece right?"
      },
      {
        "start": 69500,
        "stop": 69900,
        "text": " I don't know, because people love this stuff. I don't know what it is."
      },
      {
        "start": 69900,
        "stop": 70600,
        "text": " But you know, the idea is pretty great. So this thing can run the indexing back end or what Alex? The receiver?"
      },
      {
        "start": 70600,
        "stop": 71900,
        "text": " Well so there's two things at play here. There's Logitech Media Server which has been abandoned by Logitech now as I understand it and taken up by the open source community and kind of improved over the years."
      },
      {
        "start": 71900,
        "stop": 73300,
        "text": " Fundamentally though, it's still the same old piece of crap underneath and I don't wish to be rude about it but I guess I kind of have been already. It's just not a modern application."
      },
      {
        "start": 73300,
        "stop": 73600,
        "text": " But Alex, it has an iPod AUX in!"
      },
      {
        "start": 73600,
        "stop": 73900,
        "text": " Back when they had audio connections right?"
      },
      {
        "start": 73900,
        "stop": 74200,
        "text": " Yeah, back when they had audio boards."
      },
      {
        "start": 74200,
        "stop": 75700,
        "text": " So I was using PiCorePlayer to actually host LMS. And PiCorePlayer is pretty cool actually. It boots fast and it runs entirely in RAM so it doesn't write to your Raspberry Pi's SD card unless you want to save any settings."
      },
      {
        "start": 75700,
        "stop": 76400,
        "text": " And it can stream from all sorts of services like Spotify and Deezer and Tidal and BBC Music and a bunch of other stuff."
      },
      {
        "start": 76400,
        "stop": 77300,
        "text": " And it was a pretty simple setup, typical Pi stuff, you just flash an image to the SD card and five minutes later you've got a working system."
      },
      {
        "start": 77300,
        "stop": 79000,
        "text": " Trouble is, the interface once this thing loads up looks like it was written in about 1984 and it's got lots of little tweaks and buttons that I'm sure the developers of that interface know exactly where they are and which dials to tweak."
      },
      {
        "start": 79000,
        "stop": 79700,
        "text": " It's just not an interface written by humans for humans. You know what I mean?"
      },
      {
        "start": 79700,
        "stop": 80300,
        "text": " Yeah, and it makes it, not only is it a challenge for you, but forget spousal approval if you ever wanted to."
      },
      {
        "start": 80300,
        "stop": 80500,
        "text": " Oh man, never."
      },
      {
        "start": 80500,
        "stop": 81100,
        "text": " Well my goal for spousal approval was simply to have it appear as a Spotify Connect endpoint."
      },
      {
        "start": 81100,
        "stop": 81800,
        "text": " You know when you list the devices and it says here are speakers that support like a Chromecast list or an Air playlist or something like that."
      },
      {
        "start": 81800,
        "stop": 82200,
        "text": " My goal was for her not to actually ever interact with this thing."
      },
      {
        "start": 82200,
        "stop": 82600,
        "text": " Just except from like on her phone maybe it's one of the available output options."
      },
      {
        "start": 82600,
        "stop": 83000,
        "text": " Correct, but I've got to interact with it and try and figure this thing out."
      },
      {
        "start": 83000,
        "stop": 84100,
        "text": " Unfortunately Pi Core Player I don't think is quite it. I couldn't get the speaker groups set up as I wanted or configured correctly whether that was my fault or the interface or the hardware I've got."
      },
      {
        "start": 84100,
        "stop": 85100,
        "text": " I don't know, it just took up an entire evening of my time and I just got, by the end of the evening I got quite frustrated and gave up frankly."
      },
      {
        "start": 85100,
        "stop": 85600,
        "text": " Were you able to get it working at all? Did you get any piece of it working?"
      },
      {
        "start": 85600,
        "stop": 86500,
        "text": " It's still running behind me. It's booted on the Raspberry Pi that's on my desk behind me and it still sat there providing an Airplay endpoint."
      },
      {
        "start": 86500,
        "stop": 87200,
        "text": " What I ended up doing was actually pulling out my Raspberry Pi 2 out of the drawer, probably the oldest Raspberry Pi I have."
      },
      {
        "start": 87200,
        "stop": 87300,
        "text": " Oh my."
      },
      {
        "start": 87300,
        "stop": 88000,
        "text": " And I threw another project on it called 'RPI Audio Receiver'. There'll be a link to it in the show notes."
      },
      {
        "start": 88000,
        "stop": 88700,
        "text": " And this is a simple lightweight audio receiver with Bluetooth, Airplay One and Spotify Connect built in."
      },
      {
        "start": 88700,
        "stop": 89800,
        "text": " I couldn't honestly believe that within one minute of it booting and configuring a couple of things from the command line, there's a script you install on Raspberry Pi OS."
      },
      {
        "start": 89800,
        "stop": 90100,
        "text": " It just worked."
      },
      {
        "start": 90100,
        "stop": 90300,
        "text": " Mmm, that's nice."
      },
      {
        "start": 90300,
        "stop": 91300,
        "text": " After my whole evening futzing around with Pi Core Player, this thing just worked within a minute. I was like, is that it? Oh, great, cool."
      },
      {
        "start": 91300,
        "stop": 92000,
        "text": " Isn't that what you'd expect too really because all of these things are just using broadcast DNS and stuff to just discover each other."
      },
      {
        "start": 92000,
        "stop": 92700,
        "text": " So you just need to get it on the network I would imagine, right? You must have had to give it DHCP, there must have been some sort of network config info and then it just boots up?"
      },
      {
        "start": 92700,
        "stop": 93100,
        "text": " Yeah, well so it's a Raspberry Pi 2 so I just installed Raspberry Pi OS on it."
      },
      {
        "start": 93100,
        "stop": 94300,
        "text": " And then you clone the Git repo and you run the install script which sets up Bluetooth, it sets up Shareport Sync and Ras Spotify which is an open source Spotify client for Raspberry Pi."
      },
      {
        "start": 94300,
        "stop": 95000,
        "text": " And then once you've configured it via the script, it asks you for a couple of credentials, you're good to go."
      },
      {
        "start": 95000,
        "stop": 95600,
        "text": " Wow. I mean I guess setting up Raspberry Pi is not too bad. Raspberry Pi OS doesn't take too long but it is a step."
      },
      {
        "start": 95600,
        "stop": 96100,
        "text": " What took the longest was the Raspberry Pi 2 installing all the packages."
      },
      {
        "start": 96100,
        "stop": 96200,
        "text": " Oh, I slow I bet."
      },
      {
        "start": 96200,
        "stop": 97300,
        "text": " That took about 45 minutes to run the script I think. I couldn't believe how slow it was, I think I was texting Brent at the time saying this thing is just one step away from junk."
      },
      {
        "start": 97300,
        "stop": 97600,
        "text": " Yeah, it's old. But I mean it doesn't need to be that fast."
      },
      {
        "start": 97600,
        "stop": 98700,
        "text": " It does the trick for playing audio and one thing I can't say was the case for Pi Core Player, sadly one of the biggest issues with it beyond the interface was that audio just kept skipping."
      },
      {
        "start": 98700,
        "stop": 98800,
        "text": " Oh."
      },
      {
        "start": 98800,
        "stop": 100100,
        "text": " And that's just no good these days. And that was running on a Pi 4 as well so for anybody that thinks it was the Pi 2 that couldn't cope with it, the Pi 4 couldn't cope with streaming a Spotify stream through Pi Core Player."
      },
      {
        "start": 100100,
        "stop": 100200,
        "text": " Okay."
      },
      {
        "start": 100200,
        "stop": 100300,
        "text": " So."
      },
      {
        "start": 100300,
        "stop": 100400,
        "text": " That's no good."
      },
      {
        "start": 100400,
        "stop": 101000,
        "text": " I have a question Alex. Why did you decide to downgrade to a Pi 2 and not just switch over to the Pi 4?"
      },
      {
        "start": 101000,
        "stop": 101600,
        "text": " I was trying to do too many things at once, I think. I happened to have that one in the drawer."
      },
      {
        "start": 101600,
        "stop": 102200,
        "text": " I knew that I wanted to deploy two of these things to both amplifiers in the house."
      },
      {
        "start": 102200,
        "stop": 103000,
        "text": " And I only had one Raspberry Pi 4 and one Raspberry Pi 2 so I knew that the Pi 2 was going to have to be used at some point."
      },
      {
        "start": 103000,
        "stop": 103700,
        "text": " I kind of figured out the Pi Core Player wasn't where I wanted to be fairly quickly but even though I kept at it."
      },
      {
        "start": 103700,
        "stop": 104100,
        "text": " And so I was googling for other stuff in the meantime whilst it was doing its thing."
      },
      {
        "start": 104100,
        "stop": 104700,
        "text": " Yeah, I've been there. You've already burned a Pi. It's working on another version. I've got to put this on a different one."
      },
      {
        "start": 104700,
        "stop": 105000,
        "text": " That's why you've got to just have so many Pis, Alex. Now you understand my problem."
      },
      {
        "start": 105000,
        "stop": 105300,
        "text": " I know. There you go. I'm inducted."
      },
      {
        "start": 105300,
        "stop": 106100,
        "text": " So the last piece of the puzzle was figuring out how to control these dumb amplifiers and for that I turned to IR blasters."
      },
      {
        "start": 106100,
        "stop": 106600,
        "text": " This is a technology that I've used for many years with the Logitech Harmony Hub system."
      },
      {
        "start": 106600,
        "stop": 107200,
        "text": " But Logitech again, they're turning into Google aren't they with deprecating products."
      },
      {
        "start": 107200,
        "stop": 107900,
        "text": " They've stopped supporting the Harmony Hub which I still have one but I don't want to deploy a new piece of hardware in the house."
      },
      {
        "start": 107900,
        "stop": 108500,
        "text": " For starters I only have one of them and secondly I don't want to deploy a piece of hardware that's already end of life."
      },
      {
        "start": 108500,
        "stop": 109800,
        "text": " I bought a Broadlink RM4 Mini and this is an infrared blaster that I can use to program from Home Assistant infrared codes from my remote control to change the inputs on the amplifiers."
      },
      {
        "start": 109800,
        "stop": 111200,
        "text": " And then couple that with Home Assistant to detect the source changes on the Raspberry Pi Media Player and it will automatically change the inputs on the amplifier based on what's happening in the real world right now."
      },
      {
        "start": 111200,
        "stop": 112600,
        "text": " It's not perfect unfortunately. So there's a bug I think in the Broadlink integration where I will need to toggle between the three inputs I have on the amplifier in a random order."
      },
      {
        "start": 112600,
        "stop": 113700,
        "text": " In order for it to actually end up on the correct one eventually at the end of it. Like it just doesn't send the right command and I can't figure it out so I just spam the inputs and eventually it gets where I want it to be."
      },
      {
        "start": 113700,
        "stop": 113900,
        "text": " That sounds a bit annoying."
      },
      {
        "start": 113900,
        "stop": 114900,
        "text": " It is and ultimately that's why I hate infrared blasters is because they have no knowledge of what the end result was there blasting successful. Well they have no idea."
      },
      {
        "start": 114900,
        "stop": 115300,
        "text": " Yeah that does sound a little rickety. A little brittle I guess."
      },
      {
        "start": 115300,
        "stop": 116800,
        "text": " The trouble I've got though is both of these dumb amplifiers don't have an RS-232 port, they don't have any other way of controlling them besides infrared so I'm kind of stuck really unless I buy two new amplifiers which sounds like it's going to be expensive."
      },
      {
        "start": 116800,
        "stop": 117000,
        "text": " What's your sense of the reliability so far?"
      },
      {
        "start": 117000,
        "stop": 117300,
        "text": " When it works it works, when it doesn't it doesn't."
      },
      {
        "start": 117300,
        "stop": 117500,
        "text": " Mmm, hit and miss."
      },
      {
        "start": 117500,
        "stop": 118000,
        "text": " Yeah about 80% it's not high enough."
      },
      {
        "start": 118000,
        "stop": 119500,
        "text": " I bet you there is some sort of solution out there for this. Somebody out there listening has solved this problem. I solve it with HomePods. I admit it. I'm a filthy iOS ecosystem user and I just solve it with HomePods."
      },
      {
        "start": 119500,
        "stop": 119800,
        "text": " Well Alex since you're not satisfied what's your next step?"
      },
      {
        "start": 119800,
        "stop": 121200,
        "text": " Well the trouble is both of these amplifiers are sort of audiophile grade amplifiers. The one in the family room powers those beautiful big floor standing kef speakers that I've had for forever."
      },
      {
        "start": 121200,
        "stop": 123000,
        "text": " I am super happy with the sound profile of these things and I don't want to replace it. So I don't know. If you have a better idea, maybe an infrared blaster that's more reliable than the Broadlink that you could recommend me and I could try out, please let me know at selfhosted.show/contact."
      },
      {
        "start": 123100,
        "stop": 124000,
        "text": " Linode.com/SSH. Go there to get $100 in 60 day credit on a new account and you get to support the show while you're trying out something really awesome."
      },
      {
        "start": 124000,
        "stop": 124800,
        "text": " The show is made possible by folks like you taking advantage of our sponsor's offer and Linode is one that we can enthusiastically endorse."
      },
      {
        "start": 124800,
        "stop": 126300,
        "text": " You know they started in 2003 as one of the very first companies of what we now call cloud computing and now nearly 19 years later they're at the top man. They are like the best. The cream of the crop in performance, pricing, support, flexibility."
      },
      {
        "start": 126300,
        "stop": 127300,
        "text": " I mean you just name it. They got it. Eleven data centers around the world. They are their own ISP. They've invested heavily and continue to do so in high performance hardware."
      },
      {
        "start": 127300,
        "stop": 127900,
        "text": " So they just make cloud computing simple, affordable and accessible. And as a self-hoster, I love the control I get."
      },
      {
        "start": 127900,
        "stop": 128900,
        "text": " I have several Linodes that I have just nuked and built from the metal up running. One of them runs Nix and one of them runs a super crazy custom VPN Linux."
      },
      {
        "start": 128900,
        "stop": 129300,
        "text": " And Linode works with you to do all of that. They're not trying to prevent that kind of stuff."
      },
      {
        "start": 129300,
        "stop": 130500,
        "text": " What other provider out there combines that flexibility with pricing that's 30 to 50 percent cheaper than the major hyperscalers and then they wrap it all up with great support because that's how they've architected the business."
      },
      {
        "start": 130500,
        "stop": 131200,
        "text": " And they always have the latest Linux distros ready to go. They've got Kali Linux if you want to do some remote auditing of your LAN."
      },
      {
        "start": 131200,
        "stop": 131800,
        "text": " They have fantastic documentation if you just want to deep dive on a topic like I don't know maybe Ansible or Kubernetes."
      },
      {
        "start": 131800,
        "stop": 132600,
        "text": " And if you need some great backup or maybe you want to do a static Web site, they have S3 compatible object storage that just screams."
      },
      {
        "start": 132600,
        "stop": 133300,
        "text": " Then their VLAN support that lets you bridge multiple different data centers together, creating one flat virtual Linode network."
      },
      {
        "start": 133300,
        "stop": 133900,
        "text": " And of course, their powerful DNS manager makes it easy to manage your domains. I could just go on."
      },
      {
        "start": 133900,
        "stop": 134300,
        "text": " I think the best thing to do would be to try it for yourself. That's where that hundred dollars comes in."
      },
      {
        "start": 134300,
        "stop": 134900,
        "text": " That's where the hundred dollars comes in. So go to linode.com/ssh."
      },
      {
        "start": 134900,
        "stop": 135700,
        "text": " Get that one hundred dollars and sixty day credit on a new account. And it's just a great way to support the show and try out my favorite way to run applications in the cloud."
      },
      {
        "start": 135700,
        "stop": 136200,
        "text": " It's linode.com/ssh."
      },
      {
        "start": 136200,
        "stop": 137000,
        "text": " Now, Alex, when I was there last, I remember you were futzing with some hard drive issues which had existed when I was there the time before."
      },
      {
        "start": 137000,
        "stop": 137100,
        "text": " Me? Never."
      },
      {
        "start": 137100,
        "stop": 137500,
        "text": " A few months ago. So did you ever solve that? Because it wasn't solved when I left."
      },
      {
        "start": 137500,
        "stop": 138000,
        "text": " I'll let you know. I've taken some steps to try and solve it."
      },
      {
        "start": 138000,
        "stop": 139100,
        "text": " I tried all sorts of stuff to fix this. So what was happening was I had a hard drive niggle that's been hanging around since April, as you just said."
      },
      {
        "start": 139100,
        "stop": 140400,
        "text": " And since then I've tried new power cables, new data cables, a new HBA card, even a new hard drive and still just random stuff just keeps disappearing."
      },
      {
        "start": 140400,
        "stop": 141200,
        "text": " You text me, I think it was the other week, saying, I'm sure you had more episodes of final space than that."
      },
      {
        "start": 141200,
        "stop": 141600,
        "text": " Yeah, it's true. Some stuff is just vanishing randomly."
      },
      {
        "start": 141600,
        "stop": 142600,
        "text": " And the trouble with that is that it screws with all sorts of stuff like the Plex library re-indexes every night, just as a scheduled job that I have."
      },
      {
        "start": 142600,
        "stop": 143400,
        "text": " And so when the drive comes back after a reboot or something, Plex thinks, oh goody, here's a whole bunch of new content for you."
      },
      {
        "start": 143400,
        "stop": 144700,
        "text": " And it just screws up so much stuff. It's both the most amazing feature of mergerFS and probably the most frustrating in this specific scenario is that it supports drives disappearing."
      },
      {
        "start": 144700,
        "stop": 145600,
        "text": " Like a USB drive disappearing would be no issue for it. Just silently. And it doesn't tell me a failure has happened."
      },
      {
        "start": 145600,
        "stop": 146600,
        "text": " So I haven't figured out a good way to alert on this particular issue simply because it's so random when it happens."
      },
      {
        "start": 146600,
        "stop": 147100,
        "text": " Anyway, I took the decision that I got fed up of messing around with cables in the back of hard drive bays."
      },
      {
        "start": 147100,
        "stop": 148000,
        "text": " I'm using the Rosewill LSV4500 4U rack mount server case. The version I had did not have the hot swap hard drive cages in it."
      },
      {
        "start": 148000,
        "stop": 148900,
        "text": " And so to make a change to the hard drives, I had to pull the server out, lift the lid off, reach down inside in the dark with my phone torch."
      },
      {
        "start": 148900,
        "stop": 149100,
        "text": " Like a caveman."
      },
      {
        "start": 149100,
        "stop": 149900,
        "text": " I know, I know. So I finally bit the bullet. I bought three new hard drive cages that take four, three and a half hard drives each."
      },
      {
        "start": 149900,
        "stop": 151000,
        "text": " The hot swap bays. They look amazing. They've got beautiful, sexy blue LEDs on the front and they flash when activity is happening like a real server."
      },
      {
        "start": 151000,
        "stop": 152100,
        "text": " I can only fit 12 hard drives rather than 15. But actually I found the 10 to 12 ranges about the sweet spot anyway for my needs, particularly with density going up as it is."
      },
      {
        "start": 152100,
        "stop": 153700,
        "text": " And so the way I tried to solve it is just by making it easier to do maintenance, trying to reduce the number of cables being unplugged and replugged and going to a backplane based solution instead of cables directly into the drives themselves."
      },
      {
        "start": 153700,
        "stop": 154500,
        "text": " That does sound like a really good setup, Alex. Even if it doesn't necessarily solve the specific problems, it is going to be a lot easier to maintain, which will probably reduce problems overall."
      },
      {
        "start": 154500,
        "stop": 155000,
        "text": " I do hope so. We'll see though. Time will be, time will be the tell."
      },
      {
        "start": 155000,
        "stop": 155400,
        "text": " Maybe by the next time I visit, we'll have this solved."
      },
      {
        "start": 155400,
        "stop": 156000,
        "text": " Maybe by the next time you visit, Matter might actually be in existence. Did you see the update from Paulus this week?"
      },
      {
        "start": 156000,
        "stop": 156800,
        "text": " Now hold on. I thought this was, I thought this was my gig on the show. I thought I was the Matter hype guy and you were the guy saying Matter was never going to happen."
      },
      {
        "start": 156800,
        "stop": 157000,
        "text": " Oh, it doesn't matter, Chris."
      },
      {
        "start": 157000,
        "stop": 158500,
        "text": " Oh, man, it matters so much though. I am really hopeful. I know, you know, almost as much as Paulus, the founder of Home Assistant, he really seems to be like one of their biggest fans out there."
      },
      {
        "start": 158500,
        "stop": 159000,
        "text": " He says, he tweets, Matter being open source is what gives this standard a chance to be a success."
      },
      {
        "start": 159000,
        "stop": 160300,
        "text": " Google, Apple, Home Assistant and any other controller will all run the same code to control the devices. The device themselves will also run a standard Matter SDK supported by the chip vendor."
      },
      {
        "start": 160300,
        "stop": 161000,
        "text": " I expect a wave of new controllers because with this multi-admin setup, you can now have multiple controllers for your home."
      },
      {
        "start": 161000,
        "stop": 161500,
        "text": " Manufacturers that focus on just devices might add a hub. Home Depot will be back in the game."
      },
      {
        "start": 161500,
        "stop": 162200,
        "text": " I expect Sonas to join in too. Maybe Hugh. He's very hyped. He doesn't think it'll be a success from day one though."
      },
      {
        "start": 162200,
        "stop": 163000,
        "text": " I don't know. I just remember that XKCD comic, you know, where there are seven standards and they create a new standard and now there are eight standards."
      },
      {
        "start": 163000,
        "stop": 163700,
        "text": " And I just fear that's where we're going to end up. But it does sound too good to be true. Doesn't it matter? That's my fear."
      },
      {
        "start": 163700,
        "stop": 165000,
        "text": " It does. Every experience I've had in my life in tech tells me this is too good to be true. But then at the same time, we also kind of have this situation that is a little unprecedented in tech."
      },
      {
        "start": 165000,
        "stop": 166200,
        "text": " And so maybe a new solution is required here. No one vendor has just totally dominated home automation and the networking protocol and the standards that go with that."
      },
      {
        "start": 166200,
        "stop": 167200,
        "text": " Nest didn't do it. Ring didn't do it. Apple hasn't done it with HomeKit. Microsoft doesn't even have anything really, except for like the Xbox ecosystem."
      },
      {
        "start": 167200,
        "stop": 168200,
        "text": " And Amazon hasn't successfully done it with the Echo. And Google hasn't necessarily successfully done it with also their home assistant and all that stuff along with the Nest."
      },
      {
        "start": 168200,
        "stop": 169200,
        "text": " It's just kind of like this really kind of mix. Everybody has a small little chunk. You have a bunch of 10 percenters that have 10 percent of the market, 10 percent of the market."
      },
      {
        "start": 169200,
        "stop": 169900,
        "text": " And so there's no one vendor who's leading in this space that can declare victor and everybody must follow it."
      },
      {
        "start": 169900,
        "stop": 170600,
        "text": " So they kind of need to all come together and just declare a victor because none of them have won. And it's been years now."
      },
      {
        "start": 170600,
        "stop": 171700,
        "text": " It's a very good point. And I think maybe that's driven in part, at least by the proliferation of cheap Chinese clones of everything that gets made that's had proper R&D on it."
      },
      {
        "start": 171700,
        "stop": 172600,
        "text": " So maybe this is the conclusion of that and a way to try and prevent that and try and keep the Western companies, shall we say, in the game in the long run."
      },
      {
        "start": 172600,
        "stop": 174000,
        "text": " And the thing that Paulus was really excited about is that version 1.0 seems to have hit the project chip GitHub repo. You know, I feel like we don't really need to speculate when is matter going to hit the market."
      },
      {
        "start": 174000,
        "stop": 174900,
        "text": " I know with absolute certainty when it's going to hit the market. As soon as I break down and replace everything with ZigBee devices, matter will come out and it'll ship. It's obvious."
      },
      {
        "start": 174900,
        "stop": 175500,
        "text": " So you guys just have to wait. The question really is, yeah, when's Chris going to get his ZigBee devices? That's really the question we should be asking."
      },
      {
        "start": 175500,
        "stop": 175800,
        "text": " Hurry up."
      },
      {
        "start": 175800,
        "stop": 177100,
        "text": " Okay. All right. When I get back from the trip, that'll be one of my projects. Have we mentioned too that Brent and I are here in Southern Oregon? We just did our first meetup. So, yeah, we're on the road right now if we sound weird. But yeah, when I get back, I'm working on that."
      },
      {
        "start": 177100,
        "stop": 177500,
        "text": " Yeah. This time next week, I think we'll all be in LA together warming up for JPL."
      },
      {
        "start": 177500,
        "stop": 178600,
        "text": " Mm hmm. That's I am getting so excited. Yeah. I've been watching videos, reading docs, getting like all the JPL knowledge, but the videos you've been watching are like historical. Awesome."
      },
      {
        "start": 178600,
        "stop": 179200,
        "text": " Yeah, they are very the US military needed a very special unit. You know, that kind of stuff."
      },
      {
        "start": 179200,
        "stop": 180600,
        "text": " Well, I'm sorry to derail your space fun, but I did find a pretty cool project related to ESPHome and Home Assistant this week. We actually mentioned iPods a little earlier in the show. Well, here's another reference to them. Remember that click wheel style navigation on iPods as it used to have back in the day, kids?"
      },
      {
        "start": 180600,
        "stop": 180900,
        "text": " Of course. Yes."
      },
      {
        "start": 180900,
        "stop": 182000,
        "text": " Yeah, there'll be some kids around that don't remember that, which just makes me feel very old. But anyway, take a look at this link that's in the show notes and tell me this isn't the coolest Home Assistant remote you've ever seen."
      },
      {
        "start": 182000,
        "stop": 183300,
        "text": " This is better than an iPod touch because it doesn't even have a housing, so it looks really cool. But it's a little bit smaller, too. But it's essentially like a click dial attached to an ESPHome with a display, a little LED display mounted on it."
      },
      {
        "start": 183300,
        "stop": 184800,
        "text": " And you can just toggle your way through the various Home Assistant menus. You know, and the nice thing is, is a toggle wheel actually is a pretty good UI when you're doing things like turning up brightness or turning up audio up and down."
      },
      {
        "start": 184800,
        "stop": 185600,
        "text": " Like, the toggle UI works. Yeah, it does. And before touch screens, it was the way to go."
      },
      {
        "start": 185600,
        "stop": 187000,
        "text": " Have you heard that there was some, like at one point, or like there's some mockup of the iPhone but with a click wheel? They actually for a short period of time were doing two projects at the same time."
      },
      {
        "start": 187000,
        "stop": 187800,
        "text": " There was one camp that wanted an entirely new OS that was re-based on Mac OS, and there was one camp that wanted to take the iPod OS and bring it to the iPhone."
      },
      {
        "start": 187800,
        "stop": 188500,
        "text": " And so they ran both of them simultaneously until obviously the one based on OS X won out. Fascinating. I did not know that."
      },
      {
        "start": 188500,
        "stop": 189500,
        "text": " You know, a little iPod, an actual legitimate little iPod might not make a bad little Home Assistant remote if you just wanted a couple of toggle switches on there. I could see that."
      },
      {
        "start": 189500,
        "stop": 190400,
        "text": " I was watching some videos the other day on YouTube. People now are taking the old iPod classics, removing the spinning hard drive and putting SD cards in them instead."
      },
      {
        "start": 190400,
        "stop": 191500,
        "text": " And because the SD cards require, you know, a tenth of the power of a spinning hard drive, the battery life on these things is measured in months, not hours."
      },
      {
        "start": 191500,
        "stop": 192600,
        "text": " That is incredible. That's such a great idea. I love that. I'm going to experiment with different tablets and stuff, you know, use stuff. I want to find really cheap ones because I want even more screens."
      },
      {
        "start": 192600,
        "stop": 192900,
        "text": " I want a Home Assistant control screen in every room."
      },
      {
        "start": 192900,
        "stop": 193500,
        "text": " I would say again this year it's been great for me to come to the studio and also into Jupes and have those screens."
      },
      {
        "start": 193500,
        "stop": 194900,
        "text": " As someone who doesn't know, you know, all the control voices, the voice commands that I can use here, just having those screens is great. Bring them up and I was able to eventually figure out how to turn the lights off before I went to bed last night."
      },
      {
        "start": 194900,
        "stop": 195100,
        "text": " You did. Was it hard? Was it hard to figure it out?"
      },
      {
        "start": 195100,
        "stop": 195900,
        "text": " I would say the icon set on that particular one, trying to figure out which one was going to control, you know, which one was going to represent all the lights."
      },
      {
        "start": 195900,
        "stop": 196500,
        "text": " I got tons of information about other systems that got me really curious, but I eventually got there and it's pretty straightforward."
      },
      {
        "start": 196500,
        "stop": 197100,
        "text": " Yeah, because the icons really mean something to me. It's the bus icon, right? The bus icon is the one that controls the lights."
      },
      {
        "start": 197100,
        "stop": 197300,
        "text": " I never thought that was going to be a correlation."
      },
      {
        "start": 197300,
        "stop": 198800,
        "text": " Yeah, that makes sense, I suppose. And that screen, the tablet that Brent was using, it defaults to the climate control when you load up the, when the screen wakes up because that's what my wife wants access to in the morning when she's like managing power or something like that."
      },
      {
        "start": 198800,
        "stop": 200800,
        "text": " She wants to be able to just toggle on or turn up heat, and so that's what it turns onto by default. But you can toggle to the other dashboard pages, but then the tablet on the other side of the door that's in the bathroom, that tablet does default to that bus page with all the buttons and stuff. So go figure, right?"
      },
      {
        "start": 200800,
        "stop": 201200,
        "text": " So does she use one for one function and then go to back if she needs to turn the lights off?"
      },
      {
        "start": 201200,
        "stop": 202900,
        "text": " No, I don't think so. It's just because it turns out, you know, there's like a lot of times there's just different things going on out here that there are in the back. And so you just want two different controls and I want even more. I had like one by the door. So when you get in, like I just have one that just has like big buttons for lights. Hit up one big button, just lights on."
      },
      {
        "start": 202900,
        "stop": 203300,
        "text": " Would you, like, can you put something like a stream deck instead?"
      },
      {
        "start": 203300,
        "stop": 204100,
        "text": " Oh yeah, or you could do like a, you know, just a regular little wireless button. There's all kinds of, you could do an actual physical button. Yeah, I think for the door I'd probably do a physical button."
      },
      {
        "start": 204100,
        "stop": 204300,
        "text": " Look, even I'm getting excited."
      },
      {
        "start": 204300,
        "stop": 204900,
        "text": " You know, you can buy the old Nvidia Shield tablets for like $60 on eBay right now."
      },
      {
        "start": 204900,
        "stop": 205700,
        "text": " Oh, those are great tablets. All right, all right. That's a good hot tip. I'm going to go look that up before somebody listening buys them all up. How many ads are going to be on them?"
      },
      {
        "start": 205700,
        "stop": 205900,
        "text": " Well, no, I don't know. You think on the, oh."
      },
      {
        "start": 205900,
        "stop": 206500,
        "text": " The Nvidia Shields, not really. I mean, they're running Android, so, you know, that may or may not float your boat, but."
      },
      {
        "start": 206500,
        "stop": 206700,
        "text": " I wonder if you could flash them with something newer."
      },
      {
        "start": 206700,
        "stop": 207300,
        "text": " I would imagine it's a well-supported device by the likes of Lineage or that sort of stuff."
      },
      {
        "start": 207300,
        "stop": 208300,
        "text": " Oh, you're right, Alex. Look at this. Oh, also the iPad Mini 2 is $75. How would that work as a Home Assistant screen?"
      },
      {
        "start": 208300,
        "stop": 209500,
        "text": " Well, you see, the thing about the Android-based stuff is you could use fully kiosk browser and then have it, you know, use the camera to turn on and off when you're nearby, which for you with a limited power situation is probably what you want."
      },
      {
        "start": 209500,
        "stop": 209800,
        "text": " Yep. I use that now, actually. I do that same thing."
      },
      {
        "start": 209800,
        "stop": 209900,
        "text": " There you go."
      },
      {
        "start": 209900,
        "stop": 210100,
        "text": " When you approach the tablets, they just auto turn on."
      },
      {
        "start": 210100,
        "stop": 210300,
        "text": " Heck, I might have to pick one of these up. Look at this thing."
      },
      {
        "start": 210300,
        "stop": 210800,
        "text": " I know, man. That's what I'm thinking."
      },
      {
        "start": 210800,
        "stop": 211200,
        "text": " That's great. I'm getting one because I'm looking for a new tablet."
      },
      {
        "start": 211200,
        "stop": 212000,
        "text": " There you go. You see? You're going to see me just spend money right here live on the show. You shouldn't watch that, Brent."
      },
      {
        "start": 212000,
        "stop": 212200,
        "text": " It's just not gentlemanly of me."
      },
      {
        "start": 212200,
        "stop": 212900,
        "text": " Humio dot com slash HCE go there to ingest and view all of your logs in one place."
      },
      {
        "start": 212900,
        "stop": 213300,
        "text": " Humio is a centralized log management and observability platform."
      },
      {
        "start": 213300,
        "stop": 214600,
        "text": " The company was founded by developers in Denmark in 2016 as an alternative to the legacy logging solutions that make it cost prohibitive to ingest and search data volumes that you see in your large infrastructures today."
      },
      {
        "start": 214600,
        "stop": 215200,
        "text": " But I think the real beauty of Humio is that it can take logs from any source and then make them usable."
      },
      {
        "start": 215200,
        "stop": 215700,
        "text": " And you don't have to constantly massage the format. It doesn't need the schema ahead of time."
      },
      {
        "start": 215700,
        "stop": 216300,
        "text": " You just pump all of the logs in there and it has them when you need them. And the dashboard. It's great."
      },
      {
        "start": 216300,
        "stop": 216500,
        "text": " This platform is crazy."
      },
      {
        "start": 216500,
        "stop": 217200,
        "text": " Humios index free architecture means that it can ingest over a petabyte of data per day and search that was sub second latency."
      },
      {
        "start": 217200,
        "stop": 217900,
        "text": " And Humio is 80 percent cheaper than the competing platforms like Splunk or Elastic thanks to its reduced hardware footprint."
      },
      {
        "start": 217900,
        "stop": 218400,
        "text": " But really, if you're going to ask me, the best way to get started with Humio is the Humio Community Edition."
      },
      {
        "start": 218400,
        "stop": 219200,
        "text": " Humio Community Edition is the largest no cost data ingestion offering on the market today, allowing you to ingest up to 16 gigabytes per day with seven day retention."
      },
      {
        "start": 219200,
        "stop": 219500,
        "text": " It's not a trial period. You get it for the long haul."
      },
      {
        "start": 219500,
        "stop": 220100,
        "text": " This is perfect for self-hosters who want to ingest their home logs and get a single view of everything happening in your environment."
      },
      {
        "start": 220100,
        "stop": 220600,
        "text": " Rather than having to go to separate places to look at your logs and every component in your home,"
      },
      {
        "start": 220600,
        "stop": 221200,
        "text": " Humio gives you the ability to bring them together and correlate them in one place for easier troubleshooting."
      },
      {
        "start": 221200,
        "stop": 221900,
        "text": " You can have it do things like monitor your voltage and your energy or take data out of a home assistant and then generate alerts in real time to take action."
      },
      {
        "start": 221900,
        "stop": 222500,
        "text": " You can protect your computing infrastructure that way. When it's your hobby, you want it easy and quick and usable."
      },
      {
        "start": 222500,
        "stop": 222900,
        "text": " You don't want to have to turn it into a job after you just got home from your job."
      },
      {
        "start": 222900,
        "stop": 223700,
        "text": " So go get started with Humio Community Edition today at humio.com/hce."
      },
      {
        "start": 223700,
        "stop": 224000,
        "text": " That's humio.com/hce."
      },
      {
        "start": 224000,
        "stop": 224700,
        "text": " Well it's meetup season people. I'm sure you are totally not fed up with us talking about meetups."
      },
      {
        "start": 224700,
        "stop": 225000,
        "text": " But Chris and Brent are on the road on the way to LA already."
      },
      {
        "start": 225000,
        "stop": 225700,
        "text": " If you'd like to get details of all the meetups that are happening along the way, go to meetup.com/JupiterBroadcasting."
      },
      {
        "start": 225700,
        "stop": 226000,
        "text": " Where's your next one going to be gents after this airs?"
      },
      {
        "start": 226000,
        "stop": 226700,
        "text": " Sacramento, Friday. Really? So the day this comes out will be, so if you're listening, the day this comes out I believe it's Sacramento."
      },
      {
        "start": 226700,
        "stop": 227300,
        "text": " And we have all the details up there. And then after that it's Southern California."
      },
      {
        "start": 227300,
        "stop": 227800,
        "text": " And then shortly, and that's a couple, like a week later. And then after that there's one more."
      },
      {
        "start": 227800,
        "stop": 228500,
        "text": " And that is in Portland. And there was actually an issue where we had accidentally limited the RSVPs for a couple of the meetups."
      },
      {
        "start": 228500,
        "stop": 229200,
        "text": " So if that happened to you, if you tried to sign up and it said sorry, limit reached, that was a mistake."
      },
      {
        "start": 229200,
        "stop": 229500,
        "text": " That was a meetup.com, you know I'm getting rid of meetup."
      },
      {
        "start": 229500,
        "stop": 230000,
        "text": " This is the last trip I swear. Well actually I can't swear because sometimes we just don't get to it."
      },
      {
        "start": 230000,
        "stop": 230300,
        "text": " But I would love to get a self-hosted meetup replacement."
      },
      {
        "start": 230300,
        "stop": 230600,
        "text": " So if you had any problems, go sign up. There's still spots available."
      },
      {
        "start": 230600,
        "stop": 231100,
        "text": " Also if you have any suggestions for a meetup.com replacement, we're all ears."
      },
      {
        "start": 231100,
        "stop": 231500,
        "text": " We did get some emails. People went over to selfhosted.show/contact."
      },
      {
        "start": 231500,
        "stop": 231900,
        "text": " Dr. Pepper Shaker says he has some great Z-Wave light switches he wants to tell us about."
      },
      {
        "start": 231900,
        "stop": 232600,
        "text": " I wanted to give a shout out to the Zooz, that's with a Z at the end, zoo with a Z, Z-Wave light switches."
      },
      {
        "start": 232600,
        "stop": 233000,
        "text": " I was chatting with the folks on Discord. Some Shelley was recommended."
      },
      {
        "start": 233000,
        "stop": 233600,
        "text": " And I was really just kind of worried about having 40 plus Wi-Fi devices because he wants a lot of these things."
      },
      {
        "start": 233600,
        "stop": 234300,
        "text": " And I agree. You know what, he's got an ISP mandatory provided router AP that he has to use."
      },
      {
        "start": 234300,
        "stop": 234700,
        "text": " I bet that thing doesn't handle a whole bunch of Wi-Fi devices very well."
      },
      {
        "start": 234700,
        "stop": 235300,
        "text": " So he wired up his whole house with these Zooz Z-Wave light switches. The Z-Wave network is working great."
      },
      {
        "start": 235300,
        "stop": 235600,
        "text": " He says he got them on sale for Labor Day for $24 each."
      },
      {
        "start": 235600,
        "stop": 235700,
        "text": " Nice."
      },
      {
        "start": 235700,
        "stop": 236000,
        "text": " What a score. What a score."
      },
      {
        "start": 236000,
        "stop": 236300,
        "text": " Alright, that's definitely something to check out, he says. Thank you."
      },
      {
        "start": 236300,
        "stop": 236400,
        "text": " And he loves the show."
      },
      {
        "start": 236400,
        "stop": 236600,
        "text": " Well thanks Dr. Pepper Shaker. We love that tip."
      },
      {
        "start": 236600,
        "stop": 237300,
        "text": " Yeah, they're on at $28 right now. So I mean even outside of the sale they're not particularly expensive."
      },
      {
        "start": 237300,
        "stop": 238100,
        "text": " Compared to say a Shelley or something like that which is typically in that, you know for the Shelley 2.5, it's typically in that $25 range anyway."
      },
      {
        "start": 238100,
        "stop": 238500,
        "text": " But these look really, really interesting and they get fantastic reviews."
      },
      {
        "start": 238500,
        "stop": 239500,
        "text": " A friend of mine actually moved house last weekend and one of the jobs that we went round to help him with was pulling out all of his old Shelley's out of the walls."
      },
      {
        "start": 239500,
        "stop": 240600,
        "text": " Putting Shelley's in is not difficult but it is also really difficult trying to reverse engineer which wire goes where and what's a traveller and blah blah blah blah."
      },
      {
        "start": 240600,
        "stop": 241500,
        "text": " Trying to reverse engineer the Shelley's when you take them out in someone else's house is also just as much of a pain in the ass as well."
      },
      {
        "start": 241500,
        "stop": 242400,
        "text": " So I think smart switches with the smarts built into them versus a Shelley is something I really think I need to investigate strongly moving forward."
      },
      {
        "start": 242400,
        "stop": 243500,
        "text": " That makes a lot of sense. It seems you're right. I had not given a lot of thought about removing them because honestly if I was going to sell a house I'd just leave them in there and say it's part of the package but"
      },
      {
        "start": 243500,
        "stop": 244500,
        "text": " No dude, no one else cares about your smart home stuff. And if you've got $1500, $120 of these things that's $400, $500. Why would I leave that for someone else?"
      },
      {
        "start": 244500,
        "stop": 245200,
        "text": " They're never going to use it, they're never going to set it up. It doesn't add any value to them, it just adds complexity. It's probably a negative for most people, unfortunately."
      },
      {
        "start": 245200,
        "stop": 245800,
        "text": " When was the last time you moved into a house and took the light switches apart just to see what was behind them? Never."
      },
      {
        "start": 245800,
        "stop": 246300,
        "text": " You always find some surprise in my experience. You guys are just adding to that."
      },
      {
        "start": 246300,
        "stop": 247200,
        "text": " That's true. Yeah. But building it into the switch does seem a lot simpler from an installation, a removal, troubleshooting if it dies. That's a great point."
      },
      {
        "start": 247200,
        "stop": 248200,
        "text": " Alright, another check in the box for Z-Wave. Now that I've committed to switching to Zigbee we keep finding all these awesome Z-Wave devices. I'm going to have both."
      },
      {
        "start": 248200,
        "stop": 249900,
        "text": " One thing I should note though about these ZOOZ switches is that some of these switches nowadays don't require a neutral. So in older houses they didn't always include a neutral wire. These ones do require a neutral so please make sure you go and check before you spend any money."
      },
      {
        "start": 249900,
        "stop": 251500,
        "text": " Sue writes in, and we got a lot of opinions about hosting your own email server because we brought that up, we read that article where the author was very frustrated, said that it's basically just only for big tech now. Sue says, you know, maybe it was a bit of a country based issue."
      },
      {
        "start": 251500,
        "stop": 253200,
        "text": " He's in Barcelona. I have been self-hosting email and web service since 2011 across three states in the US and I've only ever had one undelivered email and that was actually a misconfiguration on the far side. If you get a business connection, yes, it costs more. It's about double."
      },
      {
        "start": 253200,
        "stop": 254300,
        "text": " I have $250 for gigabit symmetric. Oh, man. Today we have been fighting bandwidth issues. We've been struggling for a few kilobits a second. That sounds glorious."
      },
      {
        "start": 254300,
        "stop": 255900,
        "text": " If you get at least one static IP, the same day customer service, and then there's generally no bandwidth caps, not to mention no one is going to yeet everything into the sun from a business block IP space. That's true. They're not just going to write off a whole business block of IPs."
      },
      {
        "start": 255900,
        "stop": 257500,
        "text": " I realize that there are some for whom this is impossible, you know, awful. You or the crypto bro musky star link types, but the crypto. Yeah, we call it Elon link, Sue. That's what we call it. That's it's Elon link."
      },
      {
        "start": 257500,
        "stop": 259200,
        "text": " But you know what? I kind of get the I kind of get your point here. It's like if you set it up right, if you have the right kind of connection, if you don't get your IP in trouble, you get a good ISP, you can still host your own email. I get that."
      },
      {
        "start": 259200,
        "stop": 260800,
        "text": " Also, Sue mentions that they're a big user of unraid 186 terabytes running for 12 years. Yeah, that's solid. I mean, the unraid stuff on race been around a long time. And you know, I think I've been interested in an extra sort of seven or eight years at this point."
      },
      {
        "start": 260800,
        "stop": 262600,
        "text": " And it was was pretty old when I got involved in the unraid community. So good on you, Sue. Sue also gives you a shout out, Alex, for lots of assistance over the years. Thank you. Thank you. Now, on the flip side, we got a boost from I'm going to say a Hannigan a Hannigan."
      },
      {
        "start": 262600,
        "stop": 264100,
        "text": " And they write, I actually agree with that blog post on the self hosted email. I have done it since 2003, but found out it's increasingly harder to get my mail delivered, especially sending to Gmail. I ended up switching to fast mail last year."
      },
      {
        "start": 264100,
        "stop": 265400,
        "text": " Here's another benefit of using a real email provider. And I use I use real email provider to be slightly provocative, only slightly bitwarden this week actually added alias support for fast mail."
      },
      {
        "start": 265400,
        "stop": 267800,
        "text": " Yeah, that's so sweet. So for those that don't know what that means, you know, when you sign up to a website and you put your real email address in an alias through bitwarden that user generation stuff, that username generation stuff they added fairly recently, you can now also generate a username with an automatic email forwarding alias going via your fast mail account."
      },
      {
        "start": 267800,
        "stop": 269200,
        "text": " They also support simple log in and non addy and Firefox relay email services. So essentially, you can mask your real email address from the services automatically as part of the bitwarden generation."
      },
      {
        "start": 269200,
        "stop": 270200,
        "text": " And it interfaces with the fast mail API to actually add that alias into your email kind of universe within fast mail, which is just thought is amazing."
      },
      {
        "start": 270200,
        "stop": 271200,
        "text": " I hear so many good things about fast mail to so many good things from the audience. A Hanukkah Hanukkah sent 5000 sets froze. They're also sent in 5000 sets."
      },
      {
        "start": 271200,
        "stop": 271900,
        "text": " Just wanted to mention pod versus great, but I wish pod verse had sat streaming. It's a more fair way to give value for value."
      },
      {
        "start": 271900,
        "stop": 272500,
        "text": " I wanted to give pod verse a plug here on the show because I think the self hosted audience might be really interested in it."
      },
      {
        "start": 272500,
        "stop": 273400,
        "text": " It is a slick cross platform web, Android and iOS podcast player, and it syncs between all of them."
      },
      {
        "start": 273400,
        "stop": 273900,
        "text": " I love that because it means I can listen to something and then finish it at my desk using the Web player."
      },
      {
        "start": 273900,
        "stop": 274400,
        "text": " And it also means that when I have my flings with Android, I have all my podcasts on there."
      },
      {
        "start": 274400,
        "stop": 275100,
        "text": " The other thing I really like about pod verse and why I wanted to mention it on here is because it's GPL and you can embed it on your website."
      },
      {
        "start": 275100,
        "stop": 275600,
        "text": " We've done it on Jupiter broadcasting and I've talked to the lead dev Mitch several times."
      },
      {
        "start": 275600,
        "stop": 276300,
        "text": " In fact, he's messaging me right now as we're recording and they're working on all kinds of stuff, including sat streaming."
      },
      {
        "start": 276300,
        "stop": 276600,
        "text": " So you can just send the stats as you listen and they and will receive them."
      },
      {
        "start": 276600,
        "stop": 277800,
        "text": " It also supports a bunch of the other podcasting to features like live streaming chapters, transcripts, host information and a bunch of other things."
      },
      {
        "start": 277800,
        "stop": 278200,
        "text": " They've also been really great collaborators on our new website as well."
      },
      {
        "start": 278200,
        "stop": 278800,
        "text": " Yeah, we solved a lot of issues on both ends with adding their player embedded on our website."
      },
      {
        "start": 278800,
        "stop": 279400,
        "text": " And it was really neat because we had found a few bugs in their player and they were happy to fix them pretty quickly."
      },
      {
        "start": 279400,
        "stop": 279700,
        "text": " And it's been great to see those two communities come together."
      },
      {
        "start": 279700,
        "stop": 280300,
        "text": " Yeah, that's one of the really neat things that Mitch told me is now that some of their best contributors to pod verse are Jupiter broadcasting listeners."
      },
      {
        "start": 280300,
        "stop": 280400,
        "text": " That's that's so cool."
      },
      {
        "start": 280400,
        "stop": 280500,
        "text": " Yeah, it is really neat."
      },
      {
        "start": 280500,
        "stop": 280800,
        "text": " So check out pod verse if you haven't pod verse dot FM."
      },
      {
        "start": 280800,
        "stop": 282400,
        "text": " Also, shout out to Prozac, who sent us a row of ducks just thanking us for the pragmatic cloud discussion in episode seventy nine and the young Dookie who just got a house and is looking to build a full home assistant set up going all in."
      },
      {
        "start": 282400,
        "stop": 282500,
        "text": " It's such an exciting time."
      },
      {
        "start": 282500,
        "stop": 282700,
        "text": " So congratulations, young Dookie."
      },
      {
        "start": 282700,
        "stop": 282800,
        "text": " Keep us posted on that."
      },
      {
        "start": 282800,
        "stop": 283400,
        "text": " And then Shim, what do you think there, Brent Schmitzfeld Schmitzfeld sent two sats."
      },
      {
        "start": 283400,
        "stop": 283800,
        "text": " Just to see if it was possible to send two sats across the Internet."
      },
      {
        "start": 283800,
        "stop": 283900,
        "text": " And it was."
      },
      {
        "start": 283900,
        "stop": 284300,
        "text": " Yeah, and then we got ten thousand sats from Silver Snake."
      },
      {
        "start": 284300,
        "stop": 284400,
        "text": " No message."
      },
      {
        "start": 284400,
        "stop": 284500,
        "text": " Just send it into the show."
      },
      {
        "start": 284500,
        "stop": 285200,
        "text": " And I just want to give a special hello to main hippo who sent their very first boost this week into the show."
      },
      {
        "start": 285200,
        "stop": 285200,
        "text": " Amazing."
      },
      {
        "start": 285200,
        "stop": 285900,
        "text": " Yeah, I think my favorite thing about boosts is the fact that we're kind of rekindling the bizarreness of the IRC, Nick."
      },
      {
        "start": 285900,
        "stop": 286000,
        "text": " All these names."
      },
      {
        "start": 286000,
        "stop": 286100,
        "text": " It's fantastic."
      },
      {
        "start": 286100,
        "stop": 286300,
        "text": " Yeah, it's a struggles for me to read some of these."
      },
      {
        "start": 286300,
        "stop": 286500,
        "text": " But that's my favorite part."
      },
      {
        "start": 286500,
        "stop": 286600,
        "text": " When I get it right, it's a win."
      },
      {
        "start": 286600,
        "stop": 286900,
        "text": " And when I don't get it right, they can boost in again to tell me I got it wrong."
      },
      {
        "start": 286900,
        "stop": 287000,
        "text": " It's also a win."
      },
      {
        "start": 287000,
        "stop": 287100,
        "text": " Yeah."
      },
      {
        "start": 287100,
        "stop": 287200,
        "text": " So go check out a new podcast app."
      },
      {
        "start": 287200,
        "stop": 288200,
        "text": " Go to new podcast apps dot com and grab one that works for you or grab Breeze if you don't want to switch or boost CLI or, you know, try out pod verse."
      },
      {
        "start": 288200,
        "stop": 288400,
        "text": " I think it's pretty great."
      },
      {
        "start": 288400,
        "stop": 288700,
        "text": " A little bit of self."
      },
      {
        "start": 288700,
        "stop": 288800,
        "text": " I don't know."
      },
      {
        "start": 288800,
        "stop": 289000,
        "text": " Promotion isn't the right word, but you know what I mean?"
      },
      {
        "start": 289000,
        "stop": 289300,
        "text": " I'm looking to sell my old dual Xeon motherboard."
      },
      {
        "start": 289300,
        "stop": 289700,
        "text": " It's a gigabyte GA7 Pesh 2."
      },
      {
        "start": 289700,
        "stop": 290000,
        "text": " It's the dual Xeon LGA 2011 board."
      },
      {
        "start": 290000,
        "stop": 290500,
        "text": " There's a pair of E5 2690 V2 CPUs in there."
      },
      {
        "start": 290500,
        "stop": 291000,
        "text": " I've also got 128 gigabytes of DDR3 ECC memory in that system."
      },
      {
        "start": 291000,
        "stop": 291400,
        "text": " I just don't use it anymore and I figure it should go to a good home."
      },
      {
        "start": 291400,
        "stop": 292000,
        "text": " There's a couple of 10 gig NICs on the board, which have been a little flaky recently."
      },
      {
        "start": 292000,
        "stop": 292400,
        "text": " So I've been using an Intel NIC card to go in there."
      },
      {
        "start": 292400,
        "stop": 292700,
        "text": " So just be aware of that if you're interested in the board."
      },
      {
        "start": 292700,
        "stop": 293300,
        "text": " Let me know via Discord or Twitter if you would like it and we'll come to some arrangement about how to get it to you."
      },
      {
        "start": 293300,
        "stop": 293600,
        "text": " Maybe it'd be a good start for somebody to build a home lab box."
      },
      {
        "start": 293600,
        "stop": 293800,
        "text": " 128 gigs of RAM in those CPUs."
      },
      {
        "start": 293800,
        "stop": 294000,
        "text": " You could run some VMs."
      },
      {
        "start": 294000,
        "stop": 294100,
        "text": " That would do the job."
      },
      {
        "start": 294100,
        "stop": 294700,
        "text": " I paid $250 for those CPUs four years ago and they're worth about 20 bucks now."
      },
      {
        "start": 294700,
        "stop": 295000,
        "text": " But they still crunch, man. They still crunch."
      },
      {
        "start": 295000,
        "stop": 295200,
        "text": " I'm impressed by the old Xeons."
      },
      {
        "start": 295200,
        "stop": 295600,
        "text": " I have to say, I mean, I have that old Super Micro box that's like seven, eight years old."
      },
      {
        "start": 295600,
        "stop": 295900,
        "text": " And I threw PhotoPrism on there the other day."
      },
      {
        "start": 295900,
        "stop": 296100,
        "text": " And yeah, it lit up every single core."
      },
      {
        "start": 296100,
        "stop": 296800,
        "text": " But sure enough, it did the face detection and it did the object recognition at a pretty reasonable pace on an old box."
      },
      {
        "start": 296800,
        "stop": 297300,
        "text": " So, you know, you never know. And those CPUs are slower than what you're talking about."
      },
      {
        "start": 297300,
        "stop": 297500,
        "text": " So you never know. You could get quite a bit out of that stuff."
      },
      {
        "start": 297500,
        "stop": 298000,
        "text": " Ten cores and 20 threads per CPU is quite the thing to observe in HTOP, let me tell you."
      },
      {
        "start": 298000,
        "stop": 298400,
        "text": " Yes, it is. You know what? I'd say it's a thing of beauty, Alex."
      },
      {
        "start": 298400,
        "stop": 298600,
        "text": " It is beautiful."
      },
      {
        "start": 298600,
        "stop": 299000,
        "text": " Also, our members are beautiful. Thank you for supporting the show."
      },
      {
        "start": 299000,
        "stop": 299400,
        "text": " If you'd like to become one of our SREs, you can go to selfhosted.show/sre."
      },
      {
        "start": 299400,
        "stop": 299800,
        "text": " I really think of that as an investment in future content generation."
      },
      {
        "start": 299800,
        "stop": 300200,
        "text": " You know, people can boost in and thank us for the episode we've made and get a message on the show."
      },
      {
        "start": 300200,
        "stop": 301200,
        "text": " But our members are investing in the ongoing day-to-day research production and just honestly help keep us focused on making our listeners happy,"
      },
      {
        "start": 301200,
        "stop": 301500,
        "text": " making our audience happy as one of our biggest customers."
      },
      {
        "start": 301500,
        "stop": 302100,
        "text": " You can become a member at selfhosted.show/sre and you get an ad-free feed as a thank you."
      },
      {
        "start": 302100,
        "stop": 302600,
        "text": " Just a quick thank you to Brent for joining us today. Thank you very much. Where can people go and find you, good sir?"
      },
      {
        "start": 302600,
        "stop": 303000,
        "text": " I think Twitter's a good one. @BrentJurva. If you can spell it, you win a prize."
      },
      {
        "start": 303000,
        "stop": 303400,
        "text": " Don't forget that other show that we make called Linux Unplugged as well."
      },
      {
        "start": 303400,
        "stop": 303700,
        "text": " Yeah, I mean, he forgot to mention that part, but Alex got it for you, Brent."
      },
      {
        "start": 303700,
        "stop": 304500,
        "text": " Oh, thanks, Alex. Yeah, I did actually get a new computer and that episode is going to come out this week, so we talk all about it."
      },
      {
        "start": 304500,
        "stop": 304800,
        "text": " That's a big day for you. That doesn't happen very often."
      },
      {
        "start": 304800,
        "stop": 305300,
        "text": " You were there last time that I got a new computer and you and I Frankenstein the whole thing, the X250."
      },
      {
        "start": 305300,
        "stop": 305500,
        "text": " Yeah, what was it? The X250, right?"
      },
      {
        "start": 305500,
        "stop": 305900,
        "text": " X250, yeah. We put a new screen in it and a bunch of hard drive and memory upgrades."
      },
      {
        "start": 305900,
        "stop": 306900,
        "text": " And you know what I did? Chris and I spent basically three days running a bunch of benchmarks on both the X250 and the new Dev.One that Chris and Wes bought me, those sweethearts."
      },
      {
        "start": 306900,
        "stop": 307400,
        "text": " And we can now say also the brand new Thaleo that was just released today as we're recording."
      },
      {
        "start": 307400,
        "stop": 308000,
        "text": " That's true. Yeah, that's why it took three days. We had a lot of fun. We were doing some major shootouts. It was pretty great."
      },
      {
        "start": 308000,
        "stop": 309400,
        "text": " Those guys over at System76, they do some cool stuff. Speaking of which, actually, I got word today that one of our old friends in the network, Cheese Bacon, is going to be at All Things Open in Raleigh at the beginning of November."
      },
      {
        "start": 309400,
        "stop": 310500,
        "text": " I will try and be there as well. Certainly we'll do a micro meetup in the Raleigh area. We'll post some details on the meetup page in the element room as well to get the details on that one as well."
      },
      {
        "start": 310500,
        "stop": 311400,
        "text": " But if you come into All Things Open, it would be great to see you. Maybe you will go out for an evening of debauchery and fun. I don't know what we'll do."
      },
      {
        "start": 311400,
        "stop": 311500,
        "text": " Any trivia, Alex?"
      },
      {
        "start": 311500,
        "stop": 311700,
        "text": " Maybe some trivia."
      },
      {
        "start": 311700,
        "stop": 311900,
        "text": " Maybe. Maybe."
      },
      {
        "start": 311900,
        "stop": 312800,
        "text": " Yeah, go get in the Matrix room and do the meetup spaces. We have more and more all the time. Details are at jupyterbroadcasting.com/matrix."
      },
      {
        "start": 312800,
        "stop": 313400,
        "text": " And of course, we always love your feedback. You can send that in at selfhosted.show/contact. That's where you get in touch with us."
      },
      {
        "start": 313400,
        "stop": 313600,
        "text": " I'm on Twitter @ironicbadger."
      },
      {
        "start": 313600,
        "stop": 314100,
        "text": " I'm over there @chrislas and the podcast, well that's @selfhostedshow, obviously."
      },
      {
        "start": 314100,
        "stop": 314500,
        "text": " Thanks for listening everybody. That was selfhosted.show/80."
      },
      {
        "start": 314500,
        "stop": 314700,
        "text": " [Music]"
      }
    ],
    "processing_time": {
      "secs": 1969,
      "nanos": 902827016
    }
  },
  "metadata": {
    "title": "Self-Hosted 80: Solving Whole Home Audio",
    "pictures": [],
    "duration": {
      "secs": 3132,
      "nanos": 90000000
    },
    "unique_id": "http://selfhosted.show/80"
  },
  "episode": {
    "title": "Solving Whole Home Audio | Self-Hosted 80",
    "description": "Alex is replacing his Chromecast and Google Nest Mini with an open-source solution, and why were all getting a little hyped about Matter. Special Guest: Brent Gervais.",
    "content": "<p><p>Alex is replacing his Chromecast and Google Nest Mini with an open-source solution, and why were all getting a little hyped about Matter.</p><p>Special Guest: Brent Gervais.</p><p>Sponsored By:</p><ul><li><a href=\"https://linode.com/ssh\" rel=\"nofollow\">Linode</a>: <a href=\"https://linode.com/ssh\" rel=\"nofollow\">Receive a $100 60-day credit towards your new account. </a> Promo Code: linode.com/ssh</li><li><a href=\"https://humio.com/hce\" rel=\"nofollow\">Humio</a>: <a href=\"https://humio.com/hce\" rel=\"nofollow\">Take logs from any source and make them usable. Get started with Humio Community Edition for free.</a></li></ul><p><a href=\"https://jupitersignal.memberful.com/checkout?plan=53744\" rel=\"payment\">Support Self-Hosted</a></p><p>Links:</p><ul><li><a href=\"https://www.amazon.com/OWC-Thunderbolt-Dock-Compatible-Equipped/dp/B097TVLB4F/\" title=\"OWC Thunderbolt Dock\" rel=\"nofollow\">OWC Thunderbolt Dock</a> &mdash; Compatible with M1 Macs, Thunderbolt 3 Equipped Macs, and Thunderbolt 4 PCs</li><li><a href=\"https://github.com/badaix/snapcast\" title=\"Snapcast\" rel=\"nofollow\">Snapcast</a> &mdash; Snapcast is a multiroom client-server audio player, where all clients are time synchronized with the server to play perfectly synced audio. It's not a standalone player, but an extension that turns your existing audio player into a Sonos-like multiroom solution.</li><li><a href=\"https://www.picoreplayer.org/\" title=\"piCorePlayer\" rel=\"nofollow\">piCorePlayer</a> &mdash; Free software that plays local music as well as online music streaming services on a Raspberry Pi</p>\n\n<p></li><li><a href=\"https://www.mysqueezebox.com/download\" title=\"Welcome to mysqueezebox.com!\" rel=\"nofollow\">Welcome to mysqueezebox.com!</a></li><li><a href=\"https://www.amazon.com/Broadlink-RM4-Universal-Control-Compatible/dp/B07ZSF46BX?th=1\" title=\"BroadLink RM4 Mini IR Universal Remote Control\" rel=\"nofollow\">BroadLink RM4 Mini IR Universal Remote Control</a> &mdash; Wi-Fi Infrared Blaster</li><li><a href=\"https://www.rosewill.com/rosewill-rsv-sata-cage-34-hard-disk-drive-cage/p/9SIA072GJ92556?seoLink=server-components&seoName=Server%20Components\" title=\"Rosewill RSV-SATA-Cage-34\" rel=\"nofollow\">Rosewill RSV-SATA-Cage-34</a></li><li><a href=\"https://mobile.twitter.com/balloob/status/1571852962766659587\" title=\"Paulus Schoutsen on Twitter\" rel=\"nofollow\">Paulus Schoutsen on Twitter</a> &mdash; Oh hello Matter v1 </li><li><a href=\"https://github.com/landonr/esphome-remote\" title=\"esphome-remote\" rel=\"nofollow\">esphome-remote</a> &mdash; iPod style wifi smart home remote. Uses ESPHome and Home Assistant to integrate with Sonos, Roku and run custom scenes and scripts. </li><li><a href=\"https://caddy.community/t/asrock-ipmi-websocket-connection-failed-caddy-v2/16961/8\" title=\"AsRock IPMI websocket connection failed Caddy V2\" rel=\"nofollow\">AsRock IPMI websocket connection failed Caddy V2</a></li><li><a href=\"https://www.meetup.com/jupiterbroadcasting/\" title=\"Jupiter Broadcasting Meetups\" rel=\"nofollow\">Jupiter Broadcasting Meetups</a> &mdash; Keep an eye out for a meetup near you!</li><li><a href=\"https://bit.ly/meetupmatrix\" title=\"Jupiter Broadcasting Meetup Rooms on Matrix\" rel=\"nofollow\">Jupiter Broadcasting Meetup Rooms on Matrix</a></li><li><a href=\"https://www.getzooz.com/products/\" title=\"Z-Wave  ZOOZ Switches\" rel=\"nofollow\">Z-Wave  ZOOZ Switches</a></li><li><a href=\"https://www.fastmail.help/hc/en-us/articles/5469165600655-Using-Bitwarden-with-Fastmail\" title=\"Using Bitwarden with Fastmail\" rel=\"nofollow\">Using Bitwarden with Fastmail</a> &mdash; If you have a Bitwarden account, you can create Masked Email addresses quickly and easily through Bitwarden's Generator.</li><li><a href=\"https://podcastindex.org/apps?appTypes=app&elements=Value\" title=\"Send a Boost with a New Podcast App\" rel=\"nofollow\">Send a Boost with a New Podcast App</a> &mdash; Grab a Podcasting 2.0 compatible app, and send a boost into the show.</li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-8849",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15659832/22d2f61e-8580-4024-83a3-9ee3a61e12d5.mp3",
      "length": "44350707",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-09-23T03:05:00+02:00"
  },
  "speedup": 1.5899719
}