{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 632,
        "text": " Well, it does feel like we were only just in California, but you're making excuses to go back again. What's wrong with you?"
      },
      {
        "start": 632,
        "stop": 1424,
        "text": " Excuses excuses. I'm being dragged back just when I thought I was out Alex. They pull me back in"
      },
      {
        "start": 1424,
        "stop": 1972,
        "text": " traditionally in the springtime that meant for JB at least Linux Fest Northwest and"
      },
      {
        "start": 1972,
        "stop": 2460,
        "text": " Don't really look like that's gonna be happening again this year sadly and"
      },
      {
        "start": 2552,
        "stop": 3232,
        "text": " You want to get your springtime conference on don't you scale calls and it does feel like it's been a long time since we had an event to go to"
      },
      {
        "start": 3232,
        "stop": 3812,
        "text": " And there's a lot of good audience and community members that are there and it's an opportunity for the team to get together again"
      },
      {
        "start": 3812,
        "stop": 4026,
        "text": " We're still working out all the details"
      },
      {
        "start": 4026,
        "stop": 4436,
        "text": " But we wanted to get the word out kind of early because from like recording now"
      },
      {
        "start": 4436,
        "stop": 4636,
        "text": " It's like 55 days out or something"
      },
      {
        "start": 4636,
        "stop": 5412,
        "text": " It's March 10thish or something like that. That's not very long at all. No, I know I know like we really got it"
      },
      {
        "start": 5412,
        "stop": 5840,
        "text": " And it was it's been one of those things where we kind of hem and hot a little bit because like you said"
      },
      {
        "start": 5840,
        "stop": 6216,
        "text": " We were just in Pasadena like we were literally just there a few months ago"
      },
      {
        "start": 6216,
        "stop": 6612,
        "text": " And if we could pick somewhere new to go we'd rather because we want to go see"
      },
      {
        "start": 6612,
        "stop": 6852,
        "text": " Hope folks we haven't had a chance to see for a while"
      },
      {
        "start": 6852,
        "stop": 7380,
        "text": " Thankfully the crew down at scale and in the scale area is really awesome. So you know"
      },
      {
        "start": 7380,
        "stop": 8132,
        "text": " It's it's gonna be worth it. It was the end of September. We were there somehow. It's mid January already. No, I know it's wild"
      },
      {
        "start": 8132,
        "stop": 8356,
        "text": " It's and get this it's 2023 - oh"
      },
      {
        "start": 8456,
        "stop": 9184,
        "text": " Yeah, so scale takes place March 9th through the 12th at the Pasadena Convention Center in Pasadena, California"
      },
      {
        "start": 9184,
        "stop": 9492,
        "text": " There are some hotels around probably a little cheaper if you go further out"
      },
      {
        "start": 9492,
        "stop": 10100,
        "text": " But it's traditionally been a pretty great event. I don't know if we'll be there all four days because I think at least Sunday"
      },
      {
        "start": 10100,
        "stop": 10530,
        "text": " I'm gonna need to you know record like a podcast. Yeah work"
      },
      {
        "start": 10530,
        "stop": 10732,
        "text": " I"
      },
      {
        "start": 10732,
        "stop": 11340,
        "text": " Think the scale is like the North American equivalent of Fosden, isn't it? Yeah, yeah, probably"
      },
      {
        "start": 11340,
        "stop": 11836,
        "text": " Yeah, I think it's at least 5,000 people. Oh, well, it was probably you know a couple of years ago"
      },
      {
        "start": 11836,
        "stop": 12284,
        "text": " I don't know about now be interesting to see how it's recovered. You know, yeah, even in the before times"
      },
      {
        "start": 12284,
        "stop": 12736,
        "text": " You go to a conference like that and you just expect to pick up the conference crowd down you so"
      },
      {
        "start": 12736,
        "stop": 13172,
        "text": " The concrete as we call that yeah, yeah, I don't know. I don't know how much of an effect"
      },
      {
        "start": 13172,
        "stop": 13432,
        "text": " It's had or we'll have on Fosden moving forward as well"
      },
      {
        "start": 13432,
        "stop": 13860,
        "text": " Maybe one of these years we'll get you over the Europe and get you to go to Fosden"
      },
      {
        "start": 13860,
        "stop": 14128,
        "text": " I know I keep I keep pulling your chain to do that"
      },
      {
        "start": 14164,
        "stop": 14388,
        "text": " One of these days. I don't know about the winter"
      },
      {
        "start": 14388,
        "stop": 14900,
        "text": " You know, it's my only thing doesn't seem like winters time. Yeah February and February and Belgium's"
      },
      {
        "start": 14900,
        "stop": 15160,
        "text": " big rim sometimes whereas like"
      },
      {
        "start": 15160,
        "stop": 15428,
        "text": " March and Pasadena is gonna be lovely"
      },
      {
        "start": 15428,
        "stop": 16060,
        "text": " It's gonna be great. It's no contest that's always just no contest. No, it's actually for me"
      },
      {
        "start": 16060,
        "stop": 16508,
        "text": " It's like it's gonna be nice because I'll come from the Pacific Northwest where it's no no doubt kind of just grain and"
      },
      {
        "start": 16508,
        "stop": 17120,
        "text": " Drury and go down to Pasadena and enjoy the sunshine. I think the plan is we're gonna do a little bit of a"
      },
      {
        "start": 17120,
        "stop": 17720,
        "text": " community get together up in the Seattle area at North of Seattle up in the Sonomash County area"
      },
      {
        "start": 17720,
        "stop": 18016,
        "text": " Then we're gonna do some work at the studio and then"
      },
      {
        "start": 18016,
        "stop": 18616,
        "text": " Some of us are gonna drive down to Pasadena and then some of us will fly in to Pasadena"
      },
      {
        "start": 18616,
        "stop": 18804,
        "text": " It's gonna you know, who's gonna get together?"
      },
      {
        "start": 18804,
        "stop": 18960,
        "text": " We'd love to see it down there for you can make it"
      },
      {
        "start": 18960,
        "stop": 19176,
        "text": " We'll have meetups and stuff like that once we get off figured out"
      },
      {
        "start": 19176,
        "stop": 19720,
        "text": " But it's early days when we just wanted to get the word out there and I know you know coming you know month or two"
      },
      {
        "start": 19720,
        "stop": 20016,
        "text": " You know 60 days ish 50 days ish really? Let's be let's be honest"
      },
      {
        "start": 20028,
        "stop": 20572,
        "text": " You're gonna need to get out get some sunshine out because you've been going deep into Kubernetes"
      },
      {
        "start": 20572,
        "stop": 21256,
        "text": " You're gonna need a little vacay. I have this weekend. I decided I think I think I was doing some"
      },
      {
        "start": 21256,
        "stop": 21788,
        "text": " Server maintenance or something and my my server was down for a couple of hours"
      },
      {
        "start": 21788,
        "stop": 22032,
        "text": " And I'll tell you what it was and then we'll come on to this later in the show"
      },
      {
        "start": 22032,
        "stop": 22688,
        "text": " But my firewall went down so like oh yeah, and I needed to crimp a new Ethernet cable and I know I have a wiki article"
      },
      {
        "start": 22736,
        "stop": 23240,
        "text": " About you know which standard I use, but the trouble is my wiki"
      },
      {
        "start": 23240,
        "stop": 23656,
        "text": " Wasn't working because the NS was down because that's on the firewall"
      },
      {
        "start": 23656,
        "stop": 24068,
        "text": " And then so it's got me thinking about you know because I've always thought to myself"
      },
      {
        "start": 24068,
        "stop": 24320,
        "text": " Kubernetes at home is just"
      },
      {
        "start": 24320,
        "stop": 24832,
        "text": " Too much it's it's too much. I don't need it. It's busman's holiday"
      },
      {
        "start": 24832,
        "stop": 25300,
        "text": " Could do it all day every day at work. I don't need to be dealing with that complexity at home, but"
      },
      {
        "start": 25412,
        "stop": 25996,
        "text": " Actually sometimes there are some services some critical services that would benefit from being highly available"
      },
      {
        "start": 25996,
        "stop": 26420,
        "text": " DNS is probably one of them that I need to put behind maybe keep a live D"
      },
      {
        "start": 26420,
        "stop": 26860,
        "text": " But then there are some basic application services like the wiki"
      },
      {
        "start": 26860,
        "stop": 27268,
        "text": " Maybe home assistant if I can get that on Kubernetes. That'd be pretty cool"
      },
      {
        "start": 27268,
        "stop": 27516,
        "text": " Don't know about that one"
      },
      {
        "start": 27516,
        "stop": 27788,
        "text": " But certainly basic web services like a wiki"
      },
      {
        "start": 27788,
        "stop": 28332,
        "text": " Putting those on a small K3S cluster should be absolutely no problem whatsoever"
      },
      {
        "start": 28348,
        "stop": 28780,
        "text": " And so ended up going spelunking down the K3S rabbit hole this weekend"
      },
      {
        "start": 28780,
        "stop": 29260,
        "text": " So K3S can you tell me a little bit about that? I'm familiar with K8"
      },
      {
        "start": 29260,
        "stop": 29964,
        "text": " It will K8 is just Kubernetes the reason they put number eight is because there's eight characters between the K and the S"
      },
      {
        "start": 29964,
        "stop": 30420,
        "text": " If you didn't know that so what is K3 Kubernetes still but smaller"
      },
      {
        "start": 30420,
        "stop": 31140,
        "text": " It is the idea is is that Kubernetes is a small lightweight distribution of Kubernetes"
      },
      {
        "start": 31172,
        "stop": 31804,
        "text": " It trims out a lot of the more enterprising stuff that you just realistically in a small deployment do not need"
      },
      {
        "start": 31804,
        "stop": 32612,
        "text": " They pick a lower number because it's smaller and lighter weight. Yeah, I like that. Okay, so it's a little and you feel like this is"
      },
      {
        "start": 32612,
        "stop": 32884,
        "text": " probably responsible for"
      },
      {
        "start": 32884,
        "stop": 33404,
        "text": " You giving yourself permission to try this at home because I know you and I have talked about this before and both of our takeaways"
      },
      {
        "start": 33404,
        "stop": 34124,
        "text": " It's been there. It's a bit too much. This is this what's changed. Well, it was this and it was I was updating the"
      },
      {
        "start": 34124,
        "stop": 34948,
        "text": " Perfect media server website, which is hosted on the same node as cheaper to broadcasting calm and there's five or six pretty critical"
      },
      {
        "start": 34948,
        "stop": 35700,
        "text": " Websites in my life at least that are hosted on this one node and if I want to reboot it or I want to upgrade Docker or do anything on that node"
      },
      {
        "start": 35700,
        "stop": 36292,
        "text": " It can take the websites down for a minute or five depending on a reboot sometimes"
      },
      {
        "start": 36380,
        "stop": 36580,
        "text": " And so I was actually thinking about"
      },
      {
        "start": 36580,
        "stop": 36876,
        "text": " Eventually using this knowledge I gained"
      },
      {
        "start": 36876,
        "stop": 37652,
        "text": " Locally on how to host the wiki and all that kind of stuff to putting Jupiter broadcasting calm and my blog and you know all the other stuff"
      },
      {
        "start": 37652,
        "stop": 38044,
        "text": " Into a hosted Kubernetes cluster on linode"
      },
      {
        "start": 38044,
        "stop": 38756,
        "text": " And then take all of the server administration aspect out of the equation and literally just target it through something like a"
      },
      {
        "start": 38756,
        "stop": 39044,
        "text": " Flux get-ups kind of scenario"
      },
      {
        "start": 39092,
        "stop": 39956,
        "text": " Where if you are I or wears or you know, Brent or anybody on the crew pushes a small update to the website it auto deploys and there's I mean"
      },
      {
        "start": 39956,
        "stop": 40156,
        "text": " We do that through GitHub actions now"
      },
      {
        "start": 40156,
        "stop": 40876,
        "text": " But there's no high availability if that node goes down the website goes down and that's that actions as deploying the website"
      },
      {
        "start": 40876,
        "stop": 41420,
        "text": " But wouldn't necessarily deploy the infrastructure necessary to run the website. No, absolutely not so"
      },
      {
        "start": 41420,
        "stop": 42028,
        "text": " Really this is for me at the moment an academic exercise just to try and learn a bit more about"
      },
      {
        "start": 42076,
        "stop": 42988,
        "text": " Actually using Kubernetes locally because I used it at work every day for a couple of years probably about four or five years ago now"
      },
      {
        "start": 42988,
        "stop": 43668,
        "text": " Ever since then a lot of my stuff has been pretty much theoretical stuff talking to customers advising, you know"
      },
      {
        "start": 43668,
        "stop": 44260,
        "text": " But I haven't had to do a lot of actual Kubernetes hands-on stuff recently"
      },
      {
        "start": 44260,
        "stop": 44652,
        "text": " You know, I do a lot of infrastructure like this is the best practices around"
      },
      {
        "start": 44708,
        "stop": 45244,
        "text": " XCD and how you you know make the right number of I-ups all that kind of stuff for open shift"
      },
      {
        "start": 45244,
        "stop": 45860,
        "text": " But actually once the clusters up and running I kind of hand it off to someone else and it's their problem to deal with"
      },
      {
        "start": 45860,
        "stop": 46124,
        "text": " My problem is infrastructure and that kind of thing"
      },
      {
        "start": 46124,
        "stop": 46644,
        "text": " And so for me as an academic exercise to learn a bit more about the inner workings of Kubernetes and and just"
      },
      {
        "start": 46644,
        "stop": 46892,
        "text": " poke the dragon a little bit and so"
      },
      {
        "start": 46892,
        "stop": 47596,
        "text": " The first hurdle I had to overcome was how do I automate the deployment of K3S? I didn't want to be"
      },
      {
        "start": 47684,
        "stop": 48100,
        "text": " Treating this cluster like it was a you know, Faber J egg"
      },
      {
        "start": 48100,
        "stop": 48356,
        "text": " I wanted to be able to to go"
      },
      {
        "start": 48356,
        "stop": 48956,
        "text": " Duke Nukem on this thing and completely break it and rebuild it in 20 minutes and you're all out of bubblegum"
      },
      {
        "start": 48956,
        "stop": 49252,
        "text": " Indeed"
      },
      {
        "start": 49252,
        "stop": 49860,
        "text": " And so I turned to my favorite tool in such a scenario terraform you might have been thinking Ansible, but hey, it was"
      },
      {
        "start": 49860,
        "stop": 50268,
        "text": " Yeah, it's not the right tool for a beautiful infrastructure Ansible is"
      },
      {
        "start": 50420,
        "stop": 51076,
        "text": " It's more designed to configure traditional operating systems like Ubuntu or Fedora or those kinds of things"
      },
      {
        "start": 51076,
        "stop": 51452,
        "text": " Whereas I'm running this on a small read-only OS"
      },
      {
        "start": 51452,
        "stop": 51684,
        "text": " rather than"
      },
      {
        "start": 51684,
        "stop": 52156,
        "text": " Traditional kind of like cattle versus pets is what I'm trying to explain here. I'm doing a poor job"
      },
      {
        "start": 52156,
        "stop": 52356,
        "text": " But that's basically where I'm trying to go"
      },
      {
        "start": 52356,
        "stop": 52692,
        "text": " And so what I ended up doing was using a terraform provider"
      },
      {
        "start": 52692,
        "stop": 53196,
        "text": " From a chat called tellmate on github. They'll be linked to all of this stuff in the show notes"
      },
      {
        "start": 53268,
        "stop": 53564,
        "text": " And this thing is it talks to the Proxmox API"
      },
      {
        "start": 53564,
        "stop": 54156,
        "text": " Once it does that it can configure and provision different resources so it can configure virtual machines"
      },
      {
        "start": 54156,
        "stop": 54636,
        "text": " So essentially I have a template for the virtual machine that I'm deploying"
      },
      {
        "start": 54636,
        "stop": 55220,
        "text": " It will then clone that virtual machine based on the parameters I have in my terraform"
      },
      {
        "start": 55220,
        "stop": 55772,
        "text": " So it will give it a certain size of disk for a master node and a certain size of disk for a worker node or like that and stuff"
      },
      {
        "start": 55852,
        "stop": 56684,
        "text": " But where it got really interesting was I like to do static IP reservations through DHCP which might sound a little weird"
      },
      {
        "start": 56684,
        "stop": 57204,
        "text": " No, that's how I do it too. I do that MAC address based reservation stuff, right? So that's exactly how I do it"
      },
      {
        "start": 57204,
        "stop": 57644,
        "text": " All my servers my cameras, everything. Yeah, I find it works really really well for me"
      },
      {
        "start": 57644,
        "stop": 57844,
        "text": " You know has done for years"
      },
      {
        "start": 57844,
        "stop": 58276,
        "text": " I could run a real DNS server that has an API that lets me do a proper ipan"
      },
      {
        "start": 58276,
        "stop": 58516,
        "text": " IP address management stuff, but"
      },
      {
        "start": 58540,
        "stop": 59332,
        "text": " I don't I just use the built-in open sense one and so what I needed to do was configure two pieces of information"
      },
      {
        "start": 59332,
        "stop": 59876,
        "text": " One is the MAC address on a node and also the second piece is the target"
      },
      {
        "start": 59876,
        "stop": 60548,
        "text": " Proxmox node in my Proxmox cluster that I wanted to deploy this VM onto because it's no good deploying all these"
      },
      {
        "start": 60548,
        "stop": 60748,
        "text": " VMs onto a single"
      },
      {
        "start": 60748,
        "stop": 61092,
        "text": " Proxmox host because if that host goes down"
      },
      {
        "start": 61092,
        "stop": 61380,
        "text": " All of the m's go down and I'm back to square one, right?"
      },
      {
        "start": 61380,
        "stop": 61844,
        "text": " So some of my worker nodes and some of my master nodes have to be distributed so"
      },
      {
        "start": 61844,
        "stop": 62188,
        "text": " Behind me I have pulled out of the closet an old"
      },
      {
        "start": 62188,
        "stop": 62580,
        "text": " I5 system that's been gathering dust for a few years"
      },
      {
        "start": 62580,
        "stop": 62852,
        "text": " It's running a Hollywood script behind me if you're on the livestream"
      },
      {
        "start": 62852,
        "stop": 63444,
        "text": " I've also got my backup server running Proxmox and I have my main server in the basement"
      },
      {
        "start": 63444,
        "stop": 63756,
        "text": " Also running Proxmox. So I have a three node Proxmox cluster"
      },
      {
        "start": 63756,
        "stop": 64268,
        "text": " It's pretty cool. I'm not doing anything cool like live live migration or anything like that"
      },
      {
        "start": 64276,
        "stop": 64956,
        "text": " But I can from a single Proxmox UI see all of the m's in my house see all the nodes in my house and"
      },
      {
        "start": 64956,
        "stop": 65556,
        "text": " It's just it just tickles the nerd in where you know no kidding. I have to ask"
      },
      {
        "start": 65556,
        "stop": 65820,
        "text": " I mean not to rabbit hole tangent. That's here"
      },
      {
        "start": 65820,
        "stop": 66020,
        "text": " But are you doing centralized storage?"
      },
      {
        "start": 66020,
        "stop": 66524,
        "text": " Are you thinking about centralized storage? Is each one of these Proxmox servers doing local storage?"
      },
      {
        "start": 66524,
        "stop": 66628,
        "text": " What are you doing there?"
      },
      {
        "start": 66628,
        "stop": 66916,
        "text": " Storage is local to the nodes at the moment"
      },
      {
        "start": 66940,
        "stop": 67348,
        "text": " So Proxmox storage is separate from Kubernetes storage in my world"
      },
      {
        "start": 67348,
        "stop": 67852,
        "text": " I've always thought that doing Kubernetes at home was a bit silly because if you know"
      },
      {
        "start": 67852,
        "stop": 68140,
        "text": " Let's say I wanted to run jellyfain or Plex or something on"
      },
      {
        "start": 68140,
        "stop": 68684,
        "text": " Kubernetes and the node that has all the storage all the media is down"
      },
      {
        "start": 68684,
        "stop": 68868,
        "text": " Well, then so"
      },
      {
        "start": 68868,
        "stop": 69364,
        "text": " Plex because they're jellyfin because there's the media isn't there. So what's the point in running the service?"
      },
      {
        "start": 69364,
        "stop": 69764,
        "text": " And that argument has held true for almost all of my services"
      },
      {
        "start": 69764,
        "stop": 70172,
        "text": " But it was it was just that wiki thing that made me think actually there's a few things"
      },
      {
        "start": 70172,
        "stop": 70828,
        "text": " I wouldn't mind auto redeploying between different places and things like a wiki a fairly stateless so"
      },
      {
        "start": 70828,
        "stop": 71284,
        "text": " What I'm thinking of doing is using the long horn project"
      },
      {
        "start": 71284,
        "stop": 71556,
        "text": " Which is also from Rancher along with K3s"
      },
      {
        "start": 71556,
        "stop": 72012,
        "text": " to synchronize small amounts of storage around the network"
      },
      {
        "start": 72012,
        "stop": 72228,
        "text": " I'm not doing things like media files because that's just a"
      },
      {
        "start": 72228,
        "stop": 72428,
        "text": " unnecessary"
      },
      {
        "start": 72444,
        "stop": 72956,
        "text": " But a few hundred gigabytes probably not even that between different nodes using long horn"
      },
      {
        "start": 72956,
        "stop": 73452,
        "text": " And then I'll be able to bring up a pod in any of those three proxmox nodes as a VM"
      },
      {
        "start": 73452,
        "stop": 73940,
        "text": " Well, I bring up a VM on the proxmox node and then run a pod inside the VM"
      },
      {
        "start": 73940,
        "stop": 74580,
        "text": " That should work although I haven't gotten to storage yet in my in my tinkering that's for the next episode"
      },
      {
        "start": 74580,
        "stop": 75108,
        "text": " Yeah, I'd be curious to see where that goes, but it sounds like a really"
      },
      {
        "start": 75188,
        "stop": 75388,
        "text": " Like valuable project just in the sense that"
      },
      {
        "start": 75388,
        "stop": 76196,
        "text": " The skills that you're picking up here are refreshing your day job stuff sounds like it could be useful for the jb infrastructure for your own"
      },
      {
        "start": 76196,
        "stop": 76644,
        "text": " Infrastructure and man, are you making me really want to try proxmox again?"
      },
      {
        "start": 76644,
        "stop": 76972,
        "text": " I almost did it with the odroid. I almost did proxmox on there, but"
      },
      {
        "start": 76972,
        "stop": 77732,
        "text": " You know, I was I'm still in high on the next juice, so I just went you know bare metal nicks OS"
      },
      {
        "start": 77732,
        "stop": 78500,
        "text": " But you know, it's the fact that proxmox ships had a bunch of kernel and I get zfs out the box that really does it for me"
      },
      {
        "start": 78500,
        "stop": 79036,
        "text": " Yeah, that's nice. Yeah with a Debian user space really does it for me. That's a funky setup"
      },
      {
        "start": 79036,
        "stop": 79484,
        "text": " So Debian user space well, I guess that's actually kind of a bunch of pretty much"
      },
      {
        "start": 79484,
        "stop": 80100,
        "text": " So I still got access to apps for all those packages and it's it's a very familiar"
      },
      {
        "start": 80100,
        "stop": 80348,
        "text": " Landing pad for me"
      },
      {
        "start": 80348,
        "stop": 81020,
        "text": " Except I've just got this and I know I always say gooies are unnecessary. They are but I've got a nice single pane of glass gooie"
      },
      {
        "start": 81020,
        "stop": 81564,
        "text": " For all the VMs and crap running in my network. You don't need that junk for your containers"
      },
      {
        "start": 81564,
        "stop": 81844,
        "text": " Not with Terraform I don't know"
      },
      {
        "start": 81844,
        "stop": 82192,
        "text": " So just to finish the terraform thought because I don't think I quite did I"
      },
      {
        "start": 82192,
        "stop": 82984,
        "text": " Needed the two pieces of information. I needed the IP address and I need the MAC address and the target node to be deployed on"
      },
      {
        "start": 83028,
        "stop": 83540,
        "text": " And so out of the box terraform doesn't support iterating over data structures like that"
      },
      {
        "start": 83540,
        "stop": 84200,
        "text": " So some kind people in the discord help me figure out that if you use the for each command in terraform"
      },
      {
        "start": 84200,
        "stop": 84948,
        "text": " You can actually look up sub elements of nested maps in this case and bring them out and you know"
      },
      {
        "start": 84948,
        "stop": 85316,
        "text": " So so I can have you know node master one"
      },
      {
        "start": 85316,
        "stop": 85860,
        "text": " Specific Mac specific target node node master two etc etc"
      },
      {
        "start": 85884,
        "stop": 86196,
        "text": " And I can feed that stuff directly into"
      },
      {
        "start": 86196,
        "stop": 86716,
        "text": " Terraform so link in the show notes to my github or I figured all that stuff out"
      },
      {
        "start": 86716,
        "stop": 86964,
        "text": " I don't know if you'll find it useful. You might you might not"
      },
      {
        "start": 86964,
        "stop": 87396,
        "text": " But terraform's one of those tools that I think doesn't get enough love"
      },
      {
        "start": 87396,
        "stop": 88020,
        "text": " But it quietly builds the infrastructure that runs the internet. You know, it's just it's awesome"
      },
      {
        "start": 88180,
        "stop": 88772,
        "text": " Lino.com/ssh that's where you go to get a hundred dollars and 60-day credit and it's a great way to support the show"
      },
      {
        "start": 88772,
        "stop": 89068,
        "text": " While you're checking out a cloud provider that is great for our self-hosters"
      },
      {
        "start": 89068,
        "stop": 89820,
        "text": " I have a couple of different tricks that I can't believe lino'd lets me do but they've actually documented it for at least two different use cases now"
      },
      {
        "start": 89820,
        "stop": 90252,
        "text": " I have found it necessary to deploy a lino and then"
      },
      {
        "start": 90252,
        "stop": 91028,
        "text": " Destroy the operating system just get rid of the OS that's on there and deploy my own OS once for a VPN set up that I was doing that used a weird"
      },
      {
        "start": 91076,
        "stop": 91604,
        "text": " router on the other end and they have their own weird Linux and then another one is for jupyter tube"
      },
      {
        "start": 91604,
        "stop": 91908,
        "text": " Jupiter tube is a nicks box and"
      },
      {
        "start": 91908,
        "stop": 92196,
        "text": " It's I think started life as an Ubuntu box"
      },
      {
        "start": 92196,
        "stop": 92836,
        "text": " But you know, that's the kind of level of access that Lino gives you is you can change things like that now"
      },
      {
        "start": 92836,
        "stop": 93036,
        "text": " It's a nicks box and it's great"
      },
      {
        "start": 93036,
        "stop": 93532,
        "text": " It's actually makes for a really good jupyter or a peer tube server. I should say and"
      },
      {
        "start": 93532,
        "stop": 93756,
        "text": " Lino'd let's get just let's get in there like that"
      },
      {
        "start": 93756,
        "stop": 94228,
        "text": " Let's you get in there and do that kind of stuff and they've got really good documentation to help you a dashboard"
      },
      {
        "start": 94228,
        "stop": 94508,
        "text": " That makes it super approachable. So you know if you're just learning"
      },
      {
        "start": 94508,
        "stop": 94892,
        "text": " You know, they got a dashboard. You got this feel like a next level"
      },
      {
        "start": 94892,
        "stop": 95284,
        "text": " You know, you've been doing this for 20 years. They've got an API you can take advantage of of course"
      },
      {
        "start": 95284,
        "stop": 95484,
        "text": " They support infrastructure management tools"
      },
      {
        "start": 95484,
        "stop": 95868,
        "text": " In fact, I'm going to put a link to their understanding Kubernetes guide"
      },
      {
        "start": 95868,
        "stop": 96236,
        "text": " It is an instant download no email required. You just go get it"
      },
      {
        "start": 96236,
        "stop": 96500,
        "text": " It's a recently updated like towards the end of last year"
      },
      {
        "start": 96500,
        "stop": 97172,
        "text": " It's a comprehensive resource that covers everything from like fundamental concepts of Kubernetes to the individual components of a Kubernetes cluster"
      },
      {
        "start": 97172,
        "stop": 97756,
        "text": " The network model implementations and they just recently added sections on understanding the Kubernetes dashboard"
      },
      {
        "start": 97756,
        "stop": 98084,
        "text": " The high availability control plane and auto scaling"
      },
      {
        "start": 98084,
        "stop": 98436,
        "text": " Super great resource that they're giving away for free and yeah"
      },
      {
        "start": 98436,
        "stop": 98812,
        "text": " Lino'd works with all of those tools. So as you know, you're learning this stuff"
      },
      {
        "start": 98812,
        "stop": 99164,
        "text": " You can go use our $100 credit to try it and as you're deploying this stuff"
      },
      {
        "start": 99164,
        "stop": 99580,
        "text": " You'll find that Lino is fast enough and reliable that you can deploy in production for millions of users"
      },
      {
        "start": 99580,
        "stop": 100300,
        "text": " Millions of users. I mean, I can actually say that from a source of experience. We run our website on Lino"
      },
      {
        "start": 100300,
        "stop": 100596,
        "text": " We have tons of our backend JB infrastructure runs on Lino"
      },
      {
        "start": 100596,
        "stop": 101156,
        "text": " And our podcast get millions of downloads and they just keep on trucking right along. We've never had a problem"
      },
      {
        "start": 101156,
        "stop": 101516,
        "text": " And I think it's just about three years now. It's been really great"
      },
      {
        "start": 101516,
        "stop": 101916,
        "text": " And of course, we've got friends that've been using Lino for a decade and they've been around for nearly 19 years"
      },
      {
        "start": 101940,
        "stop": 102364,
        "text": " There's something you're going to love. They got data centers new you with another dozen coming online this year"
      },
      {
        "start": 102364,
        "stop": 102748,
        "text": " They are the RON ISP so the speeds are outrageous. The hardware is fantastic"
      },
      {
        "start": 102748,
        "stop": 103236,
        "text": " I rave about it because it is legitimately the best. There's lots of options out there"
      },
      {
        "start": 103236,
        "stop": 103684,
        "text": " But nobody checks all the boxes. So go grab that $100 kick the tires and try it out"
      },
      {
        "start": 103684,
        "stop": 104212,
        "text": " Lino.com/ssh. That's Lino.com/ssh"
      },
      {
        "start": 104212,
        "stop": 104572,
        "text": " But in the last episode, I was"
      },
      {
        "start": 104572,
        "stop": 105084,
        "text": " Bemoaning the fact we only had four entries for the hard drive giveaway glad to say that has changed this time"
      },
      {
        "start": 105084,
        "stop": 105308,
        "text": " We had 15 or so"
      },
      {
        "start": 105308,
        "stop": 105452,
        "text": " totals"
      },
      {
        "start": 105452,
        "stop": 105516,
        "text": " All right"
      },
      {
        "start": 105516,
        "stop": 105716,
        "text": " 17 17 total"
      },
      {
        "start": 105716,
        "stop": 105916,
        "text": " Entries into the giveaway contest"
      },
      {
        "start": 105916,
        "stop": 106324,
        "text": " There will be a link in the show notes where you can go and vote for the winner"
      },
      {
        "start": 106324,
        "stop": 106780,
        "text": " So all of the different data loss stories I asked people to send in are now on GitHub"
      },
      {
        "start": 106780,
        "stop": 107116,
        "text": " We discussed this in the discord with a few folks about how to"
      },
      {
        "start": 107148,
        "stop": 107852,
        "text": " Present this as a poll where you know, you got the text of the entry and then a voting system on the same page and"
      },
      {
        "start": 107852,
        "stop": 108252,
        "text": " Building something like this would have been a project in and of itself"
      },
      {
        "start": 108252,
        "stop": 108540,
        "text": " So we just decided to take the easy route and go with GitHub"
      },
      {
        "start": 108540,
        "stop": 109060,
        "text": " Now if you react to this or you upvote these posts somehow not comment"
      },
      {
        "start": 109060,
        "stop": 109332,
        "text": " I'm not interested in your comments or that you can make comments if you want to"
      },
      {
        "start": 109332,
        "stop": 109916,
        "text": " The winner will be picked simply by the one with the most upvotes. Oh man"
      },
      {
        "start": 110020,
        "stop": 110676,
        "text": " Oh man, oh geez, I'm reading a couple of these so basically you can go upvote the worst sob story"
      },
      {
        "start": 110676,
        "stop": 110980,
        "text": " There's some good ones in now. I do I do employ you to"
      },
      {
        "start": 110980,
        "stop": 111604,
        "text": " Doom scroll for a few of them. There are basically some lessons to be learned for sure some of these"
      },
      {
        "start": 111604,
        "stop": 112068,
        "text": " Some of these I could have seen myself myself making these mistakes"
      },
      {
        "start": 112068,
        "stop": 112500,
        "text": " Yeah, we'll put a link to this in the in the show notes. All right, so go vote go vote the worst sob story"
      },
      {
        "start": 112500,
        "stop": 112852,
        "text": " I think I know the one I have to vote for but I have to read them all first"
      },
      {
        "start": 113052,
        "stop": 113516,
        "text": " Okay, Alex. Well, I have come across something very very"
      },
      {
        "start": 113516,
        "stop": 114404,
        "text": " Very exciting. It was recommended to me by the developer of the nebula mesh VPN, which is also an awesome project"
      },
      {
        "start": 114404,
        "stop": 115196,
        "text": " And it is a custom community firmware for the wise three and wise two cameras now"
      },
      {
        "start": 115196,
        "stop": 115700,
        "text": " This is unlike anything we've talked about before we have kind of talked about custom firmwares for these wise cams before"
      },
      {
        "start": 115764,
        "stop": 116332,
        "text": " This is a whole new thing baby, and it is called wz underscore mini hacks"
      },
      {
        "start": 116332,
        "stop": 116900,
        "text": " It is an alternative entire firmware. It boots off the SD card. It doesn't touch the OS"
      },
      {
        "start": 116900,
        "stop": 117676,
        "text": " On your wise cam, so that's nice and it adds a couple of very very nice features to these again"
      },
      {
        "start": 117676,
        "stop": 117988,
        "text": " I'm gonna say it 35 dollar ip cameras"
      },
      {
        "start": 117988,
        "stop": 118260,
        "text": " First and foremost"
      },
      {
        "start": 118260,
        "stop": 118524,
        "text": " Ethernet support so you can get a USB"
      },
      {
        "start": 118596,
        "stop": 118876,
        "text": " Ethernet dongle and you can run the wise cam"
      },
      {
        "start": 118876,
        "stop": 119092,
        "text": " Over Ethernet"
      },
      {
        "start": 119092,
        "stop": 119540,
        "text": " Which is huge if you ask me and you can do specifically even POE"
      },
      {
        "start": 119540,
        "stop": 120028,
        "text": " How does that work because I just the USB connection? Yeah, so you got to get an adapter"
      },
      {
        "start": 120028,
        "stop": 120604,
        "text": " And there's several on Amazon that does that does micro USB instead of a regular like USB a"
      },
      {
        "start": 120604,
        "stop": 121132,
        "text": " But you can get dongles that have micro USB and you can plug that into the wise cam"
      },
      {
        "start": 121132,
        "stop": 121388,
        "text": " this Linux environment"
      },
      {
        "start": 121412,
        "stop": 122012,
        "text": " adds support for several different types of Ethernet adapters and some of them even support POE"
      },
      {
        "start": 122012,
        "stop": 122332,
        "text": " Alex you can do POE with the wise cams really yeah"
      },
      {
        "start": 122332,
        "stop": 122724,
        "text": " Yeah, it's huge right that's a huge change. Here's another one"
      },
      {
        "start": 122724,
        "stop": 123308,
        "text": " This firmware comes with wire guard pre-installed all you have to do is update the config with your wire guard information"
      },
      {
        "start": 123308,
        "stop": 123684,
        "text": " And it it'll do a wire guard VPN right on the camera say what"
      },
      {
        "start": 123684,
        "stop": 123956,
        "text": " Yep wire guard built right in"
      },
      {
        "start": 123956,
        "stop": 124380,
        "text": " Because it's also a Linux box you can SSH into it and upload your own binaries"
      },
      {
        "start": 124412,
        "stop": 125036,
        "text": " So for example, you could install tail scale or nebula and just run run it right on"
      },
      {
        "start": 125036,
        "stop": 125540,
        "text": " The box right on the right on the little teeny tiny camera. It has an RTSP server included"
      },
      {
        "start": 125540,
        "stop": 125852,
        "text": " It has a webcam mode you can put it in just via the config file"
      },
      {
        "start": 125852,
        "stop": 126124,
        "text": " Yes, it's a chain to it and you can put it in a webcam mode"
      },
      {
        "start": 126124,
        "stop": 126356,
        "text": " And then you could hook it up to your computer over USB"
      },
      {
        "start": 126356,
        "stop": 126780,
        "text": " It also has R TMP streaming so not only could it be an R TSP"
      },
      {
        "start": 126780,
        "stop": 127244,
        "text": " Camera feed that you could pull into different sources like VLC or software like Shinobi"
      },
      {
        "start": 127324,
        "stop": 127748,
        "text": " But it can also stream to something like YouTube live twitch"
      },
      {
        "start": 127748,
        "stop": 128108,
        "text": " Those types of things you can actually have it stream to an endpoint directly"
      },
      {
        "start": 128108,
        "stop": 128476,
        "text": " It supports sif samba so you can have it"
      },
      {
        "start": 128476,
        "stop": 129108,
        "text": " Mount a samba share and save the recordings to a samba share nfs and they've added USB mass storage"
      },
      {
        "start": 129108,
        "stop": 129516,
        "text": " Like I mentioned SSH login where you get a user land where you get a shell"
      },
      {
        "start": 129516,
        "stop": 130220,
        "text": " It's so great and uh Ryan who I learned this from tells me that he uses Ansible now to deploy his cameras"
      },
      {
        "start": 130220,
        "stop": 130772,
        "text": " So he's installed Ansible on these he got me was uh what's the catch come on there must be a catch"
      },
      {
        "start": 130772,
        "stop": 131028,
        "text": " This sounds too good to be true. You're right. You're right"
      },
      {
        "start": 131028,
        "stop": 131284,
        "text": " There is actually a bit of a catch unfortunately"
      },
      {
        "start": 131284,
        "stop": 131804,
        "text": " It seems like if you're on the absolute latest I think up-to-date version of the wise firmware"
      },
      {
        "start": 131804,
        "stop": 132060,
        "text": " This is broken and perhaps has been broken since the summer"
      },
      {
        "start": 132060,
        "stop": 132332,
        "text": " You can't boot because wise kind of goes around"
      },
      {
        "start": 132332,
        "stop": 132940,
        "text": " According to the project what happens Alex is people try the firmware on their wise camera"
      },
      {
        "start": 133004,
        "stop": 133372,
        "text": " Then they go try to get support from wise while they're running this firmware"
      },
      {
        "start": 133372,
        "stop": 133596,
        "text": " Wise discovers this firmware is a thing"
      },
      {
        "start": 133596,
        "stop": 133964,
        "text": " And then wise makes patches so that way they don't get support calls"
      },
      {
        "start": 133964,
        "stop": 134420,
        "text": " It's not like they're actively trying to crush the project. They're just trying to crush support calls"
      },
      {
        "start": 134420,
        "stop": 135004,
        "text": " So the project is put a call out asking people don't don't contact wise support when you're running the custom firmware"
      },
      {
        "start": 135004,
        "stop": 135180,
        "text": " Don't go to the vendor for that"
      },
      {
        "start": 135180,
        "stop": 135820,
        "text": " But the thing that I love about this is these 35 dollar cameras have a tremendous"
      },
      {
        "start": 135876,
        "stop": 136532,
        "text": " Tremendous sensor that has incredible night vision like you can have it even through a window looking at your backyard"
      },
      {
        "start": 136532,
        "stop": 136732,
        "text": " And it still can make things out"
      },
      {
        "start": 136732,
        "stop": 137212,
        "text": " They've just recently the firmware doesn't support this yet, but they just also wise recently"
      },
      {
        "start": 137212,
        "stop": 137868,
        "text": " updated their wise pan three camera which is outdoor and now moves around and so to be able to"
      },
      {
        "start": 137868,
        "stop": 138532,
        "text": " Own a device like that put your own firmware on there run your own stuff connected directly to your wire guard VPN"
      },
      {
        "start": 138532,
        "stop": 139332,
        "text": " Have it streamed directly RT and PRTSP to be able to SSH into it and it's 35 dollars with a crazy great sensor"
      },
      {
        "start": 139332,
        "stop": 139868,
        "text": " This to me just takes this device these devices to the next level and I have to give it a strong"
      },
      {
        "start": 139868,
        "stop": 140356,
        "text": " Recommendation and one of the things that I really like about it and again super early days in my testing"
      },
      {
        "start": 140356,
        "stop": 140612,
        "text": " But what I really liked about it"
      },
      {
        "start": 140612,
        "stop": 140916,
        "text": " Is everything is configured through a single config file?"
      },
      {
        "start": 140916,
        "stop": 141276,
        "text": " So you basically you do a get check out you know you pull down the repo"
      },
      {
        "start": 141276,
        "stop": 141700,
        "text": " Okay, so I'm running next OS on my camera. That's what's happening right? No, it's not niggs"
      },
      {
        "start": 141700,
        "stop": 142308,
        "text": " You put you you pull down the repo. It's got the SD card stuff that you drop on there"
      },
      {
        "start": 142308,
        "stop": 142628,
        "text": " It's got the config file. It's really simple. It's well documented"
      },
      {
        "start": 142628,
        "stop": 142932,
        "text": " You just tweak the default settings as you like turn out what you want turn off"
      },
      {
        "start": 142932,
        "stop": 143268,
        "text": " Which you don't and everything is controlled through that single config file"
      },
      {
        "start": 143268,
        "stop": 143820,
        "text": " And that's it and then you boot it up. It'll get a DHCP address you're after the races"
      },
      {
        "start": 143820,
        "stop": 144052,
        "text": " It turns out I have a wise three camera"
      },
      {
        "start": 144068,
        "stop": 144748,
        "text": " Literally behind my monitor here so I can check on the baby when she's running around making mayhem it in this bonus room"
      },
      {
        "start": 144748,
        "stop": 144852,
        "text": " I mean"
      },
      {
        "start": 144852,
        "stop": 145044,
        "text": " I've just grabbed a micro SD card"
      },
      {
        "start": 145044,
        "stop": 145508,
        "text": " So I might be doing that whilst we're recording the rest of the show. This is very exciting Chris and very exciting"
      },
      {
        "start": 145508,
        "stop": 146156,
        "text": " I think the other gotcha is I think it requires a minimum of a 256 gigabyte SD card because there is a whole OS on there"
      },
      {
        "start": 146156,
        "stop": 146804,
        "text": " 256 gig yes, but the upside is you get like all of these external storage options"
      },
      {
        "start": 146844,
        "stop": 147516,
        "text": " 256 meg come on read no really. Yeah. Okay. So what it says I just translated that to gigs in my head"
      },
      {
        "start": 147516,
        "stop": 147972,
        "text": " I say gigabytes in my car SD that's crazy. I mean not really think about it"
      },
      {
        "start": 147972,
        "stop": 148372,
        "text": " They got a whole Linux OS on there. They got all these different service offers on there"
      },
      {
        "start": 148372,
        "stop": 148524,
        "text": " I mean yeah, you're right. It's still a lot"
      },
      {
        "start": 148524,
        "stop": 148772,
        "text": " It's impressive that it is actually only 256 makes"
      },
      {
        "start": 148772,
        "stop": 149276,
        "text": " But for me the the breakthrough thing that's gonna be a game changer from I set up here hands down"
      },
      {
        "start": 149276,
        "stop": 149404,
        "text": " Ethernet support"
      },
      {
        "start": 149404,
        "stop": 149956,
        "text": " I don't use Ethernet a lot in the RV, but the one spot I absolutely will with PoE is the dash cam"
      },
      {
        "start": 149956,
        "stop": 150460,
        "text": " Because that the only thing that makes that thing kind of suck the wise suck as a dash cam is when you're going down the road"
      },
      {
        "start": 150460,
        "stop": 150876,
        "text": " You have all this you could just have all this crazy Wi-Fi interference"
      },
      {
        "start": 150876,
        "stop": 151380,
        "text": " And so I can drop frames just randomly regardless of what's going on really with any of the hardware"
      },
      {
        "start": 151380,
        "stop": 151676,
        "text": " Just by external random radio interference"
      },
      {
        "start": 151676,
        "stop": 152044,
        "text": " So to just get that off of Wi-Fi altogether and to get that data load"
      },
      {
        "start": 152044,
        "stop": 152500,
        "text": " Which is streaming video constantly as I'm driving and get that under the Ethernet"
      },
      {
        "start": 152500,
        "stop": 153220,
        "text": " Game changer freaking game changer. That is the worst thing about the wise cams today. Anyway has been that they've been"
      },
      {
        "start": 153220,
        "stop": 153916,
        "text": " Wi-Fi limited, you know, and I've had some Wi-Fi issues going on in this house this week actually"
      },
      {
        "start": 153916,
        "stop": 154436,
        "text": " When I was screwing around with the other fruit display, which if you're on the last dream you can see behind me"
      },
      {
        "start": 154436,
        "stop": 154692,
        "text": " That device only supported 2.4 gigahertz"
      },
      {
        "start": 154700,
        "stop": 155108,
        "text": " So I just switched my IoT network into 2.4 only mode"
      },
      {
        "start": 155108,
        "stop": 155860,
        "text": " My goodness me so many devices on a 2.4 gig network. You forget how quickly that thing gets congested"
      },
      {
        "start": 155860,
        "stop": 156652,
        "text": " I had sonof stop working Shelley stop working Google displays stuff has been reliable now for two or three years"
      },
      {
        "start": 156652,
        "stop": 157204,
        "text": " Just the bed completely. I flipped the five gig switch back on last night because I'd forgotten"
      },
      {
        "start": 157204,
        "stop": 157724,
        "text": " Turned it off. I was like oh, that's what you did your plonca, you know"
      },
      {
        "start": 157724,
        "stop": 158236,
        "text": " Yeah, you know, I've been doing channel analysis and stuff like that haven't gotten the sdr thing yet, but I want to"
      },
      {
        "start": 158236,
        "stop": 158804,
        "text": " And of course like all of the neighbors are all stacked on a few some of the channels and it's just so gross"
      },
      {
        "start": 158804,
        "stop": 159444,
        "text": " The setup is that it's so congested and that's why I've I've kind of slowed my excitement a little bit about matter"
      },
      {
        "start": 159444,
        "stop": 160004,
        "text": " Is it's 2.4 gigahertz as well. It's different channels, right? It's different frequencies"
      },
      {
        "start": 160060,
        "stop": 160332,
        "text": " So they're not overlapping with Wi-Fi and stuff, but I"
      },
      {
        "start": 160332,
        "stop": 161236,
        "text": " Impositive that if you have your home assistant device with your matter radio sitting right next to your Wi-Fi access point"
      },
      {
        "start": 161236,
        "stop": 161676,
        "text": " It will absolutely cause issues. Just like it does right now is Zigbee"
      },
      {
        "start": 161676,
        "stop": 162084,
        "text": " The issue is is there's sometimes people have all that stuff crammed in one spot"
      },
      {
        "start": 162084,
        "stop": 162636,
        "text": " You know, they have like a little electronics cabinet or electronic shelf or whatever and they put all that stuff in one space and"
      },
      {
        "start": 162676,
        "stop": 163220,
        "text": " 2.4 is just so slammed so to have ethernet man. Oh, yeah, I'm excited about that"
      },
      {
        "start": 163220,
        "stop": 163700,
        "text": " So that is the downside is with the firmware stuff. They haven't fixed it with the most latest firmware"
      },
      {
        "start": 163700,
        "stop": 164252,
        "text": " That little disclaimer aside. I think you're gonna love it guys. I am literally doing it right now. Oh, yeah"
      },
      {
        "start": 164252,
        "stop": 164868,
        "text": " Yeah, it looks really easy like you just copy the root of the SD card into the best decard directory"
      },
      {
        "start": 164868,
        "stop": 165452,
        "text": " Yep, and then boot it up and then boot the camera. I mean, I remember the fang stuff was right pain to do back in the day"
      },
      {
        "start": 165452,
        "stop": 165964,
        "text": " This looks really easy and if like you sounds like you do like I do I already have"
      },
      {
        "start": 165964,
        "stop": 166684,
        "text": " The MAC address reserved for an IP so I know what IP it's gonna get when it boots already and I already have it assigned a domain name"
      },
      {
        "start": 166684,
        "stop": 167324,
        "text": " It's just choice. It's really super easy when you have that all in place. I am running into the issue that I wear Mac OS"
      },
      {
        "start": 167324,
        "stop": 167532,
        "text": " at the moment"
      },
      {
        "start": 167532,
        "stop": 167844,
        "text": " These SD cards we used in Raspberry Pi's previously and"
      },
      {
        "start": 167916,
        "stop": 168524,
        "text": " Currently the partition table is it's picking up the first partition which is the boot partition"
      },
      {
        "start": 168524,
        "stop": 168924,
        "text": " Which is 32 megabytes on a 16 gig SD card"
      },
      {
        "start": 168924,
        "stop": 169492,
        "text": " I think the ones the whole thing is fat 32 or something. There's one big fat 32"
      },
      {
        "start": 169492,
        "stop": 169892,
        "text": " Alex scuba wrote in in regards to project donations"
      },
      {
        "start": 169892,
        "stop": 170332,
        "text": " I think inspired by our chatter on the matrix projects saying they were struggling with funding"
      },
      {
        "start": 170332,
        "stop": 170900,
        "text": " Really frustrating too by the way after we did that episode tech crunch ran a feature piece on"
      },
      {
        "start": 170916,
        "stop": 171412,
        "text": " matrix and they end of the article talking about how much money they have they totally missed"
      },
      {
        "start": 171412,
        "stop": 171844,
        "text": " The financial troubles that the matrix foundation is having it was embarrassing for tech crunch"
      },
      {
        "start": 171844,
        "stop": 172348,
        "text": " But scuba wrote I wrote out I reached out to the foundation for us individual supporters here"
      },
      {
        "start": 172348,
        "stop": 172548,
        "text": " How they here's how they claim we should support them"
      },
      {
        "start": 172548,
        "stop": 172892,
        "text": " Quote, thanks for reaching out and supporting matrix"
      },
      {
        "start": 172892,
        "stop": 173772,
        "text": " The best way to donate is through our donor box campaign at donor box.org/keep-matrix"
      },
      {
        "start": 173820,
        "stop": 174020,
        "text": " Dash exciting"
      },
      {
        "start": 174020,
        "stop": 174148,
        "text": " Thanks again"
      },
      {
        "start": 174148,
        "stop": 174268,
        "text": " Lisa"
      },
      {
        "start": 174268,
        "stop": 174764,
        "text": " That's their answer. What I was thinking last time we recorded what could we do as a network?"
      },
      {
        "start": 174764,
        "stop": 175364,
        "text": " We've been using the heck out of matrix this year and it's a super duper important to"
      },
      {
        "start": 175364,
        "stop": 175564,
        "text": " AUG for the future of the web to have"
      },
      {
        "start": 175564,
        "stop": 176236,
        "text": " You know a chat system that isn't beholden like discord to whatever discord do next year or slack or"
      },
      {
        "start": 176236,
        "stop": 176628,
        "text": " Microsoft teams I hate to even say it but it's the thing"
      },
      {
        "start": 176700,
        "stop": 176900,
        "text": " You know and"
      },
      {
        "start": 176900,
        "stop": 177604,
        "text": " Their businesses they have bottom lines. They have some of them shareholders that have to keep happy and those motives are"
      },
      {
        "start": 177604,
        "stop": 178340,
        "text": " Going to be at best orthogonal to what we want from it which is a simple"
      },
      {
        "start": 178340,
        "stop": 178748,
        "text": " permanently available forever more kind of open chat system"
      },
      {
        "start": 178748,
        "stop": 178972,
        "text": " And on top of that"
      },
      {
        "start": 178972,
        "stop": 179084,
        "text": " self-hostable"
      },
      {
        "start": 179084,
        "stop": 179204,
        "text": " Right"
      },
      {
        "start": 179204,
        "stop": 179724,
        "text": " And I know we still use a discord, but we do also have for the last six months or so a"
      },
      {
        "start": 179724,
        "stop": 179964,
        "text": " Self-hosted matrix space"
      },
      {
        "start": 179964,
        "stop": 180556,
        "text": " So if you want to go over there go find us. It's part of the cheaper to broadcasting overall space. It's in there. I'm in there"
      },
      {
        "start": 180556,
        "stop": 181060,
        "text": " At Alex Katie's Ed. I think or ironic badger. I forget one of the two"
      },
      {
        "start": 181060,
        "stop": 181508,
        "text": " Yeah, do you put a broadcast in dot com slash matrix for easy links and stuff exactly"
      },
      {
        "start": 181508,
        "stop": 181844,
        "text": " What I was gonna say though was in 2022 we"
      },
      {
        "start": 181908,
        "stop": 182484,
        "text": " Generated about a thousand dollars worth of affiliate revenue from cloud free dot shop and my local bytes"
      },
      {
        "start": 182484,
        "stop": 183116,
        "text": " The two self-hosting companies. I actually found out the cloud free dot shop guy is now full-time"
      },
      {
        "start": 183116,
        "stop": 183660,
        "text": " Running that shop is quit his day job. That's great. He's now running that website at full time"
      },
      {
        "start": 183660,
        "stop": 183812,
        "text": " So hats off to him"
      },
      {
        "start": 183812,
        "stop": 184412,
        "text": " But I was thinking we could split this pool of money 50/50 between a couple of our favorite open-source projects"
      },
      {
        "start": 184412,
        "stop": 184780,
        "text": " Give 50% to matrix and 50% to maybe jellyfin"
      },
      {
        "start": 184788,
        "stop": 185404,
        "text": " You know what's funny. I was thinking jellyfin - I was like because you know, I have a Plex pass a lifetime Plex pass and I thought"
      },
      {
        "start": 185404,
        "stop": 185836,
        "text": " Well, if I'm gonna actually switch over to using jellyfin, which we're gonna talk about in a little bit. I thought"
      },
      {
        "start": 185836,
        "stop": 186140,
        "text": " I better make sure they're gonna stick around"
      },
      {
        "start": 186140,
        "stop": 186660,
        "text": " Well, the reason I was thinking matrix is because they were pleading policy just last week. So yeah, I like that too"
      },
      {
        "start": 186660,
        "stop": 187228,
        "text": " Yeah, I don't my issue is I don't feel like patreon is appropriate for what you and I want to do"
      },
      {
        "start": 187228,
        "stop": 187572,
        "text": " They also have an update at their patreon page and their goals are super out of date on there"
      },
      {
        "start": 187572,
        "stop": 187804,
        "text": " They look like they've reached all their goals if you go by what they have on there"
      },
      {
        "start": 187804,
        "stop": 188100,
        "text": " I don't feel like patreon is the appropriate platform for a decentralized"
      },
      {
        "start": 188100,
        "stop": 188844,
        "text": " System like matrix either. I have issues with that and donorbox.org. I haven't seen this anywhere on their site"
      },
      {
        "start": 188844,
        "stop": 189188,
        "text": " I haven't seen I haven't heard anything about this and I've been following matrix pretty closely"
      },
      {
        "start": 189188,
        "stop": 189764,
        "text": " I'm just not comfortable with these options either. So I don't know. Maybe donor boxes. We're checking out"
      },
      {
        "start": 189764,
        "stop": 190204,
        "text": " I'll give that a look because I agree matrix is also another one of these critical ones that we should be supporting"
      },
      {
        "start": 190324,
        "stop": 190948,
        "text": " So a huge thank you to the audience really, you know, every time you buy something from one of those two shops and use the coupon code self-hosted"
      },
      {
        "start": 190948,
        "stop": 191604,
        "text": " You are inadvertently supporting open source software. You didn't know it at the time, but that's what we're gonna do with the revenue"
      },
      {
        "start": 191604,
        "stop": 191964,
        "text": " So it's you know what if these uh, turds we get on the lightning network"
      },
      {
        "start": 191964,
        "stop": 192100,
        "text": " I'd put them in for our boo splits"
      },
      {
        "start": 192100,
        "stop": 192588,
        "text": " I've put in several projects and lumps splits that we talk about and you know, there's a couple hundred bucks"
      },
      {
        "start": 192588,
        "stop": 192988,
        "text": " For being in there. That's not nothing. Um, bad. Ah"
      },
      {
        "start": 193084,
        "stop": 193524,
        "text": " Why don't we talk about jellyfin because it is jellyfin January after all and we've got people that are"
      },
      {
        "start": 193524,
        "stop": 194132,
        "text": " Also trying out jellyfin right along with us. A bunch of people have jumped in. We're halfway through. How's it going for you?"
      },
      {
        "start": 194132,
        "stop": 194332,
        "text": " We talked about it a little bit in lap on Sunday"
      },
      {
        "start": 194332,
        "stop": 194964,
        "text": " 492 link in the show notes. How's it going for you today? You know in a way it just got interesting"
      },
      {
        "start": 194964,
        "stop": 195436,
        "text": " Couple of days ago for me because when we first started"
      },
      {
        "start": 195436,
        "stop": 195980,
        "text": " I couldn't get my hands on the Swift Finn native jellyfin at for Apple TV. So I stuck with infuse"
      },
      {
        "start": 196084,
        "stop": 196524,
        "text": " But I as soon as it came out as soon as I realized it was out. I"
      },
      {
        "start": 196524,
        "stop": 197212,
        "text": " installed it that evening and I made the switch to Swift Finn which is their brand new iOS"
      },
      {
        "start": 197212,
        "stop": 197468,
        "text": " Jellyfin client that as you might"
      },
      {
        "start": 197468,
        "stop": 197900,
        "text": " Yes, is based on Swift their Apple's programming language"
      },
      {
        "start": 197900,
        "stop": 198388,
        "text": " Boy, I have a I have a lot of thoughts. It's very it's very early"
      },
      {
        "start": 198388,
        "stop": 198964,
        "text": " It's very much a beta and I'd say it's probably an MVP a minimum viable product at that"
      },
      {
        "start": 198964,
        "stop": 199484,
        "text": " But it does support live TV, which I was happy to see the way I would initially describe it as fast"
      },
      {
        "start": 199484,
        "stop": 199676,
        "text": " launches"
      },
      {
        "start": 199676,
        "stop": 199828,
        "text": " instantaneously"
      },
      {
        "start": 199828,
        "stop": 200148,
        "text": " Shows all my libraries what I was previously watching"
      },
      {
        "start": 200148,
        "stop": 200740,
        "text": " By the time it's on the screen which is instantaneously and then the other thing that blew me away"
      },
      {
        "start": 200740,
        "stop": 201004,
        "text": " Was just how"
      },
      {
        "start": 201004,
        "stop": 201532,
        "text": " Frickin amazing the scrub fast forward rewind is like I"
      },
      {
        "start": 201572,
        "stop": 202328,
        "text": " Would swear that file was on the SSD of the Apple TV. It was unbelievable. I've never had performance like that from jellyfin"
      },
      {
        "start": 202328,
        "stop": 202804,
        "text": " It was top notch and of course it was important because still no skip intro and"
      },
      {
        "start": 202804,
        "stop": 203164,
        "text": " Alex we could not have picked a more"
      },
      {
        "start": 203164,
        "stop": 203508,
        "text": " Trying time to do this jellyfin challenge because"
      },
      {
        "start": 203508,
        "stop": 204156,
        "text": " You see on a personal moral level. I refuse to watch the enterprise intro more than three times and"
      },
      {
        "start": 204212,
        "stop": 204728,
        "text": " I'm in the middle of season three enterprise and so I'm like having to like precision fast forward and"
      },
      {
        "start": 204728,
        "stop": 205196,
        "text": " Thankfully Swiftfin is much better at that than"
      },
      {
        "start": 205196,
        "stop": 205596,
        "text": " Infuse was is and surprised the one with"
      },
      {
        "start": 205596,
        "stop": 206220,
        "text": " But we watched in Trasadina by wolf no, that's that's the next generation. Oh enterprise"
      },
      {
        "start": 206220,
        "stop": 206424,
        "text": " Is that the old really old one then?"
      },
      {
        "start": 206424,
        "stop": 206624,
        "text": " Enterprises yeah, basically they did"
      },
      {
        "start": 206624,
        "stop": 207164,
        "text": " You know sequel or a prequel. I should say they did a prequel style with enterprise where they went"
      },
      {
        "start": 207212,
        "stop": 207412,
        "text": " 100 years before Kirk"
      },
      {
        "start": 207412,
        "stop": 207972,
        "text": " It's it comes later in the Star Trek franchise in terms of like air date right? It's early 2000s"
      },
      {
        "start": 207972,
        "stop": 208140,
        "text": " but"
      },
      {
        "start": 208140,
        "stop": 208524,
        "text": " They time it earlier in the Star Trek universe and they went for a rod steward"
      },
      {
        "start": 208524,
        "stop": 209024,
        "text": " Rocky intro instead of you know you remember like in Star Trek the next generation. It's that"
      },
      {
        "start": 209024,
        "stop": 210112,
        "text": " Yeah, right but in enterprise it's more of a"
      },
      {
        "start": 210112,
        "stop": 210312,
        "text": " It's been a long time"
      },
      {
        "start": 210312,
        "stop": 210684,
        "text": " written from here"
      },
      {
        "start": 210684,
        "stop": 211128,
        "text": " And he's like no, no, no the no skipping intro. It's it's a hard rule"
      },
      {
        "start": 211128,
        "stop": 211672,
        "text": " We have to skip that intro. So we've been doing the fast forward. It's working. I'm really really hoping they integrate"
      },
      {
        "start": 211672,
        "stop": 212184,
        "text": " It's intro skipping into the actual native client when it's ready. I should clarify"
      },
      {
        "start": 212184,
        "stop": 212688,
        "text": " We have no question in the chat. I thought there was a plug-in for jellyfin and"
      },
      {
        "start": 212744,
        "stop": 213416,
        "text": " Interest skipping already and does that not work for you? I've gotten so there is a there is one there's a couple actually"
      },
      {
        "start": 213416,
        "stop": 213728,
        "text": " But the most the most popular one is the one I have installed and"
      },
      {
        "start": 213728,
        "stop": 214416,
        "text": " It will work if you're using the web UI you can even install a modified web UI that will give you a button like you have on Plex and"
      },
      {
        "start": 214416,
        "stop": 215140,
        "text": " You should be able to skip intros on the set top clients when you turn on server-side"
      },
      {
        "start": 215140,
        "stop": 215516,
        "text": " Skipping this plug-in allows for server-side skipping which is awesome"
      },
      {
        "start": 215536,
        "stop": 216044,
        "text": " It's but it's also a hard switch you have it's all intros are skipped and it happens the service"
      },
      {
        "start": 216044,
        "stop": 216308,
        "text": " It just forwards the client the amount of time of the intro"
      },
      {
        "start": 216308,
        "stop": 216572,
        "text": " No interaction required"
      },
      {
        "start": 216572,
        "stop": 217004,
        "text": " That word for last time I deployed jellyfin using the Linux server IO container"
      },
      {
        "start": 217004,
        "stop": 217452,
        "text": " I'm using the upstream jellyfin container this time with their upstream Docker compose and"
      },
      {
        "start": 217452,
        "stop": 217968,
        "text": " Doesn't work. I don't know why nothing else is different. I can skip intro in the web player"
      },
      {
        "start": 217968,
        "stop": 218480,
        "text": " But I cannot skip it does not skip intros for me on any of the set dot pucks box players"
      },
      {
        "start": 218496,
        "stop": 218952,
        "text": " So I have a little cry every night, but outside of that the jellyfin client was good if not rough"
      },
      {
        "start": 218952,
        "stop": 219448,
        "text": " Like I have videos in there. They're like YouTube downloads that don't have the appropriate metadata"
      },
      {
        "start": 219448,
        "stop": 219976,
        "text": " And it just totally doesn't know how to display those it looks like a mess"
      },
      {
        "start": 219976,
        "stop": 220900,
        "text": " Well neither does it's Plex to be fair if we're comparing apples to oranges, but I think if you're a developer for jellyfin"
      },
      {
        "start": 220900,
        "stop": 221416,
        "text": " That's that's probably the only real hurdle that we found so far this month that's been I"
      },
      {
        "start": 221452,
        "stop": 221764,
        "text": " Don't want to say unsolvable because that you know got the server side thing"
      },
      {
        "start": 221764,
        "stop": 222452,
        "text": " But just the way Plex does it with the audio fingerprinting and the little button that pops up in all the clients"
      },
      {
        "start": 222452,
        "stop": 223672,
        "text": " It's that's the way it should be it's huge. I'd love to see a similar option for skip credits to because we've just started watching a Netflix series with the the kiddo called puffin rock and"
      },
      {
        "start": 223672,
        "stop": 224136,
        "text": " You know, it's just little puffins flying around which she likes watching the pictures"
      },
      {
        "start": 224176,
        "stop": 224708,
        "text": " But the credits on Netflix. I don't know if you've answered if you've ever actually watched a real Netflix show"
      },
      {
        "start": 224708,
        "stop": 225288,
        "text": " At the end of the credits that you only see about five or ten seconds and it takes you straight to the next episode"
      },
      {
        "start": 225288,
        "stop": 225884,
        "text": " But at the end of those credits is just like 30 seconds of black and white boring text silence"
      },
      {
        "start": 225884,
        "stop": 226336,
        "text": " So what I'd love to see would be not only an intro skip but also a credit skip somehow"
      },
      {
        "start": 226336,
        "stop": 226516,
        "text": " I don't know if I don't know if that would be possible"
      },
      {
        "start": 226516,
        "stop": 226996,
        "text": " But yeah, we're just forwarding to the next one, you know, ten seconds into the credits or something with a countdown"
      },
      {
        "start": 227032,
        "stop": 227368,
        "text": " So is the automatic intro skipping server side working for you?"
      },
      {
        "start": 227368,
        "stop": 227880,
        "text": " I haven't actually tried it yet because I haven't been watching any shows where that's a big problem"
      },
      {
        "start": 227880,
        "stop": 228252,
        "text": " We've got a bunch of booths about the jellyfin challenge"
      },
      {
        "start": 228252,
        "stop": 228660,
        "text": " So I thought I'd throw them in here on co-boosted in with 22,222 sets"
      },
      {
        "start": 228660,
        "stop": 229224,
        "text": " Since gents, I wanted to call out a handy app called jelly plex watched to have one GitHub"
      },
      {
        "start": 229224,
        "stop": 229596,
        "text": " And it lets you sink your plex and jellyfin watch history to each other"
      },
      {
        "start": 229596,
        "stop": 230332,
        "text": " I've been using it as I run both media servers alongside each other hopefully useful as you take the plunge into jellyfin this month keep up the amazing work"
      },
      {
        "start": 230332,
        "stop": 230856,
        "text": " On thank you. I've been thinking about I have a plex server that I maintain for family"
      },
      {
        "start": 230856,
        "stop": 231156,
        "text": " And I've been thinking depending on how this challenge goes"
      },
      {
        "start": 231156,
        "stop": 231260,
        "text": " I"
      },
      {
        "start": 231260,
        "stop": 232136,
        "text": " Might move that over to jellyfin as well. They have like so many shows and movies and stuff, you know years"
      },
      {
        "start": 232136,
        "stop": 232664,
        "text": " It's a multi-year plex so it's like I got to I got to think all that watch to whatever I move them to"
      },
      {
        "start": 232664,
        "stop": 233224,
        "text": " I know there's a couple scripts that do it, but use a server admin now, you know the benefit of that is that you can"
      },
      {
        "start": 233224,
        "stop": 233548,
        "text": " You can enable on a per profile basis"
      },
      {
        "start": 233548,
        "stop": 234352,
        "text": " The video quality that that person receives so you can guarantee that they'll always transcode or that they'll never transcode"
      },
      {
        "start": 234352,
        "stop": 235020,
        "text": " If that's what you prefer that is that is really nice and that is for me one of the absolute killer differences between"
      },
      {
        "start": 235084,
        "stop": 235496,
        "text": " plex and jellyfin jellyfin jellyfin a shrooms that I know what I want"
      },
      {
        "start": 235496,
        "stop": 236008,
        "text": " And plex is almost like the app love the space like here are some decisions we've taken"
      },
      {
        "start": 236008,
        "stop": 236676,
        "text": " You will like them and this is the way it's going to be whereas jellyfin is a lot more like Linux in a lot of ways like it's"
      },
      {
        "start": 236676,
        "stop": 237100,
        "text": " for the most part it works pretty well, but if you want to get under the hood and tinker and"
      },
      {
        "start": 237100,
        "stop": 237532,
        "text": " For me, I've been on perfect media server"
      },
      {
        "start": 237568,
        "stop": 238128,
        "text": " Dot com I've had plex as my number one app for the last I don't know two years since I launched the site"
      },
      {
        "start": 238128,
        "stop": 238800,
        "text": " This week I put jellyfin as my number one. I am absolutely you think it's sticking. I love it dude"
      },
      {
        "start": 238800,
        "stop": 239264,
        "text": " It's just so fast and responsive and the only thing is though"
      },
      {
        "start": 239264,
        "stop": 240052,
        "text": " Neither one of us have traveled while we have Jai Fin tails. I mean for me tail scale will solve that problem"
      },
      {
        "start": 240052,
        "stop": 240372,
        "text": " But what about when you want to watch it like on a like a hotel?"
      },
      {
        "start": 240424,
        "stop": 241072,
        "text": " set top box like the thing is this is what I've come to before is I've been in hotel rooms"
      },
      {
        "start": 241072,
        "stop": 241396,
        "text": " They just have plex apps installed a lot of times or you know you go to an Airbnb"
      },
      {
        "start": 241396,
        "stop": 241884,
        "text": " They have a smart television that has a plex app and you know you and I check sometimes we go to these they don't have jellyfin apps"
      },
      {
        "start": 241884,
        "stop": 242468,
        "text": " Yeah, you have a point so there's just there's that complication that could make it a little so we have to keep this challenge going until March"
      },
      {
        "start": 242468,
        "stop": 243272,
        "text": " Baby Eric boosted with 6,789 sets. I'm excited for the jellyfin challenge"
      },
      {
        "start": 243272,
        "stop": 243748,
        "text": " I'm using jellyfin on my little Intel NUC server via Docker it performs really well last week"
      },
      {
        "start": 243748,
        "stop": 244288,
        "text": " I put Cody on a Raspberry Pi Model 300 to my TV next to my treadmill so I can watch my local media while I'm"
      },
      {
        "start": 244288,
        "stop": 245036,
        "text": " Exercising keep up the great work. That's it. That's a fascinating little setup. I kind of almost wonder if jellyfin is a little more resource hungry than plex"
      },
      {
        "start": 245036,
        "stop": 245360,
        "text": " Potentially, but I'm also just a dot net"
      },
      {
        "start": 245360,
        "stop": 245940,
        "text": " Conspiracy theorist so could just be that my dot net bias is showing no point"
      },
      {
        "start": 245940,
        "stop": 246522,
        "text": " Switching until we're all done with the challenge. She says fair enough. We'll try it so you don't have to and rustic cast of"
      },
      {
        "start": 246522,
        "stop": 246752,
        "text": " Versus says that he's been using jellyfin for years"
      },
      {
        "start": 246752,
        "stop": 247296,
        "text": " But he thinks part of the reason why it stuck is because he's never used plex prior and West feels the same way"
      },
      {
        "start": 247296,
        "stop": 247544,
        "text": " We were Alex joined us on Linux unplugged this week"
      },
      {
        "start": 247544,
        "stop": 247992,
        "text": " And we talked a little bit about the challenge over there, you know like West never had intro skipping"
      },
      {
        "start": 247992,
        "stop": 248356,
        "text": " So he doesn't miss it. Mm-hmm. You never got hooked on the good sauce"
      },
      {
        "start": 248356,
        "stop": 248460,
        "text": " So"
      },
      {
        "start": 248460,
        "stop": 249020,
        "text": " He also says rustic says that infuse has rocked it was really the game changer that let them switch to jellyfin"
      },
      {
        "start": 249020,
        "stop": 249616,
        "text": " So I agree honestly, I think at the end of the challenge. I'll probably go back to infuse if I stick with jellyfin"
      },
      {
        "start": 249616,
        "stop": 249892,
        "text": " It's just a more mature"
      },
      {
        "start": 249892,
        "stop": 250400,
        "text": " Video player and it's been around for years, you know, and it's been refined. It is up"
      },
      {
        "start": 250400,
        "stop": 250600,
        "text": " There is a yearly subscription cost though"
      },
      {
        "start": 250600,
        "stop": 250932,
        "text": " So I could see Swift Fin eventually. Well, that's it. That's just it isn't it"
      },
      {
        "start": 250932,
        "stop": 251560,
        "text": " It's a pretty exciting time to be looking into this stuff with Swift Fin coming out and mm-hmm all of the all the service"
      },
      {
        "start": 251560,
        "stop": 252040,
        "text": " I changed as they've made in the last year plus since we last properly checked it out"
      },
      {
        "start": 252040,
        "stop": 252468,
        "text": " It's the perfect timing for me because you know, I do have a shield still"
      },
      {
        "start": 252468,
        "stop": 252956,
        "text": " I used to be all shields everywhere and I've slowly been moving over Apple TV's because I just think they're"
      },
      {
        "start": 252956,
        "stop": 253176,
        "text": " Well, I just think they're better boxes"
      },
      {
        "start": 253176,
        "stop": 253468,
        "text": " So it's like if we'd done this a month ago"
      },
      {
        "start": 253468,
        "stop": 253716,
        "text": " I wouldn't have this but now you're not an iOS guy anymore"
      },
      {
        "start": 253716,
        "stop": 254088,
        "text": " Doesn't that does that not change the equation some it does stink a little bit?"
      },
      {
        "start": 254088,
        "stop": 254660,
        "text": " But you know what I've done to make up for like all the nice integrated controls of the Apple TV with iOS is"
      },
      {
        "start": 254660,
        "stop": 254972,
        "text": " I have a home assistant media playback widget on"
      },
      {
        "start": 254972,
        "stop": 255472,
        "text": " Like my second Android screen and that controls the Apple TV"
      },
      {
        "start": 255472,
        "stop": 255708,
        "text": " So I have essentially"
      },
      {
        "start": 255708,
        "stop": 256100,
        "text": " Right there on my phone playback controls for the Apple TV like I had on iOS"
      },
      {
        "start": 256100,
        "stop": 256508,
        "text": " I can't do like airplane stuff and it doesn't do Chromecast obviously"
      },
      {
        "start": 256540,
        "stop": 257024,
        "text": " But using home assistant as the intermediary I can send stuff from my Android phone"
      },
      {
        "start": 257024,
        "stop": 257572,
        "text": " To the Apple TV and I can control playback. So that's pretty great. That is so cool"
      },
      {
        "start": 257572,
        "stop": 258088,
        "text": " I mean I remember in the very early days of Cody there was an app called I think it was Yazzi"
      },
      {
        "start": 258088,
        "stop": 258540,
        "text": " YATSE that you could do a similar thing with Cody and"
      },
      {
        "start": 258540,
        "stop": 258800,
        "text": " OZX BMC I suppose back in those days"
      },
      {
        "start": 258800,
        "stop": 259468,
        "text": " We could send the media from the library that you were browsing on your phone and basically queue it up and send it to the screen a"
      },
      {
        "start": 259480,
        "stop": 260084,
        "text": " Be it like a Chromecast, but better. I love that functionality that's built into the jellyfin"
      },
      {
        "start": 260084,
        "stop": 260904,
        "text": " Mobile clients. It's super cool. What are your thoughts? So Schmeitzfield and not published Med's field says that he thinks that it's one to two years behind"
      },
      {
        "start": 260904,
        "stop": 261276,
        "text": " Plex in some ways the server side I'd say is is"
      },
      {
        "start": 261276,
        "stop": 261884,
        "text": " Certainly in that ballpark pretty pretty good now. Yeah, I don't know if I'd say one to two years"
      },
      {
        "start": 261904,
        "stop": 262528,
        "text": " Well the server side maybe though maybe that's a little harsh, but on the client side definitely maybe even more"
      },
      {
        "start": 262528,
        "stop": 262896,
        "text": " the Android TV experience is like"
      },
      {
        "start": 262896,
        "stop": 263120,
        "text": " 95% of the way there"
      },
      {
        "start": 263120,
        "stop": 263320,
        "text": " but it doesn't feel"
      },
      {
        "start": 263320,
        "stop": 263662,
        "text": " as nice it doesn't fit like it's the difference between"
      },
      {
        "start": 263662,
        "stop": 264232,
        "text": " Running your hand over a nicely finished piece of furniture and a piece of cheap IKEA plastic"
      },
      {
        "start": 264232,
        "stop": 264900,
        "text": " furniture like it's a very subtle difference and for most people that piece of plastic furniture is good enough"
      },
      {
        "start": 264900,
        "stop": 265482,
        "text": " and gets the job done, but you can't be a properly finished piece of real oil-finished wood. You know it's"
      },
      {
        "start": 265482,
        "stop": 266028,
        "text": " There's a difference it's small, but there's a difference it did eventually put my jellyfin"
      },
      {
        "start": 266028,
        "stop": 266700,
        "text": " Behind an edge in X proxy so I can do us a cell termination so I can get Chromecast working nice makes a big difference to"
      },
      {
        "start": 266700,
        "stop": 266956,
        "text": " Marcel was having problems with Chromecast Marcell you might look into"
      },
      {
        "start": 266956,
        "stop": 267524,
        "text": " Getting SSL setup hybrid sarcasm though came in with one that I thought was great with the jellyfin challenge"
      },
      {
        "start": 267540,
        "stop": 269780,
        "text": " The"
      },
      {
        "start": 269780,
        "stop": 272156,
        "text": " I"
      },
      {
        "start": 272172,
        "stop": 274284,
        "text": " All"
      },
      {
        "start": 274284,
        "stop": 276884,
        "text": " of"
      },
      {
        "start": 276884,
        "stop": 279484,
        "text": " the"
      },
      {
        "start": 279484,
        "stop": 282084,
        "text": " the"
      },
      {
        "start": 282084,
        "stop": 284684,
        "text": " the"
      },
      {
        "start": 284684,
        "stop": 287284,
        "text": " the"
      },
      {
        "start": 287284,
        "stop": 289884,
        "text": " the"
      },
      {
        "start": 289884,
        "stop": 292484,
        "text": " the"
      },
      {
        "start": 292484,
        "stop": 295084,
        "text": " the"
      },
      {
        "start": 295084,
        "stop": 297684,
        "text": " the"
      },
      {
        "start": 297684,
        "stop": 300284,
        "text": " the"
      },
      {
        "start": 300284,
        "stop": 302884,
        "text": " the"
      },
      {
        "start": 302884,
        "stop": 305484,
        "text": " the"
      },
      {
        "start": 305484,
        "stop": 308084,
        "text": " the"
      },
      {
        "start": 308084,
        "stop": 310684,
        "text": " the"
      },
      {
        "start": 310684,
        "stop": 313284,
        "text": " the"
      },
      {
        "start": 313284,
        "stop": 315884,
        "text": " the"
      },
      {
        "start": 315884,
        "stop": 318484,
        "text": " the"
      },
      {
        "start": 318484,
        "stop": 321084,
        "text": " the"
      },
      {
        "start": 321084,
        "stop": 323684,
        "text": " the"
      },
      {
        "start": 323684,
        "stop": 326284,
        "text": " the"
      },
      {
        "start": 326284,
        "stop": 328884,
        "text": " the"
      },
      {
        "start": 328884,
        "stop": 331484,
        "text": " the"
      },
      {
        "start": 331484,
        "stop": 334084,
        "text": " the"
      },
      {
        "start": 334084,
        "stop": 336684,
        "text": " the"
      },
      {
        "start": 336684,
        "stop": 339284,
        "text": " the"
      },
      {
        "start": 339284,
        "stop": 341884,
        "text": " the"
      },
      {
        "start": 341884,
        "stop": 344484,
        "text": " the"
      },
      {
        "start": 344484,
        "stop": 347084,
        "text": " the"
      }
    ],
    "processing_time": {
      "secs": 59,
      "nanos": 221826414
    }
  },
  "metadata": {
    "title": "Self-Hosted 88: Great Scott!",
    "pictures": [],
    "duration": {
      "secs": 3444,
      "nanos": 506000000
    },
    "unique_id": "http://selfhosted.show/88"
  },
  "episode": {
    "title": "Great Scott! | Self-Hosted 88",
    "description": "Alex dives deep to find out if Kubernetes is overkill for the home and finds solutions to simplify things. And Chris has a new firmware that turns his favorite network cameras up to 11.",
    "content": "<p>Alex dives deep to find out if Kubernetes is overkill for the home and finds solutions to simplify things. And Chris has a new firmware that turns his favorite network cameras up to 11.</p>\n\n<p><p>Plus an update on Jellyfin January.</p><p>Sponsored By:</p><ul><li><a href=\"https://linode.com/ssh\" rel=\"nofollow\">Linode</a>: <a href=\"https://linode.com/ssh\" rel=\"nofollow\">Receive a $100 60-day credit towards your new account. </a> Promo Code: linode.com/ssh</li><li><a href=\"https://crowdstrike.com/lce\" rel=\"nofollow\">LogScale</a>: <a href=\"https://crowdstrike.com/lce\" rel=\"nofollow\">Take logs from any source and make them usable. Get started with LogScale Community Edition for free.</a></li></ul><p><a href=\"https://jupitersignal.memberful.com/checkout?plan=53744\" rel=\"payment\">Support Self-Hosted</a></p><p>Links:</p><ul><li><a href=\"https://www.youtube.com/watch?v=UoOcLXfa8EU\" title=\"HIGH AVAILABILITY k3s (Kubernetes) in minutes! - YouTube\" rel=\"nofollow\">HIGH AVAILABILITY k3s (Kubernetes) in minutes! - YouTube</a> &mdash; Have you been thinking about running Kubernetes but don't know where to get started?  Let's start with k3s! </li><li><a href=\"https://github.com/ironicbadger/infra/tree/master/dev\" title=\"infra/dev at master  ironicbadger/infra\" rel=\"nofollow\">infra/dev at master  ironicbadger/infra</a></li><li><a href=\"https://github.com/Telmate/terraform-provider-proxmox\" title=\"Telmate/terraform-provider-proxmox\" rel=\"nofollow\">Telmate/terraform-provider-proxmox</a> &mdash; This repository provides a Terraform provider for the Proxmox virtualization platform and exposes Terraform resources to provision QEMU VMs and LXC Containers.</li><li><a href=\"https://nanne.dev/k8s-at-home-search/\" title=\"k8s at home search\" rel=\"nofollow\">k8s at home search</a> &mdash; We index Flux HelmReleases from Github repositories with the k8s-at-home topic.</li><li><a href=\"https://github.com/selfhostedshow/hdd-giveaway/discussions\" title=\"Discussions  selfhostedshow/hdd-giveaway\" rel=\"nofollow\">Discussions  selfhostedshow/hdd-giveaway</a></li><li><a href=\"https://www.linode.com/content/kubernetes-guide/\" title=\"Kubernetes for Full-Stack Developers - Free Guide\" rel=\"nofollow\">Kubernetes for Full-Stack Developers - Free Guide</a> &mdash; This comprehensive resource covers everything from the fundamental concepts of Kubernetes to the components of a Kubernetes cluster and network model implementation. New in the 2022 edition are sections on understanding the Standard Kubernetes Dashboard, the high-availability control plane, and autoscaling.</li><li><a href=\"https://github.com/gtxaspec/wz_mini_hacks\" title=\"wz_mini_hacks\" rel=\"nofollow\">wz<em>mini</em>hacks</a> &mdash; Run whatever firmware you want on your v2/car/PANv1/v3/PANv2 and have root access to the device, wz camera mods... make your camera better.</li><li><a href=\"https://github.com/gtxaspec/wz_mini_hacks/issues/187\" title=\"DO NOT Upgrade to 4.36.10.2163 beta\" rel=\"nofollow\">DO NOT Upgrade to 4.36.10.2163 beta</a> &mdash; this BETA release has significant back end changes, and breaks all libcallback functionality.</li><li><a href=\"https://donorbox.org/keep-matrix-exciting\" title=\"Support Matrix on Donorbox\" rel=\"nofollow\">Support Matrix on Donorbox</a></li><li><a href=\"https://cloudfree.shop/\" title=\"CloudFree.shop\" rel=\"nofollow\">CloudFree.shop</a></li><li><a href=\"https://jellyfin.org/\" title=\"Jellyfin\" rel=\"nofollow\">Jellyfin</a> &mdash; Jellyfin is the volunteer-built media solution that puts you in control of your media. Stream to any device from your own server, with no strings attached. Your media, your server, your way.</li><li><a href=\"https://linuxunplugged.com/492\" title=\"LINUX Unplugged 492: A New Challenge Approaches\" rel=\"nofollow\">LINUX Unplugged 492: A New Challenge Approaches</a> &mdash; Join us on a journey to true software freedom. We embark on our 30-day challenge and discover a whole new philosophy that will change the way you think about technology.</li><li><a href=\"https://jellyfin.org/posts/2022/12/29/swiftfin/\" title=\"Swiftfin on the App Store\" rel=\"nofollow\">Swiftfin on the App Store</a> &mdash; As of today, Swiftfin, our native iOS/iPadOS/tvOS app is now on the Apple App Store. </li><li><a href=\"https://github.com/jellyfin/Swiftfin\" title=\"Swiftfin on GitHub\" rel=\"nofollow\">Swiftfin on GitHub</a></li><li><a href=\"https://www.servethehome.com/new-fanless-4x-2-5gbe-intel-n5105-i226-v-firewall-tested/\" title=\"New Fanless 4x 2.5GbE Intel N5105 i226-V Firewall Tested\" rel=\"nofollow\">New Fanless 4x 2.5GbE Intel N5105 i226-V Firewall Tested</a> &mdash; We are going to focus on the newer 4x Intel i226-V version in todays article.</li><li><a href=\"https://getalby.com/\" title=\"Alby  Lightning for your Browser!\" rel=\"nofollow\">Alby  Lightning for your Browser!</a> &mdash; Grab the awesome Alby extension to add Lightning to your browser to power your Boosts.</li><li><a href=\"https://podcastindex.org/podcast/830124\" title=\"Self-Hosted on Podcastindex.org\" rel=\"nofollow\">Self-Hosted on Podcastindex.org</a> &mdash; Send a Boost into the Show from the Podcast Index website. Thanks for your support!</li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-9247",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15903343/f06d04b8-f4b4-44b6-9e58-613e453f5816.mp3",
      "length": "48744623",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2023-01-13T03:05:00+01:00"
  },
  "speedup": 58.16278
}