{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 1000,
        "text": " Hello and welcome to Linux Action News, Episode 266, recorded on November 9th, 2022. I'm Chris."
      },
      {
        "start": 1000,
        "stop": 1200,
        "text": " And I'm Wes."
      },
      {
        "start": 1200,
        "stop": 1400,
        "text": " Hello Wes, let's do the news."
      },
      {
        "start": 1400,
        "stop": 1600,
        "text": " We start this week with an observation."
      },
      {
        "start": 1600,
        "stop": 2400,
        "text": " It was not a particularly busy news week in Linux, but there are a few things we wanted you to know about."
      },
      {
        "start": 2500,
        "stop": 3000,
        "text": " Like the Amantu Summit, which is just wrapped up in Prague after a couple year hiatus."
      },
      {
        "start": 3000,
        "stop": 4000,
        "text": " Yeah, unfortunately, we could not attend this year just due to scheduling conflicts, but the company did live stream the event and we will have a link to each day in the notes."
      },
      {
        "start": 4000,
        "stop": 4400,
        "text": " Shuttleworth kicked off the three-day event with a bit of a keynote."
      },
      {
        "start": 4400,
        "stop": 4600,
        "text": " Thank you."
      },
      {
        "start": 4700,
        "stop": 5900,
        "text": " All right. Hello everybody. How's this working? Can you hear me at the back? Okay. What a treat to be here in Prague with all of you. Thank you for making the trip."
      },
      {
        "start": 6000,
        "stop": 7900,
        "text": " It is my greatest, greatest, greatest pleasure to host you here and I'm extremely excited for what we're going to be talking about, what we're going to achieve and what we're going to enable other people to do with open source."
      },
      {
        "start": 8000,
        "stop": 9300,
        "text": " The community-focused event followed multiple internal company get-togethers that took place at the same venue, with Mark Shuttleworth noting that they had over 500 canonical staffers there during the Q&A portion of his talk."
      },
      {
        "start": 9300,
        "stop": 9500,
        "text": " Why this specific place?"
      },
      {
        "start": 9500,
        "stop": 9700,
        "text": " Yes."
      },
      {
        "start": 9700,
        "stop": 10100,
        "text": " Because we were 500 people last week and we needed at least 500 rooms and this place has 800."
      },
      {
        "start": 10800,
        "stop": 12100,
        "text": " And as that Q&A rolled on, Mark proceeded to touch on the tension between the feeling of being part of something larger and the tension of working from home and how Canonical had to adapt during the pandemic as well."
      },
      {
        "start": 12100,
        "stop": 13000,
        "text": " So at Canonical, I got to tell you, we work pretty darn hard and we work from home, right? Which kind of means everybody gets a corner office, which is great."
      },
      {
        "start": 13300,
        "stop": 14200,
        "text": " But the times that we get together are critical to the health and sanity of a distributed workforce."
      },
      {
        "start": 14200,
        "stop": 15100,
        "text": " So there's this tension, right? I think you wouldn't work at Canonical if you didn't want to be working at home."
      },
      {
        "start": 15100,
        "stop": 15900,
        "text": " But then if you were only working at home, you wouldn't feel part of something much, much bigger."
      },
      {
        "start": 16000,
        "stop": 17100,
        "text": " So for me, it's really, really important that everyone at Canonical makes a commitment twice a year to get together, not just with their own team, but with lots of other teams."
      },
      {
        "start": 17100,
        "stop": 18900,
        "text": " And I love watching the kind of experiences that people have because people who just joined the company are working inside one team for up to six months, working on one problem, and then suddenly they realize, wow, I'm in the middle of all of these interesting, potent, difficult, important threads."
      },
      {
        "start": 18900,
        "stop": 19900,
        "text": " And that's really important. You'd think that the pandemic would be really easy for a remote-first organization. It wasn't. It really wasn't."
      },
      {
        "start": 19900,
        "stop": 21100,
        "text": " And I can tell you, we really missed this feeling of getting together and working stuff out in person, reaffirming our commitments and our relationships in person."
      },
      {
        "start": 21200,
        "stop": 22600,
        "text": " So how do we make that work? How do we make that work? Well, what I think is fun is that we try to pick interesting places. This is a very interesting place for lots of different reasons."
      },
      {
        "start": 22600,
        "stop": 23500,
        "text": " First, lots of James Bond movies have been shot here over the years. And second, beer is cheaper than water."
      },
      {
        "start": 23600,
        "stop": 24700,
        "text": " And third, the non-alcoholic beer is very good. So it seems like there are lots of great reasons to be here. And when we're in a place, we need a venue where we can all be together."
      },
      {
        "start": 24800,
        "stop": 26800,
        "text": " This event might be the restart of the Ubuntu Summits. And unlike the Ubuntu Dev Summits of the past, Canonical's intention this time around seems to be aiming for a bigger tent, an opportunity for them to hear from the community, and a chance for Canonical to showcase their solutions and ideas."
      },
      {
        "start": 26800,
        "stop": 27800,
        "text": " Microsoft has a new version of .NET, and one of its headline features is bigger, better, badder Linux support."
      },
      {
        "start": 27800,
        "stop": 29400,
        "text": " Yes, dear audience member, you heard that right. One of .NET 7's big new features is improved support and performance on Linux. Now it even has native ARM64 support and, yes, IBM Power as well."
      },
      {
        "start": 29500,
        "stop": 32400,
        "text": " Wow, okay. I mean, yeah, there's a lot in .NET 7, no doubt. That's really kind of a Coda Radio story. But I was just thinking, in the Linux terms, if I could travel back in time to young Linux-using Chris in the late 90s, and I could tell him that one day Microsoft would have this product called .NET, this development language called .NET, and they were releasing this big new version and they were promoting its new Linux features."
      },
      {
        "start": 32400,
        "stop": 33800,
        "text": " I could only imagine how young me would respond. I would guess his first question would probably be, \"How'd you get so damn fat?\" And then his second question would be, \"Why did Microsoft pick such a stupid name like .NET?\""
      },
      {
        "start": 33800,
        "stop": 35300,
        "text": " Sadly, even in 2022, we don't have answers for those questions yet. But sticking with Microsoft for just a moment longer, a surprising amount of you out there were upset when the death of the team's desktop Linux app was announced."
      },
      {
        "start": 35300,
        "stop": 36100,
        "text": " Well, good news. This week, Microsoft launched the team's progressive web app for desktop Linux."
      },
      {
        "start": 36200,
        "stop": 38400,
        "text": " And you know what? This might actually be an upgrade for you all. I mean, typically when we talk about a desktop app getting discontinued in favor of a web app, that's a downgrade. But Teams was always just a web app in different clothing. And now this PWA brings the Linux version at least closer to being feature parity with the Windows team's version."
      },
      {
        "start": 38500,
        "stop": 40500,
        "text": " And Microsoft puts it in their announcement. They say, \"A progressive web app enables us to ship the latest Microsoft Teams feature faster to our Linux customers and helps us bridge the gaps between the team's desktop client on Linux and Windows. The PWA experience is available for both Edge and Chrome browsers running on Linux.\""
      },
      {
        "start": 40600,
        "stop": 42300,
        "text": " Now, that's all well and good, and I'm happy to see investment on Linux here. But it kind of sounds like maybe Firefox is being left out of this little browser bunch. If anyone out there has tried, do let us know. That's one bit of research we're happy to outsource."
      },
      {
        "start": 42600,
        "stop": 43600,
        "text": " The standards body behind OpenGL, OpenCL, Vulkan, and some of your other favorites out there have announced their next graphics API, and it's called Camaros."
      },
      {
        "start": 43700,
        "stop": 45700,
        "text": " Yes, the Chronos group is working on this new API with the European Machine Vision Association. The work started back in March, and it's aiming to create a royalty-free standard for controlling camera system runtimes across embedded, mobile, industrial, extended reality, automotive, and scientific markets."
      },
      {
        "start": 45800,
        "stop": 47800,
        "text": " Yeah, you know, having messed around a little bit with embedded remote camera systems, I can see the need for that. It is tricky. So this Camaros API would sit sort of between like software you're using, say FFmpeg or whatever it might be, and then the hardware and transports that talk to the actual hardware, be it attached directly or over the network."
      },
      {
        "start": 47900,
        "stop": 49800,
        "text": " They intend to also support multiple programming languages, and they're going to have a loadable layer system just like Vulkan and some of the other standards do. You can think of this layer feature as a command dispatch system that enables developers to use installable layers for validation, profiling, debugging, things like that."
      },
      {
        "start": 49800,
        "stop": 50600,
        "text": " One question that's still in my mind at this point is, what does the introduction of Camaros mean for LibCamera?"
      },
      {
        "start": 50700,
        "stop": 52400,
        "text": " That's a good question. We don't know. I mean, LibCamera, I think that's a Raspberry Pi project, so it's potentially single vendor where this wants to sort of create a universal standard. I mean, you know what you do when you have too many standards, or in this case, too many APIs? You've got to do the right thing, Wes, and create a universal API that just covers everyone's use cases."
      },
      {
        "start": 52400,
        "stop": 52600,
        "text": " That'll solve it."
      },
      {
        "start": 53000,
        "stop": 54300,
        "text": " A quick mention for the new FwupD release this week, version 1.8.7. The headline feature is more hardware support from Star Labs, including their upcoming Starfighter laptop."
      },
      {
        "start": 54400,
        "stop": 56100,
        "text": " Though, we might be most excited about the experimental support for Intel's discrete GPUs. Also included is support for fingerprint Lenfi devices, Anker's Thunderbolt 4 mini hub, Elan haptic hardware, and more than a few other devices."
      },
      {
        "start": 56200,
        "stop": 57900,
        "text": " Some new features this time around, well, they include the ability to measure system integrity when you're installing UEFI updates, and support for XZ compressed metadata, which should reduce the bandwidth used to download firmware files by approximately 25%."
      },
      {
        "start": 57900,
        "stop": 58400,
        "text": " We'll link to the release notes because we're really just scratching the surface on this one."
      },
      {
        "start": 58800,
        "stop": 59500,
        "text": " Linode.com/lan. That's where you go to get $100 and 60-day credit on a new account. It's a great way to support the show while you're checking out Linode."
      },
      {
        "start": 59500,
        "stop": 60600,
        "text": " They make cloud computing simple, affordable, and accessible. It's how we run everything we've built in the last few years, including our new website, or if we wanted to check out something that requires a GPU, or we wanted to build a matrix community."
      },
      {
        "start": 60600,
        "stop": 61200,
        "text": " If you want to do anything, from running something for your business, or hosting something for yourself, Linode's the way to go."
      },
      {
        "start": 61300,
        "stop": 61900,
        "text": " 30-50% cheaper than those big hyperscalers, and a machine that's going to fit your needs perfectly. And on top of that, great performance."
      },
      {
        "start": 61900,
        "stop": 62400,
        "text": " They've got 11 data centers for you to choose from today, and a dozen more coming on next year."
      },
      {
        "start": 62400,
        "stop": 62900,
        "text": " And great features such as object storage, cloud firewall backups, and Kubernetes support, and so much more."
      },
      {
        "start": 62900,
        "stop": 63600,
        "text": " So go build something, go learn something, and support the show. Check out Linode by going to linode.com/lan."
      },
      {
        "start": 63600,
        "stop": 64100,
        "text": " Get that $100 and support the show. Linode.com/lan."
      },
      {
        "start": 64100,
        "stop": 65500,
        "text": " And also, thank you to Kaleid. Kaleid is an endpoint security solution that uses the most powerful, untapped resource in IT - end users."
      },
      {
        "start": 65500,
        "stop": 66200,
        "text": " Instead of forcing old-school MDMs on your users, Kaleid sends them security recommendations via Slack."
      },
      {
        "start": 66300,
        "stop": 67100,
        "text": " Kaleid will automatically notify your team when their devices are insecure, and give them step-by-step instructions on how to solve the problem."
      },
      {
        "start": 67100,
        "stop": 68600,
        "text": " By reaching out to employees via a friendly Slack DM and educating them about company policies, Kaleid can help you build a culture in which everyone contributes to security, because everyone understands how and why to do it."
      },
      {
        "start": 68700,
        "stop": 69700,
        "text": " For IT admins, Kaleid provides a single dashboard that lets you monitor the security of your entire fleet for Mac, Windows, and, of course, Linux."
      },
      {
        "start": 69700,
        "stop": 70500,
        "text": " So that's Kaleid. User-centered, cross-platform, endpoint security for teams that slack."
      },
      {
        "start": 70500,
        "stop": 71300,
        "text": " You can meet your compliance goals by putting users first. Visit kaleid.com/lan to find out how."
      },
      {
        "start": 71400,
        "stop": 72100,
        "text": " If you follow that link, they'll hook you up with a goodie bag, including a t-shirt, just for activating a free trial."
      },
      {
        "start": 72100,
        "stop": 72700,
        "text": " That's K-O-L-I-D-E dot com slash LAN."
      },
      {
        "start": 73100,
        "stop": 74700,
        "text": " We end this week with a nice fireside chat between Pat Gelsinger and Linus Torvalds. The casual conversation was conducted at Intel's Innovation 2022 event, where Intel's CEO got to sit down and have a wide range of topics to be discussed with Mr. Torvalds."
      },
      {
        "start": 74800,
        "stop": 76500,
        "text": " Intel Innovation is their developer-focused event that they say spotlights the tools, training, and community to empower the world's developers to create what's next. So the topics are more developer and ecosystem-focused than you typically get in some of these fireside chats with Linus."
      },
      {
        "start": 76500,
        "stop": 77200,
        "text": " One of my favorite moments is when Linus talks about what's most important about open source to him personally."
      },
      {
        "start": 77300,
        "stop": 78400,
        "text": " And I think one of the most important parts to open source for me has been that everybody needs to feel like they are in equal footing."
      },
      {
        "start": 78500,
        "stop": 80500,
        "text": " I've had a lot of companies who do dual licensing, and it's perfectly legally fine, but it tends to result in politics and internal strife about the project when one company or one entity has more rights than the other entities."
      },
      {
        "start": 80600,
        "stop": 83000,
        "text": " So I've tried to, I've personally tried to always keep all my projects that very clearly, I'm not special, I'm the top-level maintainer when it comes to the kernel, but if somebody else does a better job and one day that will happen, they will take over because I don't have any special rights except for the fact that people trust me because I've been doing it for 30 plus years."
      },
      {
        "start": 83100,
        "stop": 83900,
        "text": " So open source trust, I mean this idea of contributing to the community and having the exposure of the community and then finally the trust of the community."
      },
      {
        "start": 83900,
        "stop": 85400,
        "text": " Yes. But I mean, so you say I don't actually like the notion of contributing to the community because that implies a certain amount of altruism that I'm not a huge believer in."
      },
      {
        "start": 85500,
        "stop": 86600,
        "text": " Okay, tit for tat. I really think it's more like you're not contributing to the community, what you're doing is you're trying to make a project better for yourself."
      },
      {
        "start": 86600,
        "stop": 88000,
        "text": " And the rules of the project end up then meaning that as you're making it better for yourself and trying to improve your own situation, you kind of indirectly contribute to the community."
      },
      {
        "start": 88100,
        "stop": 89200,
        "text": " And therefore, you should always be motivated by your needs. And that's actually how a lot of these open source projects, including very much the kernel, have improved so much."
      },
      {
        "start": 89200,
        "stop": 90700,
        "text": " It's because I'm looking at all we've done in the last 25 years and none of it was stuff that I needed or I wanted because as far as I was concerned, 25 years ago the system pretty much did what I needed."
      },
      {
        "start": 90800,
        "stop": 91600,
        "text": " There's also this moment when things get a bit real. Linus tells Intel CEO Pat Gelsinger that people don't seem very happy at Intel anymore."
      },
      {
        "start": 91600,
        "stop": 92400,
        "text": " I think everybody knows that issue. The problems on the execution side have been pretty painful for everybody."
      },
      {
        "start": 92500,
        "stop": 94700,
        "text": " I don't see any of the hardware and fab issues. What I have seen are kind of the fallout from the Intel software development standpoint where the last few years have not been quite as ebullient as they were before."
      },
      {
        "start": 94800,
        "stop": 95800,
        "text": " I think people have not been as happy with being inside of Intel because I don't think Intel has necessarily been a very happy place for a few years. And I'm hoping that's changing."
      },
      {
        "start": 95800,
        "stop": 96500,
        "text": " Well, that's certainly my job, right, to change it as well. And we're getting on it as we rebuild."
      },
      {
        "start": 96500,
        "stop": 97500,
        "text": " And obviously having events like this one are about rebuilding our commitment, our engagement with the community, participating, driving standards as well."
      },
      {
        "start": 97600,
        "stop": 98200,
        "text": " Linus then goes on to stress how vital hardware documentation is and how Intel could lead there."
      },
      {
        "start": 98200,
        "stop": 99300,
        "text": " But another of my favorite moments was when Linus shared his thoughts on companies like Intel using software to limit hardware features for marketing purposes."
      },
      {
        "start": 99400,
        "stop": 101400,
        "text": " As I have your ear and this may be cut out, the thing I sometimes despise about different companies and Intel has had that problem is when you do market segmentation where certain features only exist in certain markets that aren't necessarily as available as others."
      },
      {
        "start": 101500,
        "stop": 103000,
        "text": " And I'm thinking of things like the transactional memory. I mean, it's gone now. Maybe it's never coming back. But that was very painful for us when only certain server CPUs had it."
      },
      {
        "start": 103100,
        "stop": 105000,
        "text": " And the people who actually needed to develop for it couldn't access it easily on their own desktops. And that's, I think, an area where Intel can maybe improve and not let the market segmentation drive these kind of technical issues that make it hard for developers."
      },
      {
        "start": 105100,
        "stop": 106300,
        "text": " So tell them, Linus, and respect to Intel for leaving that bit in the interview. They could have cut that criticism. Overall, though, it's a friendly, low-key chat. It's about 29 minutes long and we recommend it."
      },
      {
        "start": 106300,
        "stop": 107000,
        "text": " We'll have a link to it in our show notes. And while you're over there, check out LinuxActionNews.com/subscribe for all the ways to get new episodes."
      },
      {
        "start": 107000,
        "stop": 107600,
        "text": " And LinuxActionNews.com/contact to let us know how that new Teams PWA is going for you."
      },
      {
        "start": 107700,
        "stop": 108700,
        "text": " And be sure to check out Office Hours. We have a lot of projects going on and some new features for our audience who are in development. OfficeHours.hair and Episode 16 comes out on Friday."
      },
      {
        "start": 108700,
        "stop": 109400,
        "text": " Don't worry, though. We'll be back right here next week with our take on the latest Linux and open source news."
      },
      {
        "start": 109400,
        "stop": 109700,
        "text": " Thanks for joining us. And that's all the news for this week."
      },
      {
        "start": 109700,
        "stop": 111500,
        "text": " [music]"
      },
      {
        "start": 111500,
        "stop": 112000,
        "text": " [music]"
      }
    ],
    "processing_time": {
      "secs": 707,
      "nanos": 907081130
    }
  },
  "metadata": {
    "title": "Linux Action News: Linux Action News 266",
    "pictures": [],
    "duration": {
      "secs": 1114,
      "nanos": 854000000
    },
    "unique_id": "http://linuxactionnews.com/266"
  },
  "episode": {
    "title": "Linux Action News 266",
    "description": "Microsoft's new goodies for Linux users, the Ubuntu Summit wraps up, and our takeaways from the recent fireside chat with Linus Torvalds.",
    "content": "<p><p>Microsoft&#39;s new goodies for Linux users, the Ubuntu Summit wraps up, and our takeaways from the recent fireside chat with Linus Torvalds.</p><p>Sponsored By:</p><ul><li><a href=\"http://linode.com/lan\" rel=\"nofollow\">Linode</a>: <a href=\"http://linode.com/lan\" rel=\"nofollow\">Sign up using the link on this page and receive a $100 60-day credit towards your new account. </a></li><li><a href=\"https://kolide.com/lan\" rel=\"nofollow\">Kolide</a>: <a href=\"https://kolide.com/lan\" rel=\"nofollow\">User-centered, cross-platform endpoint security for teams that Slack. </a></li></ul><p><a href=\"https://www.jupiter.party/\" rel=\"payment\">Support Linux Action News</a></p><p>Links:</p><ul><li><a href=\"https://www.theregister.com/2022/11/09/canonical_conference/\" title=\"The Ubuntu Summit Just Wrapped Up\" rel=\"nofollow\">The Ubuntu Summit Just Wrapped Up</a> &mdash; Vulture Towers Central Europe are in Prague – which, handily, is also the location for Canonical's 2022 Ubuntu Summit.</li><li><a href=\"https://www.youtube.com/watch?v=pqBbiT40Eak\" title=\"Ubuntu Summit 2022 - Day 1! - YouTube\" rel=\"nofollow\">Ubuntu Summit 2022 - Day 1! - YouTube</a></li><li><a href=\"https://www.youtube.com/watch?v=wOLHFiuwn4w\" title=\"Ubuntu Summit 2022 - Day 2! - YouTube\" rel=\"nofollow\">Ubuntu Summit 2022 - Day 2! - YouTube</a></li><li><a href=\"https://www.youtube.com/watch?v=0Nr3TumNf2I\" title=\"Ubuntu Summit 2022 - Day 3! - YouTube\" rel=\"nofollow\">Ubuntu Summit 2022 - Day 3! - YouTube</a></li><li><a href=\"https://www.phoronix.com/news/Microsoft-dotNET-7\" title=\"Microsoft .NET 7 Released With Better Linux Support\" rel=\"nofollow\">Microsoft .NET 7 Released With Better Linux Support</a> &mdash; Microsoft .NET 7 brings improved performance, enhanced .NET support on Linux throughout, native support for ARM64, developer productivity enhancements, better cross-platform mobile/desktop app support, HTTP/3 improvements for cloud native apps, 64-bit IBM Power support on Linux, and a variety of other run-time improvements.</li><li><a href=\"https://news.softpedia.com/news/microsoft-launches-a-microsoft-teams-pwa-on-linux-536403.shtml\" title=\"Microsoft Launches a Microsoft Teams PWA on Linux\" rel=\"nofollow\">Microsoft Launches a Microsoft Teams PWA on Linux</a> &mdash; The PWA enables us to ship the latest Microsoft Teams features faster to our Linux customers and helps us bridge the gaps between the Teams desktop client on Linux and Windows.</li><li><a href=\"https://www.khronos.org/blog/khronos-unveils-kamaros-as-the-name-for-the-embedded-camera-system-api-and-working-group\" title=\"Khronos Unveils Kamaros\" rel=\"nofollow\">Khronos Unveils Kamaros</a> &mdash; An open, royalty-free standard for controlling camera system runtimes in embedded, mobile, industrial, XR, automotive, and scientific markets.</li><li><a href=\"https://www.phoronix.com/news/Khronos-Kamaros\" title=\"The Khronos Group Announces “Kamaros” As Their Newest Forthcoming API\" rel=\"nofollow\">The Khronos Group Announces “Kamaros” As Their Newest Forthcoming API</a></li><li><a href=\"https://github.com/fwupd/fwupd/releases/tag/1.8.7\" title=\"Fwupd 1.8.7 is a Big Update\" rel=\"nofollow\">Fwupd 1.8.7 is a Big Update</a> &mdash; Linux firmware updating utility fwupd 1.8.7 has been released adding support for new devices, as well as various improvements.</li><li><a href=\"https://9to5linux.com/fwupd-1-8-7-adds-support-for-more-star-labs-linux-laptops-intel-discrete-gpus\" title=\"Fwupd 1.8.7 Adds Support for More Star Labs Linux Laptops, Intel Discrete GPU\" rel=\"nofollow\">Fwupd 1.8.7 Adds Support for More Star Labs Linux Laptops, Intel Discrete GPU</a></li><li><a href=\"https://www.youtube.com/watch?v=0m4hlWx7oRk\" title=\"Pat Gelsinger and Linus Torvalds talk Linux, open source, technology and more - YouTube\" rel=\"nofollow\">Pat Gelsinger and Linus Torvalds talk Linux, open source, technology and more - YouTube</a> &mdash; Intel CEO Pat Gelsinger sat down with Linus Torvalds, the creator of Linux who is also known as “the godfather of  Open-Source,” to talk about everything from the beginning of Linux to Linus’ advice for Intel and why he chose a penguin as the Linux mascot.</li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-9025",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15772939/5f465e0b-0808-4bbf-9c9e-97ad1338c612.mp3",
      "length": "16044030",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-11-10T09:45:00+01:00"
  },
  "speedup": 1.5748591
}