{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 956,
        "text": " Hello, and welcome to Linux Action News, episode 272, recorded on December 21st, 2022."
      },
      {
        "start": 956,
        "stop": 1056,
        "text": " I'm Chris."
      },
      {
        "start": 1056,
        "stop": 1156,
        "text": " And I'm Wes."
      },
      {
        "start": 1156,
        "stop": 1256,
        "text": " Hello, Wes."
      },
      {
        "start": 1256,
        "stop": 1464,
        "text": " Let's do the news."
      },
      {
        "start": 1464,
        "stop": 2102,
        "text": " Raspberry Pi's CEO, Eben Upton, joined Christopher Barnett from Explaining Computers and updated"
      },
      {
        "start": 2102,
        "stop": 2892,
        "text": " us on the state of the Pi, including a recently secured deal to buy chips from Samsung."
      },
      {
        "start": 2892,
        "stop": 3332,
        "text": " One of the reoccurring themes of the interview was just how challenging the supply chain"
      },
      {
        "start": 3332,
        "stop": 3680,
        "text": " has been for the firm to navigate in the last couple of years."
      },
      {
        "start": 3680,
        "stop": 4072,
        "text": " Can't get back the fab capacity that wasn't used in 2020."
      },
      {
        "start": 4072,
        "stop": 4616,
        "text": " And so the combination of that negative going supply shock and positive going demand shock"
      },
      {
        "start": 4616,
        "stop": 4776,
        "text": " generated a shortage."
      },
      {
        "start": 4776,
        "stop": 4984,
        "text": " That shortage persists."
      },
      {
        "start": 4984,
        "stop": 5304,
        "text": " The semiconductor supply chain was in any case very tight anyway."
      },
      {
        "start": 5304,
        "stop": 5620,
        "text": " There was not an enormous amount of spare capacity."
      },
      {
        "start": 5620,
        "stop": 6060,
        "text": " So it generates a mismatch, a shortage situation, which is hard to get out of."
      },
      {
        "start": 6060,
        "stop": 6424,
        "text": " Of course, one of the problems, as we found out in other ways with toilet paper and hand"
      },
      {
        "start": 6424,
        "stop": 6896,
        "text": " sanitizer during the pandemic, is once the impression takes hold that there is a shortage,"
      },
      {
        "start": 6896,
        "stop": 7208,
        "text": " the shortage becomes self-reinforcing and you start to see hoarding behavior."
      },
      {
        "start": 7208,
        "stop": 7644,
        "text": " You start to see people's purchasing behavior change in the anticipation of shortages, and"
      },
      {
        "start": 7644,
        "stop": 7788,
        "text": " that makes the shortages worse."
      },
      {
        "start": 7788,
        "stop": 8204,
        "text": " So that's kind of what's happened across the whole semiconductor supply chain."
      },
      {
        "start": 8204,
        "stop": 8536,
        "text": " It's affected some consumers, some consumers of semiconductors more than others."
      },
      {
        "start": 8536,
        "stop": 9100,
        "text": " Obviously, the car companies are probably the kind of the wildest example of a world"
      },
      {
        "start": 9100,
        "stop": 9796,
        "text": " in which a 20,000 pound piece of metal and plastic can be immobilized in a parking lot"
      },
      {
        "start": 9796,
        "stop": 10124,
        "text": " for want of a $1 engine management IC."
      },
      {
        "start": 10124,
        "stop": 10344,
        "text": " So you've seen a lot of that."
      },
      {
        "start": 10344,
        "stop": 10812,
        "text": " It's affected us a little bit, and we've worked hard to get around it."
      },
      {
        "start": 10812,
        "stop": 11300,
        "text": " But I guess the kind of the good news is we are starting to see the light at the end of"
      },
      {
        "start": 11300,
        "stop": 11680,
        "text": " the tunnel, and I would say we have probably an 80% certainty that it's not an express"
      },
      {
        "start": 11680,
        "stop": 12064,
        "text": " train, that it really is the end of the tunnel."
      },
      {
        "start": 12064,
        "stop": 12532,
        "text": " How you managed your supply chain and inventory levels these last couple of years has really"
      },
      {
        "start": 12532,
        "stop": 12828,
        "text": " been a make or break it factor for a lot of companies."
      },
      {
        "start": 12828,
        "stop": 13270,
        "text": " We've covered some companies that seem to have done a much better job, and I think we"
      },
      {
        "start": 13270,
        "stop": 13700,
        "text": " can probably all think of a few companies who've done much worse."
      },
      {
        "start": 13700,
        "stop": 13932,
        "text": " But it does seem like things are getting better."
      },
      {
        "start": 13932,
        "stop": 14324,
        "text": " Ebb and Announced recently on their blog that 100,000 units have been secured for single"
      },
      {
        "start": 14324,
        "stop": 14424,
        "text": " unit sales."
      },
      {
        "start": 14424,
        "stop": 14920,
        "text": " That's what they call regular retail customers, i.e. you and me."
      },
      {
        "start": 14920,
        "stop": 15552,
        "text": " But it seems as for the past couple of years during these supply constraints, as many of"
      },
      {
        "start": 15552,
        "stop": 16096,
        "text": " us suspected and feared, boring old cheap retail customers were just completely taking"
      },
      {
        "start": 16096,
        "stop": 16392,
        "text": " a back seat to their big customers."
      },
      {
        "start": 16392,
        "stop": 16676,
        "text": " I guess the biggest positive thing that's happened all the way through this is we've"
      },
      {
        "start": 16676,
        "stop": 17004,
        "text": " been able to sustain our OEM customers."
      },
      {
        "start": 17004,
        "stop": 17376,
        "text": " So one of the interesting things that's happened with Raspberry Pi, we are a hobbyist, or if"
      },
      {
        "start": 17376,
        "stop": 17852,
        "text": " you still think about our orientation, how we think about ourselves, the hobbyist in"
      },
      {
        "start": 17852,
        "stop": 18184,
        "text": " education, the enthusiast in education community is still really, really, really important"
      },
      {
        "start": 18184,
        "stop": 18284,
        "text": " to us."
      },
      {
        "start": 18284,
        "stop": 18864,
        "text": " But as a share of our overall production several years ago, industrial and embedded customers"
      },
      {
        "start": 18864,
        "stop": 19324,
        "text": " came to dominate our customer base by volume."
      },
      {
        "start": 19324,
        "stop": 19818,
        "text": " This meant those customers were getting their orders filled while the rest of us just got"
      },
      {
        "start": 19818,
        "stop": 20006,
        "text": " to wait."
      },
      {
        "start": 20006,
        "stop": 20728,
        "text": " In that blog post Chris mentioned, Upton acknowledged the community's patience and offers the 100,000"
      },
      {
        "start": 20728,
        "stop": 21576,
        "text": " units made up of Raspberry Pi 0Ws, 3A+s, and Raspberry Pi 4s in the 2GB and 4GB varieties"
      },
      {
        "start": 21576,
        "stop": 21732,
        "text": " for single unit sale."
      },
      {
        "start": 21732,
        "stop": 22222,
        "text": " Now, we don't know the breakdown of how many of each model there's going to be, but"
      },
      {
        "start": 22222,
        "stop": 22886,
        "text": " Upton does indicate that it's likely the Pi 0W will come back into stock first."
      },
      {
        "start": 22886,
        "stop": 23830,
        "text": " As for when we might see a whole new Pi, well, for that, we might have to wait until 2025."
      },
      {
        "start": 23830,
        "stop": 24564,
        "text": " So I think we are, don't expect a Pi 5 next year, I think would be the next year is a"
      },
      {
        "start": 24564,
        "stop": 24664,
        "text": " recovery."
      },
      {
        "start": 24664,
        "stop": 24986,
        "text": " So on the one hand, it's kind of slowed us down."
      },
      {
        "start": 24986,
        "stop": 25332,
        "text": " On the one hand, it's on the other hand, it's slowed everything down."
      },
      {
        "start": 25332,
        "stop": 25864,
        "text": " And so there's merit, I think, in us spending a year, before we look at introducing anything"
      },
      {
        "start": 25864,
        "stop": 26148,
        "text": " new, spending a year recovering."
      },
      {
        "start": 26148,
        "stop": 26924,
        "text": " KDE Plasma fans are getting a little hyped, well, at least I am, about the work that will"
      },
      {
        "start": 26924,
        "stop": 27112,
        "text": " be starting soon on Plasma 6."
      },
      {
        "start": 27112,
        "stop": 27756,
        "text": " But before we get there, the development team has released KDE Frameworks 5.101."
      },
      {
        "start": 27756,
        "stop": 28238,
        "text": " And in my opinion, what is notable about this release, besides the fixes and improvements"
      },
      {
        "start": 28238,
        "stop": 28670,
        "text": " that are actually really great to see, is that it's effectively the final release of"
      },
      {
        "start": 28670,
        "stop": 28818,
        "text": " the 5 series."
      },
      {
        "start": 28818,
        "stop": 29194,
        "text": " The development team now turns their attention towards KDE Frameworks 6."
      },
      {
        "start": 29194,
        "stop": 29774,
        "text": " Yeah, I guess that's been the plan for a while now, with KDE Frameworks 5, of course,"
      },
      {
        "start": 29774,
        "stop": 30070,
        "text": " still seeing maintenance updates going forward."
      },
      {
        "start": 30070,
        "stop": 30544,
        "text": " What's quite exciting for me in this, though, is it means we're getting close to the final"
      },
      {
        "start": 30544,
        "stop": 31024,
        "text": " version of the 5 series for the Plasma desktop as a whole."
      },
      {
        "start": 31024,
        "stop": 31502,
        "text": " The upcoming 5.27 release is also planned to be the last before real work begins on"
      },
      {
        "start": 31502,
        "stop": 32042,
        "text": " Plasma 6, integrating Qt 6, and a whole lot more."
      },
      {
        "start": 32042,
        "stop": 32554,
        "text": " That's going to be something to watch, just to see where they set their goals and what"
      },
      {
        "start": 32554,
        "stop": 32998,
        "text": " they get to, and how that transition actually ends up for end users."
      },
      {
        "start": 32998,
        "stop": 33290,
        "text": " We're going to keep an eye on all that and report back, of course."
      },
      {
        "start": 33290,
        "stop": 33754,
        "text": " But sticking with the desktop for just another moment, it was also great to see that XFCE"
      },
      {
        "start": 33754,
        "stop": 34194,
        "text": " 4.18 released just a little bit after we published last week."
      },
      {
        "start": 34194,
        "stop": 34856,
        "text": " Almost two years of work went into 4.18, and the project says a gazillion bug fixes and"
      },
      {
        "start": 34856,
        "stop": 35160,
        "text": " various minor improvements also went into the release."
      },
      {
        "start": 35160,
        "stop": 35316,
        "text": " I think it really comes together."
      },
      {
        "start": 35316,
        "stop": 35628,
        "text": " It looks like a really nice release."
      },
      {
        "start": 35628,
        "stop": 36170,
        "text": " In fact, it's kind of got me eyeballed, because I think Nick's just got it packaged up."
      },
      {
        "start": 36170,
        "stop": 36642,
        "text": " So I'm kind of considering giving this release of XFCE 4.18 a go."
      },
      {
        "start": 36642,
        "stop": 37226,
        "text": " I could kind of see it making a really nice, lean, mean gaming desktop or gaming laptop"
      },
      {
        "start": 37226,
        "stop": 37326,
        "text": " setup too."
      },
      {
        "start": 37326,
        "stop": 37890,
        "text": " So I may give this a try and report back."
      },
      {
        "start": 37890,
        "stop": 38378,
        "text": " The little holiday elves in your audio subsystem have a gift for you."
      },
      {
        "start": 38378,
        "stop": 38954,
        "text": " It's Pipewire 0.3.62, which has just been released."
      },
      {
        "start": 38954,
        "stop": 39478,
        "text": " It includes one feature I think you and the audience are going to like."
      },
      {
        "start": 39478,
        "stop": 39586,
        "text": " Heck yes."
      },
      {
        "start": 39586,
        "stop": 39958,
        "text": " I think they might not even realize they wanted this feature until we mention it."
      },
      {
        "start": 39958,
        "stop": 40442,
        "text": " Because I was digging through the new Pipewire release notes, and this feature they recently"
      },
      {
        "start": 40442,
        "stop": 40542,
        "text": " added struck me."
      },
      {
        "start": 40542,
        "stop": 40742,
        "text": " It's called Bluetooth offloading."
      },
      {
        "start": 40742,
        "stop": 40902,
        "text": " Well, OK, what's this?"
      },
      {
        "start": 40902,
        "stop": 41230,
        "text": " Well, it's like another way of saying hardware accelerated Bluetooth."
      },
      {
        "start": 41230,
        "stop": 41888,
        "text": " The idea is Pipewire will completely offload the reception, decoding, and playback handling"
      },
      {
        "start": 41888,
        "stop": 42502,
        "text": " to the hardware, which means less for the OS to do, lower CPU usage, and thus lower"
      },
      {
        "start": 42502,
        "stop": 42642,
        "text": " power draw."
      },
      {
        "start": 42642,
        "stop": 43266,
        "text": " Now, to get this fancy new hardware support and improved efficiency, well, some updates"
      },
      {
        "start": 43266,
        "stop": 43530,
        "text": " were also needed in Wireplumber."
      },
      {
        "start": 43530,
        "stop": 43970,
        "text": " That's the Pipewire session and policy manager that sort of makes sure all the bits get connected"
      },
      {
        "start": 43970,
        "stop": 44254,
        "text": " where they need to go on your actual running system."
      },
      {
        "start": 44254,
        "stop": 44970,
        "text": " Thankfully, that support landed just in the last week with version 0.4.13."
      },
      {
        "start": 44970,
        "stop": 45620,
        "text": " But back on Pipewire, a regression was noticed, thankfully caught and now fixed in this release,"
      },
      {
        "start": 45620,
        "stop": 45998,
        "text": " which should significantly improve screen sharing on Wayland."
      },
      {
        "start": 45998,
        "stop": 46438,
        "text": " There's also some new video metadata that indicates if a video was transformed, like"
      },
      {
        "start": 46438,
        "stop": 46662,
        "text": " being flipped or rotated."
      },
      {
        "start": 46662,
        "stop": 47086,
        "text": " LibCamera and Gstreamer have been updated to support this new metadata."
      },
      {
        "start": 47086,
        "stop": 47594,
        "text": " Now all we need is just some applications up the stack to build and support."
      },
      {
        "start": 47594,
        "stop": 47694,
        "text": " Linode.com/land."
      },
      {
        "start": 47694,
        "stop": 48330,
        "text": " That's where you go to get $100 in 60-day credit on a new account, and it's a great"
      },
      {
        "start": 48330,
        "stop": 48630,
        "text": " way to support the show while you're checking out fast, reliable cloud hosting."
      },
      {
        "start": 48630,
        "stop": 48730,
        "text": " That's what Linode is."
      },
      {
        "start": 48730,
        "stop": 49042,
        "text": " It's the best in the business in so many categories that matter."
      },
      {
        "start": 49042,
        "stop": 49438,
        "text": " Performance, price, support, and one that I think matters to me and I think a lot of"
      },
      {
        "start": 49438,
        "stop": 49686,
        "text": " you out there is community support."
      },
      {
        "start": 49686,
        "stop": 49786,
        "text": " You know it."
      },
      {
        "start": 49786,
        "stop": 50070,
        "text": " We've demonstrated here with their support for Jupyter Broadcasting, our road trips,"
      },
      {
        "start": 50070,
        "stop": 50532,
        "text": " our meetups, but they also sponsor a lot of our favorite open source projects with infrastructure."
      },
      {
        "start": 50532,
        "stop": 51022,
        "text": " They participate in a lot of community activities and just creators in this space as well."
      },
      {
        "start": 51022,
        "stop": 51254,
        "text": " There's that element that I think shows they're savvy."
      },
      {
        "start": 51254,
        "stop": 51682,
        "text": " They invest in the community around them because they know, having done this for nearly 19"
      },
      {
        "start": 51682,
        "stop": 52138,
        "text": " years, that's how you flourish things in free software and open source."
      },
      {
        "start": 52138,
        "stop": 52426,
        "text": " And on top of that, they've got a great product offering."
      },
      {
        "start": 52426,
        "stop": 52754,
        "text": " The best performance out there, I've tested 11 data centers for you to choose from with"
      },
      {
        "start": 52754,
        "stop": 52980,
        "text": " a dozen more coming online."
      },
      {
        "start": 52980,
        "stop": 53434,
        "text": " Things like object storage that are compatible with S3, cloud firewalls that block the traffic"
      },
      {
        "start": 53434,
        "stop": 53854,
        "text": " from ever getting to your rig in the first place, infrastructure management tools like"
      },
      {
        "start": 53854,
        "stop": 54078,
        "text": " Ansible, Terraform, Kubernetes."
      },
      {
        "start": 54078,
        "stop": 54256,
        "text": " If you want to use it, they support it."
      },
      {
        "start": 54256,
        "stop": 54612,
        "text": " Great backups that are easy to understand, quick to restore."
      },
      {
        "start": 54612,
        "stop": 55046,
        "text": " All of that plus support that's available 365 by phone, email, or ticket, whatever you"
      },
      {
        "start": 55046,
        "stop": 55146,
        "text": " want."
      },
      {
        "start": 55146,
        "stop": 55286,
        "text": " Tier one support right there."
      },
      {
        "start": 55286,
        "stop": 55462,
        "text": " You call it, they answer your question."
      },
      {
        "start": 55462,
        "stop": 55562,
        "text": " They help you right there."
      },
      {
        "start": 55562,
        "stop": 55662,
        "text": " They don't do the escalation thing."
      },
      {
        "start": 55662,
        "stop": 55878,
        "text": " They don't make you go all these different hoops and games."
      },
      {
        "start": 55878,
        "stop": 55978,
        "text": " It's powerful."
      },
      {
        "start": 55978,
        "stop": 56362,
        "text": " I challenge you to go try, go build something, go learn something, see what I've been talking"
      },
      {
        "start": 56362,
        "stop": 56568,
        "text": " about and support the show."
      },
      {
        "start": 56568,
        "stop": 56668,
        "text": " Linode is what we use."
      },
      {
        "start": 56668,
        "stop": 56820,
        "text": " I think you're going to love it."
      },
      {
        "start": 56820,
        "stop": 56920,
        "text": " Linode.com/lan."
      },
      {
        "start": 56920,
        "stop": 57464,
        "text": " That's where you get the $100 and 60 day credit and you can kick the tires yourself."
      },
      {
        "start": 57464,
        "stop": 57998,
        "text": " Linode.com/lan."
      },
      {
        "start": 57998,
        "stop": 58284,
        "text": " And thank you to Collide."
      },
      {
        "start": 58284,
        "stop": 58938,
        "text": " Point Security doesn't have to be a battle between IT admins and end users."
      },
      {
        "start": 58938,
        "stop": 59188,
        "text": " Collide does things differently."
      },
      {
        "start": 59188,
        "stop": 59710,
        "text": " Collide provides user centered solutions for companies that slack."
      },
      {
        "start": 59710,
        "stop": 60118,
        "text": " Users will receive security recommendations and Collide will automatically notify your"
      },
      {
        "start": 60118,
        "stop": 60694,
        "text": " team when their devices are insecure and give them step by step instructions on how to fix"
      },
      {
        "start": 60694,
        "stop": 60836,
        "text": " the problem."
      },
      {
        "start": 60836,
        "stop": 61432,
        "text": " And Collide's dashboard allows IT admins to easily monitor the security of the entire fleet,"
      },
      {
        "start": 61432,
        "stop": 61890,
        "text": " whether they're on Mac, Windows or yes, Linux."
      },
      {
        "start": 61890,
        "stop": 62458,
        "text": " With Collide, you can build a culture of security and meet your compliance goals."
      },
      {
        "start": 62458,
        "stop": 63238,
        "text": " Go try it out for free at collide.com/lan and get a goodie bag just for activating your"
      },
      {
        "start": 63238,
        "stop": 63338,
        "text": " trial."
      },
      {
        "start": 63338,
        "stop": 64010,
        "text": " It's time to put users first with Collide."
      },
      {
        "start": 64010,
        "stop": 64466,
        "text": " That's collide.com/lan."
      },
      {
        "start": 64466,
        "stop": 65014,
        "text": " We end this week with some exciting news from Gette, the self-hosted GitHub and GitLab alternative."
      },
      {
        "start": 65014,
        "stop": 65502,
        "text": " They've announced Gette actions, which are just now in preview."
      },
      {
        "start": 65502,
        "stop": 65986,
        "text": " Actions allow users to run workflows for a variety of events in a repo."
      },
      {
        "start": 65986,
        "stop": 66444,
        "text": " You know, things like building your code, running your tests, making new releases or"
      },
      {
        "start": 66444,
        "stop": 67026,
        "text": " building new container images, or heck, maybe even deploying some code to a Linode server,"
      },
      {
        "start": 67026,
        "stop": 67126,
        "text": " say."
      },
      {
        "start": 67126,
        "stop": 67706,
        "text": " Actions and CI/CD tooling generally seems to be one of the most requested features that"
      },
      {
        "start": 67706,
        "stop": 68094,
        "text": " so far has been missing, at least in some users' minds, from Gette."
      },
      {
        "start": 68094,
        "stop": 68562,
        "text": " And that makes sense because Gette is often used as a self-hosted replacement for services"
      },
      {
        "start": 68562,
        "stop": 69268,
        "text": " like GitHub and GitLab, which of course have had those features for a while."
      },
      {
        "start": 69268,
        "stop": 69604,
        "text": " So far, Gette's version has three main parts."
      },
      {
        "start": 69604,
        "stop": 70186,
        "text": " The first is a definition and the implementation for what they call the Gette actions protocol."
      },
      {
        "start": 70186,
        "stop": 70622,
        "text": " This is also what you could use if you were a third-party CI/CD system."
      },
      {
        "start": 70622,
        "stop": 70998,
        "text": " This is also what you could use if you're a third-party CI/CD system if you wanted to"
      },
      {
        "start": 70998,
        "stop": 71316,
        "text": " push your results right into Gette."
      },
      {
        "start": 71316,
        "stop": 71848,
        "text": " Then there's a new runner built for Gette and a new actions management subsystem to"
      },
      {
        "start": 71848,
        "stop": 72122,
        "text": " help you keep track and organize all those actions."
      },
      {
        "start": 72122,
        "stop": 72548,
        "text": " Something that stands out to me with Gette's version of actions is it looks like they're"
      },
      {
        "start": 72548,
        "stop": 72870,
        "text": " aiming to be compatible with GitHub actions."
      },
      {
        "start": 72870,
        "stop": 73128,
        "text": " That's pretty smart since there's a lot of adoptions over there."
      },
      {
        "start": 73128,
        "stop": 73338,
        "text": " They support the YAML workflow format."
      },
      {
        "start": 73338,
        "stop": 73840,
        "text": " They're compatible with most existing actions plugins that are in the GitHub marketplace."
      },
      {
        "start": 73840,
        "stop": 74302,
        "text": " It seems this is possible because under the hood, it's all powered by Gette's new runner,"
      },
      {
        "start": 74302,
        "stop": 74956,
        "text": " which is based on ACT, an open source project which lets you run GitHub actions locally."
      },
      {
        "start": 74956,
        "stop": 75468,
        "text": " The project also notes that Gette actions go beyond just DevOps, saying, \"It lets"
      },
      {
        "start": 75468,
        "stop": 75784,
        "text": " you run workflows when other events happen in your repository."
      },
      {
        "start": 75784,
        "stop": 76226,
        "text": " For example, you can run a workflow to automatically add the repository labels whenever someone"
      },
      {
        "start": 76226,
        "stop": 76454,
        "text": " creates a new issue in your repository.\""
      },
      {
        "start": 76454,
        "stop": 77052,
        "text": " Now, of course, GitHub's version of this has become really popular in the last few"
      },
      {
        "start": 77052,
        "stop": 77152,
        "text": " years."
      },
      {
        "start": 77152,
        "stop": 77616,
        "text": " Heck, we use it at Jupyter Broadcasting behind the scenes to generate updates to our website"
      },
      {
        "start": 77616,
        "stop": 77788,
        "text": " when a new podcast comes out."
      },
      {
        "start": 77788,
        "stop": 78292,
        "text": " That's just one small example of all the crazy use cases these kinds of automation"
      },
      {
        "start": 78292,
        "stop": 78538,
        "text": " tools are used for these days."
      },
      {
        "start": 78538,
        "stop": 78988,
        "text": " So I think that's why it's really nice to see Gette's take on this for self-hosted"
      },
      {
        "start": 78988,
        "stop": 79088,
        "text": " users."
      },
      {
        "start": 79088,
        "stop": 79188,
        "text": " Sure, it's just a preview."
      },
      {
        "start": 79188,
        "stop": 79574,
        "text": " There's a lot more to come, but it's nice to have a little more feature parity because"
      },
      {
        "start": 79574,
        "stop": 80146,
        "text": " Gette, I mean, it's growing in popularity, and it's just a much lighter weight option"
      },
      {
        "start": 80146,
        "stop": 80610,
        "text": " compared to something like GitLab, which has had powerful CI/CD features for a long time,"
      },
      {
        "start": 80610,
        "stop": 81030,
        "text": " but is a lot more to manage if you're just hosting it for yourself."
      },
      {
        "start": 81030,
        "stop": 81298,
        "text": " Yeah, this is a lot simpler to get started with."
      },
      {
        "start": 81298,
        "stop": 81612,
        "text": " It probably makes sense for smaller teams or an individual."
      },
      {
        "start": 81612,
        "stop": 82030,
        "text": " And to the broader point, you know, it's nice to have both be really competitive and"
      },
      {
        "start": 82030,
        "stop": 82590,
        "text": " both be broadly feature complete and have some feature parity for the self-hosted options,"
      },
      {
        "start": 82590,
        "stop": 83002,
        "text": " because I think that's probably from a market perspective the best way to keep this type"
      },
      {
        "start": 83002,
        "stop": 83654,
        "text": " of tooling totally decentralized and, well, at least as decentralized as reasonably possible"
      },
      {
        "start": 83654,
        "stop": 84066,
        "text": " and not completely owned and locked up by Microsoft and GitHub."
      },
      {
        "start": 84066,
        "stop": 84166,
        "text": " That's the beauty of all this."
      },
      {
        "start": 84166,
        "stop": 84430,
        "text": " So that's one of the reasons this excites me and why we're keeping an eye on it."
      },
      {
        "start": 84430,
        "stop": 84870,
        "text": " We'll continue to watch it, see where things go, and let you know."
      },
      {
        "start": 84870,
        "stop": 85166,
        "text": " So be sure you don't miss a single episode of Linux Action News."
      },
      {
        "start": 85166,
        "stop": 85642,
        "text": " Go to LinuxActionNews.com/subscribe for all the ways to get new episodes."
      },
      {
        "start": 85642,
        "stop": 86198,
        "text": " And LinuxActionNews.com/contact for ways to get in touch and let us know about what wacky"
      },
      {
        "start": 86198,
        "stop": 86474,
        "text": " things you're using Actions for."
      },
      {
        "start": 86474,
        "stop": 86950,
        "text": " And just for a few more days, you can go to Jupiter.party and sign up with the promo code"
      },
      {
        "start": 86950,
        "stop": 87488,
        "text": " 2022 and take $2 off the lifetime membership price every single month."
      },
      {
        "start": 87488,
        "stop": 87870,
        "text": " Take a couple bucks off for the lifetime of your membership at Jupiter.party."
      },
      {
        "start": 87870,
        "stop": 88232,
        "text": " It's a great way to get every single show ad free, including this year Linux Action"
      },
      {
        "start": 88232,
        "stop": 88332,
        "text": " News."
      },
      {
        "start": 88332,
        "stop": 88926,
        "text": " And don't worry, we'll be back next week with our take on the latest Linux and open"
      },
      {
        "start": 88926,
        "stop": 89098,
        "text": " source news."
      },
      {
        "start": 89098,
        "stop": 89224,
        "text": " Thanks for joining us."
      },
      {
        "start": 89224,
        "stop": 89386,
        "text": " And that's all the news for this week."
      },
      {
        "start": 89386,
        "stop": 91186,
        "text": " [Music]"
      },
      {
        "start": 91186,
        "stop": 91386,
        "text": " [Music]"
      },
      {
        "start": 91386,
        "stop": 91586,
        "text": " [Music]"
      }
    ],
    "processing_time": {
      "secs": 650,
      "nanos": 251486778
    }
  },
  "metadata": {
    "title": "Linux Action News: Linux Action News 272",
    "pictures": [],
    "duration": {
      "secs": 912,
      "nanos": 314000000
    },
    "unique_id": "http://linuxactionnews.com/272"
  },
  "episode": {
    "title": "Linux Action News 272",
    "description": "Why we won't see a new Raspberry Pi until 2025, the first steps to Plasma 6 are being taken, and PipeWire gets a major Bluetooth upgrade.",
    "content": "<p><p>Why we won&#39;t see a new Raspberry Pi until 2025, the first steps to Plasma 6 are being taken, and PipeWire gets a major Bluetooth upgrade.</p><p>Sponsored By:</p><ul><li><a href=\"http://linode.com/lan\" rel=\"nofollow\">Linode</a>: <a href=\"http://linode.com/lan\" rel=\"nofollow\">Sign up using the link on this page and receive a $100 60-day credit towards your new account. </a></li><li><a href=\"https://kolide.com/lan\" rel=\"nofollow\">Kolide</a>: <a href=\"https://kolide.com/lan\" rel=\"nofollow\">User-centered, cross-platform endpoint security for teams that Slack. </a></li></ul><p><a href=\"https://www.jupiter.party/\" rel=\"payment\">Support Linux Action News</a></p><p>Links:</p><ul><li><a href=\"https://www.tomshardware.com/news/raspberry-pi-5-after-2023\" title=\"Raspberry Pi 5 Not Launching Until After 2023\" rel=\"nofollow\">Raspberry Pi 5 Not Launching Until After 2023</a> &mdash; Don't expect a Pi 5 next year [2023]\" Upton then expands and explains that 2023 is a \"recovery year\". </li><li><a href=\"https://www.youtube.com/watch?v=P9vna9jao9I\" title=\"Eben Upton Interview: Raspberry Pi Availability & More! - YouTube\" rel=\"nofollow\">Eben Upton Interview: Raspberry Pi Availability &amp; More! - YouTube</a></li><li><a href=\"https://www.tomshardware.com/news/raspberry-pi-adds-100000-units-to-supply-chain-back-to-pre-pandemic-levels-in-2023\" title=\"Raspberry Pi Adds 100,000 Units to Supply Chain, Back to Pre-pandemic Levels in 2023 | Toms Hardware\" rel=\"nofollow\">Raspberry Pi Adds 100,000 Units to Supply Chain, Back to Pre-pandemic Levels in 2023 | Toms Hardware</a> &mdash; In the blog post, Upton acknowledged the patience of the community and offers the 100,000 units, made up of Raspberry Pi Zero W, 3A+ and Raspberry Pi 4 2GB and 4GB for single-unit sale. We don't know the breakdown of how many of each model there will be, but Upton does indicate that it is likely that Raspberry Pi Zero W will come back into stock first. </li><li><a href=\"https://www.phoronix.com/news/KDE-Frameworks-6-Branch-Point\" title=\"KDE Frameworks 5.101 Released\" rel=\"nofollow\">KDE Frameworks 5.101 Released</a> &mdash; Per the plans laid out earlier this year at the Akademy developer conference, KDE Frameworks 5 feature development stops following the v5.101 release. KDE Frameworks 5 will now just see maintenance updates moving forward. </li><li><a href=\"https://alexxcons.github.io/blogpost_8.html\" title=\"Xfce 4.18 Released\" rel=\"nofollow\">Xfce 4.18 Released</a> &mdash; After almost two years of work, we are happy to announce the release of Xfce 4.18 !</li><li><a href=\"https://github.com/NixOS/nixpkgs/pull/206282\" title=\"Xfce 4.18 by muscaln 路 Pull Request #206282 路 NixOS/nixpkgs\" rel=\"nofollow\">Xfce 4.18 by muscaln 路 Pull Request #206282 路 NixOS/nixpkgs</a></li><li><a href=\"https://www.phoronix.com/news/PipeWire-0.3.62\" title=\"PipeWire Bluetooth Improvements\" rel=\"nofollow\">PipeWire Bluetooth Improvements</a> &mdash; Most exciting with today's PipeWire 0.3.62 release is now supporting Bluetooth offloading. </li><li><a href=\"https://gitlab.freedesktop.org/pipewire/wireplumber/-/releases\" title=\"Releases 路 PipeWire / wireplumber 路 GitLab\" rel=\"nofollow\">Releases 路 PipeWire / wireplumber 路 GitLab</a></li><li><a href=\"https://blog.gitea.io/2022/12/feature-preview-gitea-actions/\" title=\"Feature Preview: Gitea Actions\" rel=\"nofollow\">Feature Preview: Gitea Actions</a> &mdash; Gitea Actions goes beyond just DevOps and lets you run workflows when other events happen in your repository. </li><li><a href=\"https://gitea.com/gitea/act_runner\" title=\"act_runner\" rel=\"nofollow\">act_runner</a> &mdash; A runner for Gitea based on act.</li><li><a href=\"https://github.com/nektos/act\" title=\"act\" rel=\"nofollow\">act</a> &mdash; Run your GitHub Actions locally </li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-9172",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15862409/06f19935-0ba1-4074-ae04-fd181c9b2cde.mp3",
      "length": "13195072",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-12-22T09:25:00+01:00"
  },
  "speedup": 1.4030173
}