{
  "transcript": {
    "utterances": [
      {
        "start": 0,
        "stop": 964,
        "text": " Hello, and welcome to Linux Action News, Episode 273, recorded on December 28, 2022."
      },
      {
        "start": 964,
        "stop": 1064,
        "text": " I'm Chris."
      },
      {
        "start": 1064,
        "stop": 1164,
        "text": " And I'm Wes."
      },
      {
        "start": 1164,
        "stop": 1264,
        "text": " Hello, Wes."
      },
      {
        "start": 1264,
        "stop": 1364,
        "text": " Let's do the news."
      },
      {
        "start": 1364,
        "stop": 1872,
        "text": " It's our last episode of the year, and we wanted to take a look back at some of the"
      },
      {
        "start": 1872,
        "stop": 2280,
        "text": " stories that we still had a few things to say about."
      },
      {
        "start": 2280,
        "stop": 3008,
        "text": " Starting with the Steam Deck, which recently hit 7,000 games tagged as either playable"
      },
      {
        "start": 3008,
        "stop": 3108,
        "text": " or verified."
      },
      {
        "start": 3108,
        "stop": 3236,
        "text": " That's great."
      },
      {
        "start": 3236,
        "stop": 3664,
        "text": " And when the Steam Deck was first announced, I think we thought, \"Oh, okay, this is going"
      },
      {
        "start": 3664,
        "stop": 3764,
        "text": " to be something to watch.\""
      },
      {
        "start": 3764,
        "stop": 4156,
        "text": " And when they started shipping, they actually started shipping, started taking it seriously."
      },
      {
        "start": 4156,
        "stop": 4588,
        "text": " And the next kind of series of questions that came up was, \"Well, how is Valve going to"
      },
      {
        "start": 4588,
        "stop": 4776,
        "text": " support this thing?"
      },
      {
        "start": 4776,
        "stop": 4956,
        "text": " What's the software lifecycle going to be like?"
      },
      {
        "start": 4956,
        "stop": 5224,
        "text": " What's the compatibility story going to be like?\""
      },
      {
        "start": 5224,
        "stop": 5744,
        "text": " Valve's performed pretty well on both fronts, like you said, 7,000 titles, but they've also"
      },
      {
        "start": 5744,
        "stop": 6232,
        "text": " painted a pretty good picture of a relatively rapidly updated device with OS updates shipping"
      },
      {
        "start": 6232,
        "stop": 6380,
        "text": " out regularly."
      },
      {
        "start": 6380,
        "stop": 6868,
        "text": " And most of the time, actually noticeable improvements even just for the end user."
      },
      {
        "start": 6868,
        "stop": 7276,
        "text": " And I've really heard of no major significant issues that have blown up devices or bricked"
      },
      {
        "start": 7276,
        "stop": 7376,
        "text": " them."
      },
      {
        "start": 7376,
        "stop": 7476,
        "text": " Yeah."
      },
      {
        "start": 7476,
        "stop": 7920,
        "text": " I mean, as an example, SteamOS 3.4 shipped late last week."
      },
      {
        "start": 7920,
        "stop": 8348,
        "text": " And among the usual sorts of bug fixes and other improvements, it was interesting to"
      },
      {
        "start": 8348,
        "stop": 8924,
        "text": " note that they updated to Plasma 5.26 for their desktop mode."
      },
      {
        "start": 8924,
        "stop": 9450,
        "text": " That means they skipped over at least two point releases and picked up a bunch of significant"
      },
      {
        "start": 9450,
        "stop": 9700,
        "text": " fixes to Plasma itself and to discover."
      },
      {
        "start": 9700,
        "stop": 9800,
        "text": " Yeah."
      },
      {
        "start": 9800,
        "stop": 10188,
        "text": " Makes it even a better experience in managing flat packs now on the deck."
      },
      {
        "start": 10188,
        "stop": 10552,
        "text": " I generally read through the release notes for each SteamOS update before I've installed"
      },
      {
        "start": 10552,
        "stop": 11006,
        "text": " it on my deck and honestly kind of blown away by the rate of development."
      },
      {
        "start": 11006,
        "stop": 11384,
        "text": " They have sometimes break like little small things here and there."
      },
      {
        "start": 11384,
        "stop": 11944,
        "text": " Like an example would be, I think the deck originally shipped with SSD trim support,"
      },
      {
        "start": 11944,
        "stop": 12160,
        "text": " but then they had to roll it back for some reason."
      },
      {
        "start": 12160,
        "stop": 12344,
        "text": " I don't recall anymore."
      },
      {
        "start": 12344,
        "stop": 12702,
        "text": " And now with this most recent release, they've actually re-enabled it."
      },
      {
        "start": 12702,
        "stop": 13096,
        "text": " They've had a few small bugs like that, but they've stuck with them and they've got them"
      },
      {
        "start": 13096,
        "stop": 13260,
        "text": " fixed."
      },
      {
        "start": 13260,
        "stop": 13844,
        "text": " As for the deck hardware, well, of course, supply was rather tight this year, but now"
      },
      {
        "start": 13844,
        "stop": 14412,
        "text": " if you place an order, you can expect to receive it within just one or two weeks."
      },
      {
        "start": 14412,
        "stop": 14816,
        "text": " And a reservation, well, that's no longer required."
      },
      {
        "start": 14816,
        "stop": 15320,
        "text": " Valve staffers have also said publicly that the deck has crossed over a million units"
      },
      {
        "start": 15320,
        "stop": 15476,
        "text": " shipped."
      },
      {
        "start": 15476,
        "stop": 15984,
        "text": " And just recently, David Edmondson of KDE stated basically as much in a talk held at"
      },
      {
        "start": 15984,
        "stop": 16392,
        "text": " Academy 2022 titled Full Steam Ahead."
      },
      {
        "start": 16392,
        "stop": 16944,
        "text": " They have crossed over a million and they're still focusing on the back orders."
      },
      {
        "start": 16944,
        "stop": 17544,
        "text": " And once they've done the back orders, well, we're not still going on."
      },
      {
        "start": 17544,
        "stop": 17888,
        "text": " So once they've posted the back orders, then they expect another third of sales because"
      },
      {
        "start": 17888,
        "stop": 18240,
        "text": " then it's going to be available in store."
      },
      {
        "start": 18240,
        "stop": 18452,
        "text": " And that's going to be a huge boost."
      },
      {
        "start": 18452,
        "stop": 18882,
        "text": " This is just one of the reasons we wanted to reflect on the deck because it's clearly"
      },
      {
        "start": 18882,
        "stop": 19532,
        "text": " one of those news events that will have positive ramifications for the entire Linux space for"
      },
      {
        "start": 19532,
        "stop": 19632,
        "text": " years."
      },
      {
        "start": 19632,
        "stop": 20084,
        "text": " Even if you never game, parts of the Linux stack you depend on are going to get better"
      },
      {
        "start": 20084,
        "stop": 20600,
        "text": " because, well, at least a million users are out there banging on this and Valve is actively"
      },
      {
        "start": 20600,
        "stop": 20784,
        "text": " upstreaming their improvements."
      },
      {
        "start": 20784,
        "stop": 21264,
        "text": " And if you're a Plasma user, I seriously don't think you can overstate just what a great"
      },
      {
        "start": 21264,
        "stop": 21584,
        "text": " thing this is for the Plasma user base."
      },
      {
        "start": 21584,
        "stop": 22498,
        "text": " Well, we couldn't do a 2022 retrospective without talking about Asahi Linux."
      },
      {
        "start": 22498,
        "stop": 22598,
        "text": " So they're up next."
      },
      {
        "start": 22598,
        "stop": 23218,
        "text": " I don't know about you, Chris, but I think this year could be summed up as almost there."
      },
      {
        "start": 23218,
        "stop": 23318,
        "text": " Yeah, really."
      },
      {
        "start": 23318,
        "stop": 23418,
        "text": " Like so close."
      },
      {
        "start": 23418,
        "stop": 23518,
        "text": " So, so close."
      },
      {
        "start": 23518,
        "stop": 24054,
        "text": " And it's hard to tell if it's just now a few kernel releases away and all the parts will"
      },
      {
        "start": 24054,
        "stop": 24586,
        "text": " be there or if we're going to end up with a really long tail of stuff and potentially"
      },
      {
        "start": 24586,
        "stop": 24828,
        "text": " be in the same spot next year."
      },
      {
        "start": 24828,
        "stop": 25232,
        "text": " We did see some really positive things land even in the last few months, though, so I'm"
      },
      {
        "start": 25232,
        "stop": 25332,
        "text": " feeling pretty good."
      },
      {
        "start": 25332,
        "stop": 25948,
        "text": " For me, the big one, early GPU support with OpenGL 2.1 and GLS 2.0, that seems pretty"
      },
      {
        "start": 25948,
        "stop": 26048,
        "text": " significant."
      },
      {
        "start": 26048,
        "stop": 26562,
        "text": " And, true to the project's word, we've seen quite a bit of code actually make it all the"
      },
      {
        "start": 26562,
        "stop": 26794,
        "text": " way upstream."
      },
      {
        "start": 26794,
        "stop": 27246,
        "text": " If you dig around online, you can even find posts from folks running Asahi Linux as their"
      },
      {
        "start": 27246,
        "stop": 27586,
        "text": " daily driver right now."
      },
      {
        "start": 27586,
        "stop": 28062,
        "text": " The team also managed to pick up support for the M1 Pro and Ultra lines and made some good"
      },
      {
        "start": 28062,
        "stop": 28282,
        "text": " progress with M2 support this year."
      },
      {
        "start": 28282,
        "stop": 28750,
        "text": " Yeah, that actually might be one of the things people are discussing/debating at the end"
      },
      {
        "start": 28750,
        "stop": 28898,
        "text": " of next year."
      },
      {
        "start": 28898,
        "stop": 29130,
        "text": " Or it's going to be like a total non-issue."
      },
      {
        "start": 29130,
        "stop": 29632,
        "text": " But one of the concerns I've seen percolating online is that some believe that the project"
      },
      {
        "start": 29632,
        "stop": 30154,
        "text": " should have just remained focused on the original M1 devices, like the very first M1s that came"
      },
      {
        "start": 30154,
        "stop": 30254,
        "text": " out."
      },
      {
        "start": 30254,
        "stop": 30832,
        "text": " Get those as close to fully working as the team possibly can, and then expand to the"
      },
      {
        "start": 30832,
        "stop": 31342,
        "text": " Max and the Ultra and the M2 and the M3 lines and whatever comes next."
      },
      {
        "start": 31342,
        "stop": 31796,
        "text": " I suppose the logic with that argument is just minimize scope creep."
      },
      {
        "start": 31796,
        "stop": 32232,
        "text": " Apple's going to be continually revising and updating their hardware, not caring what Asahi"
      },
      {
        "start": 32232,
        "stop": 32410,
        "text": " support is like, of course."
      },
      {
        "start": 32410,
        "stop": 32924,
        "text": " So at what point do you just stop chasing whatever they've done now and focus on getting"
      },
      {
        "start": 32924,
        "stop": 33212,
        "text": " the hardware on the market working?"
      },
      {
        "start": 33212,
        "stop": 33540,
        "text": " But it's probably not quite as simple as that."
      },
      {
        "start": 33540,
        "stop": 34018,
        "text": " I mean, often with some of this low-level hardware stuff, it's really just minor changes"
      },
      {
        "start": 34018,
        "stop": 34488,
        "text": " to get the next bump to the CPU working correctly, not redoing things from scratch."
      },
      {
        "start": 34488,
        "stop": 34840,
        "text": " Yeah, and that's what Hector relayed to us when we interviewed him just about a year"
      },
      {
        "start": 34840,
        "stop": 34940,
        "text": " ago."
      },
      {
        "start": 34940,
        "stop": 35340,
        "text": " He said that the real hard work is the initial support, and then when they iterate in the"
      },
      {
        "start": 35340,
        "stop": 35638,
        "text": " M2 line and the Ultra line, it's not a ton of work."
      },
      {
        "start": 35638,
        "stop": 35952,
        "text": " I think that's mostly bared out true."
      },
      {
        "start": 35952,
        "stop": 36268,
        "text": " I don't think it's been 100% true, but I think it's been mostly true for them."
      },
      {
        "start": 36268,
        "stop": 36452,
        "text": " And the project pushes forward, right?"
      },
      {
        "start": 36452,
        "stop": 36908,
        "text": " And that Rust-written Apple DRM Linux kernel driver is showing some real progress, because"
      },
      {
        "start": 36908,
        "stop": 37356,
        "text": " back just in September, they had just been able to render a 3D cube."
      },
      {
        "start": 37356,
        "stop": 37928,
        "text": " And then shortly after that, Wayland got working, Gnome Shell working, and various apps up and"
      },
      {
        "start": 37928,
        "stop": 38234,
        "text": " running on Wayland all using that driver."
      },
      {
        "start": 38234,
        "stop": 38744,
        "text": " And of course, the project's work on the Apple silicon CPU frequency driver, well, that should"
      },
      {
        "start": 38744,
        "stop": 39168,
        "text": " be landing in the upcoming Linux 6.2 release."
      },
      {
        "start": 39168,
        "stop": 39692,
        "text": " But here's hoping by this time next year, our conversation has shifted from code being"
      },
      {
        "start": 39692,
        "stop": 40500,
        "text": " upstreamed to our experiences actually using Asahi Linux."
      },
      {
        "start": 40500,
        "stop": 40996,
        "text": " Well speaking of news stories that will continue to play out into 2023, the Fedora project"
      },
      {
        "start": 40996,
        "stop": 41606,
        "text": " announced their web installer project this year, and so did OpenSUSE."
      },
      {
        "start": 41606,
        "stop": 42058,
        "text": " And I have to say, I've recently come to have a bit of a greater appreciation for just how"
      },
      {
        "start": 42058,
        "stop": 42344,
        "text": " big of a change this is actually going to be."
      },
      {
        "start": 42344,
        "stop": 42754,
        "text": " A radical new era of Linux installers, perhaps."
      },
      {
        "start": 42754,
        "stop": 43392,
        "text": " I will say though, as a software dev myself, I like this approach of building with an API"
      },
      {
        "start": 43392,
        "stop": 43510,
        "text": " first."
      },
      {
        "start": 43510,
        "stop": 44048,
        "text": " You can reuse the same underlying technology, you can have convenience like web access to"
      },
      {
        "start": 44048,
        "stop": 44490,
        "text": " your installer, but that should also mean we see all kinds of tools or alternative front"
      },
      {
        "start": 44490,
        "stop": 44976,
        "text": " ends built that can all leverage the same backend work."
      },
      {
        "start": 44976,
        "stop": 45552,
        "text": " I've also got to say, with Fedora now supporting things like the Raspberry Pi very nicely,"
      },
      {
        "start": 45552,
        "stop": 45702,
        "text": " having a web installer just makes sense."
      },
      {
        "start": 45702,
        "stop": 46100,
        "text": " It just makes it super simple to install on headless systems as well as just one right"
      },
      {
        "start": 46100,
        "stop": 46200,
        "text": " in front of you."
      },
      {
        "start": 46200,
        "stop": 46616,
        "text": " That's got to be the other really big advantage, is the remote install capability."
      },
      {
        "start": 46616,
        "stop": 47222,
        "text": " Just for so many cloud instances and VMs and, like you said, the Raspberry Pi as well."
      },
      {
        "start": 47222,
        "stop": 47570,
        "text": " And Canonical is also working on their new installer."
      },
      {
        "start": 47570,
        "stop": 48048,
        "text": " Theirs is based around Flutter, but that actually can technically output web apps as well."
      },
      {
        "start": 48048,
        "stop": 48756,
        "text": " So it seems like after years of this Linux installer space just being a settled matter,"
      },
      {
        "start": 48756,
        "stop": 49548,
        "text": " in 2022 these new projects started up and it's all kind of back up in the air again"
      },
      {
        "start": 49548,
        "stop": 49694,
        "text": " with brand new features coming."
      },
      {
        "start": 49694,
        "stop": 50284,
        "text": " And I think once the distribution makers, like specifically of the flavors of the upstream"
      },
      {
        "start": 50284,
        "stop": 50636,
        "text": " or I guess the downstream of these distros, once they really wrap their head around the"
      },
      {
        "start": 50636,
        "stop": 50998,
        "text": " tooling, they're going to be able to build some powerful stuff specific to their flavor,"
      },
      {
        "start": 50998,
        "stop": 51180,
        "text": " their spin or whatever it is."
      },
      {
        "start": 51180,
        "stop": 51560,
        "text": " You know me, I'm just happy to see classic Anaconda getting retired."
      },
      {
        "start": 51560,
        "stop": 51800,
        "text": " Yeah, I know that is what you're rooting for."
      },
      {
        "start": 51800,
        "stop": 52196,
        "text": " If you want to try out these new web UI preview images for Fedora, the team has started to"
      },
      {
        "start": 52196,
        "stop": 52696,
        "text": " make images available, which you can try out and we will have a link in the show notes."
      },
      {
        "start": 52696,
        "stop": 53672,
        "text": " It hasn't even been a whole year, but Libinwata has already made an impact."
      },
      {
        "start": 53672,
        "stop": 54312,
        "text": " The first release was on December 31st, 2021, but it's widely deployed in the GNOME Stack"
      },
      {
        "start": 54312,
        "stop": 54412,
        "text": " already today."
      },
      {
        "start": 54412,
        "stop": 54692,
        "text": " Yeah, really quite the uptake."
      },
      {
        "start": 54692,
        "stop": 55124,
        "text": " And it was a bit controversial before it landed with some worrying that it would be the end"
      },
      {
        "start": 55124,
        "stop": 55520,
        "text": " of theming for GTK apps in GNOME, but that never really quite played out."
      },
      {
        "start": 55520,
        "stop": 55916,
        "text": " And I think the two sides have basically met somewhere in the middle, at least."
      },
      {
        "start": 55916,
        "stop": 56480,
        "text": " Libinwata makes it easier for GTK developers to build great looking modern GNOME apps,"
      },
      {
        "start": 56480,
        "stop": 56968,
        "text": " which are adaptive from the start so they can fit multiple screen sizes."
      },
      {
        "start": 56968,
        "stop": 57552,
        "text": " This year, we've also been impressed with the execution really across the GNOME community."
      },
      {
        "start": 57552,
        "stop": 58028,
        "text": " Along with the rollout of Libinwata, we saw a quick uptake of GTK 4."
      },
      {
        "start": 58028,
        "stop": 58548,
        "text": " And we also saw a considerable amount of cross project collaboration throughout the year"
      },
      {
        "start": 58548,
        "stop": 59252,
        "text": " to get those new features out to end users, like GTK 4 and Pipewire updates, design refreshes,"
      },
      {
        "start": 59252,
        "stop": 59524,
        "text": " and yes, Wayland improvements."
      },
      {
        "start": 59524,
        "stop": 59736,
        "text": " But it's not just GNOME."
      },
      {
        "start": 59736,
        "stop": 60080,
        "text": " Really, it's Plasma and GNOME that have impressed us this year."
      },
      {
        "start": 60080,
        "stop": 60684,
        "text": " I think 2023 was a great year for both the projects themselves and anyone using them"
      },
      {
        "start": 60684,
        "stop": 60884,
        "text": " on the desktop."
      },
      {
        "start": 60884,
        "stop": 61252,
        "text": " They managed to keep this same momentum up next year."
      },
      {
        "start": 61252,
        "stop": 61556,
        "text": " Us users will be in for a real treat."
      },
      {
        "start": 61556,
        "stop": 62040,
        "text": " Linode.com/lan."
      },
      {
        "start": 62040,
        "stop": 62292,
        "text": " Go there to get $100 and 60 day credit on a new account."
      },
      {
        "start": 62292,
        "stop": 62648,
        "text": " And it's a great way to support the show while you're checking out fast, reliable cloud hosting."
      },
      {
        "start": 62648,
        "stop": 62940,
        "text": " The best in the business with support that backs it up."
      },
      {
        "start": 62940,
        "stop": 63212,
        "text": " Real humans all day, every day, even the holidays, my friend."
      },
      {
        "start": 63212,
        "stop": 63448,
        "text": " And of course, Linode's got the value as well."
      },
      {
        "start": 63448,
        "stop": 63800,
        "text": " 30 to 50% cheaper than the hyperscalers that want to lock into their platforms with their"
      },
      {
        "start": 63800,
        "stop": 64112,
        "text": " crazy esoteric languages and their constant upsells."
      },
      {
        "start": 64112,
        "stop": 64260,
        "text": " You know what I'm talking about."
      },
      {
        "start": 64260,
        "stop": 64620,
        "text": " I love Linode too because I can build a system up from the ground or I can do these really"
      },
      {
        "start": 64620,
        "stop": 65052,
        "text": " common sense one click deployments like for Nextcloud or Mastodon."
      },
      {
        "start": 65052,
        "stop": 65256,
        "text": " You should consider it, my friends."
      },
      {
        "start": 65256,
        "stop": 65428,
        "text": " They make it really easy to get up and going."
      },
      {
        "start": 65428,
        "stop": 65676,
        "text": " You have that $100 credit to play around with it."
      },
      {
        "start": 65676,
        "stop": 65980,
        "text": " On top of that fantastic performance, you guys know that's a critical one for me."
      },
      {
        "start": 65980,
        "stop": 66428,
        "text": " 11 data centers around the world to choose from and they're spinning up another dozen"
      },
      {
        "start": 66428,
        "stop": 66584,
        "text": " next year."
      },
      {
        "start": 66584,
        "stop": 66948,
        "text": " Super fast rigs, features that are great, like S3 compatible object storage."
      },
      {
        "start": 66948,
        "stop": 67104,
        "text": " I mean, really great features."
      },
      {
        "start": 67104,
        "stop": 67264,
        "text": " They're not just like some add-on."
      },
      {
        "start": 67264,
        "stop": 67476,
        "text": " They're like great features."
      },
      {
        "start": 67476,
        "stop": 67784,
        "text": " Cloud firewalls that prevent traffic from hitting your rig that you never want and backups"
      },
      {
        "start": 67784,
        "stop": 68032,
        "text": " that make sense and they're easy to understand."
      },
      {
        "start": 68032,
        "stop": 68368,
        "text": " And Linode will also snap into any kind of infrastructure management tooling you might"
      },
      {
        "start": 68368,
        "stop": 68468,
        "text": " want to use."
      },
      {
        "start": 68468,
        "stop": 68852,
        "text": " They have a really clear, fantastic API that has lots of libraries they're ready to go"
      },
      {
        "start": 68852,
        "stop": 68952,
        "text": " to."
      },
      {
        "start": 68952,
        "stop": 69434,
        "text": " Linode's what we use for everything we deploy to our end users or I guess listeners."
      },
      {
        "start": 69434,
        "stop": 69796,
        "text": " And for ourselves, anything we're going to collaborate, anything we're going to host"
      },
      {
        "start": 69796,
        "stop": 70100,
        "text": " in the cloud, we do it on Linode on our terms."
      },
      {
        "start": 70100,
        "stop": 70348,
        "text": " So go get the hundred bucks and try it out for yourself and see what I'm talking about."
      },
      {
        "start": 70348,
        "stop": 70484,
        "text": " It's a great way to learn too."
      },
      {
        "start": 70484,
        "stop": 70672,
        "text": " It's a great system for that."
      },
      {
        "start": 70672,
        "stop": 70772,
        "text": " Linode.com/lan."
      },
      {
        "start": 70772,
        "stop": 70872,
        "text": " That's Linode.com/lan."
      },
      {
        "start": 70872,
        "stop": 71692,
        "text": " And thank you to Collide."
      },
      {
        "start": 71692,
        "stop": 72324,
        "text": " With Collide, endpoint security doesn't have to be a battle between IT admins and end users."
      },
      {
        "start": 72324,
        "stop": 72620,
        "text": " That's because Collide does things differently."
      },
      {
        "start": 72620,
        "stop": 73088,
        "text": " Collide provides user-centered solutions for companies that slack."
      },
      {
        "start": 73088,
        "stop": 73484,
        "text": " Users will receive security recommendations and Collide will automatically notify your"
      },
      {
        "start": 73484,
        "stop": 74016,
        "text": " team when their devices are insecure and give them step-by-step instructions to fix the"
      },
      {
        "start": 74016,
        "stop": 74116,
        "text": " problem."
      },
      {
        "start": 74116,
        "stop": 74688,
        "text": " And Collide's dashboard allows IT admins to easily monitor the security of the entire"
      },
      {
        "start": 74688,
        "stop": 75256,
        "text": " fleet, whether that's on Mac, Windows, or yes, Linux."
      },
      {
        "start": 75256,
        "stop": 75754,
        "text": " With Collide, you can build a culture of security and meet your compliance goals."
      },
      {
        "start": 75754,
        "stop": 76472,
        "text": " Go try it out for free at Collide.com/lan and get a goodie bag just for activating your"
      },
      {
        "start": 76472,
        "stop": 76572,
        "text": " trial."
      },
      {
        "start": 76572,
        "stop": 76960,
        "text": " It's time to put end users first with Collide."
      },
      {
        "start": 76960,
        "stop": 77656,
        "text": " That's Collide.com/lan."
      },
      {
        "start": 77656,
        "stop": 78072,
        "text": " This year, Nvidia made a huge splash when they announced their open source kernel driver"
      },
      {
        "start": 78072,
        "stop": 78492,
        "text": " for their famous or maybe infamous GPUs."
      },
      {
        "start": 78492,
        "stop": 78888,
        "text": " And this being a multi-year effort, really the story is still just beginning at the end"
      },
      {
        "start": 78888,
        "stop": 78988,
        "text": " of this year."
      },
      {
        "start": 78988,
        "stop": 79536,
        "text": " But the official announcement was made on May 11th, but your humble hosts began to suspect"
      },
      {
        "start": 79536,
        "stop": 79936,
        "text": " something was going on around April 21st of this year."
      },
      {
        "start": 79936,
        "stop": 80526,
        "text": " You see, in episode 273 of Linux Action News, we covered that Nvidia was dropping some new"
      },
      {
        "start": 80526,
        "stop": 80956,
        "text": " direct rendering manager code for the kernel and they were upstreaming that."
      },
      {
        "start": 80956,
        "stop": 81340,
        "text": " We started to ponder if this could be a sign of something more significant to come."
      },
      {
        "start": 81340,
        "stop": 81692,
        "text": " [Music]"
      },
      {
        "start": 81692,
        "stop": 82004,
        "text": " This latest dump is out for review right now."
      },
      {
        "start": 82004,
        "stop": 82600,
        "text": " And if that goes well, it could clear the way for the NV-DLA stack to be at least considered"
      },
      {
        "start": 82600,
        "stop": 82984,
        "text": " for mainline kernel adoption sometime down the line."
      },
      {
        "start": 82984,
        "stop": 83084,
        "text": " Right."
      },
      {
        "start": 83084,
        "stop": 83400,
        "text": " And then we'd be looking at an open source driver from Nvidia in the kernel, an open"
      },
      {
        "start": 83400,
        "stop": 83672,
        "text": " source user space driver as well."
      },
      {
        "start": 83672,
        "stop": 84248,
        "text": " And one wants to believe maybe Nvidia is building towards something here, establishing new relationships"
      },
      {
        "start": 84248,
        "stop": 84730,
        "text": " and doing things differently, laying some kind of groundwork for maybe an open source"
      },
      {
        "start": 84730,
        "stop": 85060,
        "text": " driver for the rest of their hardware."
      },
      {
        "start": 85060,
        "stop": 85260,
        "text": " [Music]"
      },
      {
        "start": 85260,
        "stop": 86316,
        "text": " Then, just a few short weeks after those ponderings, Nvidia announced their plans for an open source"
      },
      {
        "start": 86316,
        "stop": 86584,
        "text": " GPU driver."
      },
      {
        "start": 86584,
        "stop": 87184,
        "text": " Christian Schaller, the director for desktop, graphics, infotainment, and more at Red Hat,"
      },
      {
        "start": 87184,
        "stop": 87528,
        "text": " joined us in episode 240 to cover that news."
      },
      {
        "start": 87528,
        "stop": 87980,
        "text": " And he told us that the process had technically been in the works for years."
      },
      {
        "start": 87980,
        "stop": 88256,
        "text": " Yeah, we've been probably talking with Nvidia."
      },
      {
        "start": 88256,
        "stop": 88740,
        "text": " I mean, we have had a bigger discussion with Nvidia around this for literally for years,"
      },
      {
        "start": 88740,
        "stop": 88840,
        "text": " pushing them towards this."
      },
      {
        "start": 88840,
        "stop": 89170,
        "text": " But I mean, in terms of this concrete effort that is now coming to fruition, I would say"
      },
      {
        "start": 89170,
        "stop": 89548,
        "text": " that we've been working more intensively on it for at least three months."
      },
      {
        "start": 89548,
        "stop": 90030,
        "text": " Now with some luck, 2023 should be the year that distribution makers can start to benefit"
      },
      {
        "start": 90030,
        "stop": 90316,
        "text": " from the open source Nvidia driver and updated MesaStack."
      },
      {
        "start": 90316,
        "stop": 90416,
        "text": " Who knows?"
      },
      {
        "start": 90416,
        "stop": 90564,
        "text": " It could still take a while."
      },
      {
        "start": 90564,
        "stop": 90944,
        "text": " But ultimately, you'll know it's working because you won't notice anything."
      },
      {
        "start": 90944,
        "stop": 91080,
        "text": " I mean, quite literally."
      },
      {
        "start": 91080,
        "stop": 91592,
        "text": " End users will know it was a success when they install Linux on a machine that's equipped"
      },
      {
        "start": 91592,
        "stop": 92172,
        "text": " with an Nvidia card, and they just do nothing and 3D acceleration is fully working."
      },
      {
        "start": 92172,
        "stop": 92328,
        "text": " That's the success line."
      },
      {
        "start": 92328,
        "stop": 92844,
        "text": " Oh boy, I can't wait for that day to come."
      },
      {
        "start": 92844,
        "stop": 93300,
        "text": " Overall though, I'm not sure it was really a fantastic year for Nvidia."
      },
      {
        "start": 93300,
        "stop": 93606,
        "text": " It was the largest ever deal in this industry."
      },
      {
        "start": 93606,
        "stop": 94226,
        "text": " But the American firm Nvidia says now it won't be buying Britain's ARM Holdings, the $40 billion"
      },
      {
        "start": 94226,
        "stop": 94842,
        "text": " deal being scrapped due to pressure from regulators in the UK, EU and the United States."
      },
      {
        "start": 94842,
        "stop": 95388,
        "text": " It's hard to even imagine the scope of the impact if Nvidia ended up owning ARM."
      },
      {
        "start": 95388,
        "stop": 95968,
        "text": " Even if you just focused on the implications for the mobile market or the data center,"
      },
      {
        "start": 95968,
        "stop": 96468,
        "text": " just thinking about it in those two sectors alone are hard to even comprehend."
      },
      {
        "start": 96468,
        "stop": 96756,
        "text": " I think most of us were in shock when this was announced."
      },
      {
        "start": 96756,
        "stop": 97174,
        "text": " It was ultimately torpedoed by all of the regulatory bodies from the different Western"
      },
      {
        "start": 97174,
        "stop": 97584,
        "text": " countries raising red flags, primarily the FTC."
      },
      {
        "start": 97584,
        "stop": 98088,
        "text": " And I think ultimately, most of us feel it was for the best that the deal fell through."
      },
      {
        "start": 98088,
        "stop": 98840,
        "text": " It does maybe reveal to us though a bit about the size of Nvidia's ambitions."
      },
      {
        "start": 98840,
        "stop": 99316,
        "text": " I don't know that they feel content to just have ownership of the graphics card market."
      },
      {
        "start": 99316,
        "stop": 99584,
        "text": " Yeah, I think you're probably right about that."
      },
      {
        "start": 99584,
        "stop": 99762,
        "text": " Probably something we should keep an eye on."
      },
      {
        "start": 99762,
        "stop": 100132,
        "text": " That and everything else going on in the world of Linux and open source software."
      },
      {
        "start": 100132,
        "stop": 100340,
        "text": " So don't miss a single episode in 2023."
      },
      {
        "start": 100340,
        "stop": 100800,
        "text": " Go to LinuxActionNews.com/subscribe for all the ways to get new episodes."
      },
      {
        "start": 100800,
        "stop": 101172,
        "text": " And LinuxActionNews.com/contact for ways to keep in touch."
      },
      {
        "start": 101172,
        "stop": 101300,
        "text": " Did we miss a story?"
      },
      {
        "start": 101300,
        "stop": 101744,
        "text": " Boost in with the new podcast app or at the podcast index.org and tell us what you'd like"
      },
      {
        "start": 101744,
        "stop": 101844,
        "text": " us to cover."
      },
      {
        "start": 101844,
        "stop": 102444,
        "text": " We'll be back next week and next year with our take on the latest Linux and open source"
      },
      {
        "start": 102444,
        "stop": 102544,
        "text": " news."
      },
      {
        "start": 102544,
        "stop": 102712,
        "text": " Thanks for joining us."
      },
      {
        "start": 102712,
        "stop": 102868,
        "text": " Have a great New Year's."
      },
      {
        "start": 102868,
        "stop": 103036,
        "text": " And that's all the news for this week."
      },
      {
        "start": 103036,
        "stop": 104836,
        "text": " [Music]"
      },
      {
        "start": 104836,
        "stop": 105036,
        "text": " [Music]"
      },
      {
        "start": 105036,
        "stop": 105236,
        "text": " [Music]"
      }
    ],
    "processing_time": {
      "secs": 574,
      "nanos": 810548030
    }
  },
  "metadata": {
    "title": "Linux Action News: Linux Action News 273",
    "pictures": [],
    "duration": {
      "secs": 1048,
      "nanos": 346000000
    },
    "unique_id": "http://linuxactionnews.com/273"
  },
  "episode": {
    "title": "Linux Action News 273",
    "description": "There are some stories so big they need a little more air time.",
    "content": "<p><p>There are some stories so big they need a little more air time.</p><p>Sponsored By:</p><ul><li><a href=\"https://kolide.com/lan\" rel=\"nofollow\">Kolide</a>: <a href=\"https://kolide.com/lan\" rel=\"nofollow\">User-centered, cross-platform endpoint security for teams that Slack. </a></li><li><a href=\"http://linode.com/lan\" rel=\"nofollow\">Linode</a>: <a href=\"http://linode.com/lan\" rel=\"nofollow\">Sign up using the link on this page and receive a $100 60-day credit towards your new account. </a></li></ul><p><a href=\"https://www.jupiter.party/\" rel=\"payment\">Support Linux Action News</a></p><p>Links:</p><ul><li><a href=\"https://conf.kde.org/event/4/contributions/94/\" title=\"Akademy 2022: Full Steam ahead!\" rel=\"nofollow\">Akademy 2022: Full Steam ahead!</a> &mdash; In this talk I will share how Plasma fits into the Steamdeck and what aspects of KDE made us the right choice for their new userbase. I will then share some of the projects that contractors Blue Systems have been doing for Valve and how the work there benefits not just the Steamdeck but improves the ecosystem for all Plasma users. </li><li><a href=\"https://www.gamingonlinux.com/articles/category/Steam_Deck/\" title=\"GamingOnLinux category: Steam Deck\" rel=\"nofollow\">GamingOnLinux category: Steam Deck</a></li><li><a href=\"https://fedoraproject.org/wiki/Changes/Anaconda_Web_UI_preview_image\" title=\"Anaconda Web UI preview image\" rel=\"nofollow\">Anaconda Web UI preview image</a> &mdash; Download the Anaconda Web UI preview image and boot it on VM or hardware that contains no important data. </li><li><a href=\"https://www.phoronix.com/news/Fedora-37-WebUI-Install-Preview\" title=\"Fedora 37 Hopes To Have A Preview Of The New Web-Based Install UI\" rel=\"nofollow\">Fedora 37 Hopes To Have A Preview Of The New Web-Based Install UI</a></li><li><a href=\"https://puri.sm/posts/libadwaita-in-the-wild/\" title=\"Libadwaita in the Wild\" rel=\"nofollow\">Libadwaita in the Wild</a> &mdash; It’s hard to believe, but Libadwaita is not even one year old, having first been released on December 31, 2021.</li><li><a href=\"https://gitlab.gnome.org/GNOME/libadwaita\" title=\"libadwaita\" rel=\"nofollow\">libadwaita</a> &mdash; Building blocks for modern GNOME applications.</li><li><a href=\"https://blogs.gnome.org/uraeus/2022/05/11/why-is-the-open-source-driver-release-from-nvidia-so-important-for-linux/\" title=\"Why the open source driver release from NVIDIA is so important for Linux?\" rel=\"nofollow\">Why the open source driver release from NVIDIA is so important for Linux?</a> &mdash; Today NVIDIA announced that they are releasing an open source kernel driver for their GPUs, so I want to share with you some background information and how I think this will impact Linux graphics and compute going forward.</li><li><a href=\"https://linuxactionnews.com/240\" title=\"Linux Action News 240\" rel=\"nofollow\">Linux Action News 240</a> &mdash; NVIDIA has announced its plans for an open-source GPU driver. Christian Schaller, the Director for Desktop, Graphics, Infotainment and more at Red Hat, gives us the inside scoop on this historic announcement.</li><li><a href=\"https://www.forbes.com/sites/siladityaray/2022/02/08/nvidia-abandons-plans-to-acquire-arm-amid-regulatory-pressure-british-chipmaker-will-explore-ipo/?sh=331b4e2d2e59\" title=\"Nvidia Scraps ARM Acquisition After Regulatory Pressure, Owner SoftBank Prepares Chipmaker For IPO\" rel=\"nofollow\">Nvidia Scraps ARM Acquisition After Regulatory Pressure, Owner SoftBank Prepares Chipmaker For IPO</a></li><li><a href=\"https://www.youtube.com/watch?v=CSrCFrMhg-4\" title=\"Chips are down: Nvidia abandons $40 billion deal to purchase Arm Holdings\" rel=\"nofollow\">Chips are down: Nvidia abandons $40 billion deal to purchase Arm Holdings</a></li></ul></p>\n",
    "link": "https://feed.jupiter.zone/allshows#entry-9195",
    "enclosure": {
      "url": "https://feed.jupiter.zone/link/19057/15872436/6da765ff-3f0d-417e-92f5-d14948131251.mp3",
      "length": "15108440",
      "mime_type": "audio/mpeg"
    },
    "pub_date": "2022-12-29T08:25:00+01:00"
  },
  "speedup": 1.8238113
}